[
    {
        "thread_id": 225,
        "name": "harding",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=1652",
        "subject": "How To Make a Distributed BitCoin Escrow Service",
        "url": "https://bitcointalk.org/index.php?topic=1283.msg14070#msg14070",
        "date": "September 26, 2010, 01:16:18 AM",
        "content": "<div class=\"post\">Summary: Giving BitCoin a decentralized escrow would give it an advantage over all other exchange mediums, which might increase its adoption rate.  Details follow.<br/><br/>For a <i>decentralized</i> currency, <i>centralized</i> escrows seem to be the norm for BitCoin today.  An example:<br/><br/>Alice wants to buy $5 USD worth of BitCoins from Bob, but neither Alice nor Bob fully trust the other, so they go to a site they both trust--say Mt. Gox. There they deposit their respective monies and there they have Mt. Gox make the exchange for them.<br/><br/>No offense to Mt. Gox (a site I like), but can we do without its escrow service?<br/><br/>An almost distributed alternative: <br/><br/><ul style=\"margin-top: 0; margin-bottom: 0;\"><li> Charlie, a trusted third-party, generates a BitCoin private key.</li><li> Charlie then uses the Unix command <tt>split</tt> to split the private key in half--giving one half to Alice and one half to Bob.</li><li> Bob deposits $5 USD worth of BitCoins into the split BitCoin account;</li><li> Alice verifies the transaction using the public block; </li><li> Alice sends $5 USD to Bob by PayPal; </li><li> Bob verifies the PayPal transaction; </li><li> Bob sends Alice his half of the split private key so Alice can access the BitCoins he deposited earlier.</li></ul><br/>(For simplicity I omit part of the PayPal details like who pays the transaction fee and how long you should wait to avoid chargeback fraud.  I also omit any incentive for Bob to perform the final step.)<br/><br/>More advanced almost-distributed examples can be made if we substitute something more sophisticated for the Unix command <tt>split</tt>. For example: a Shamir's secret sharing scheme implementation like <tt>ssss</tt>[1]. A utility like <tt>ssss</tt> allows Alice and Bob to appoint an arbiter in case they get in a disagreement.<br/><br/>The problem with all of this, of course, is that we must trust Charlie to not abuse the full copy of the private key he creates.<br/><br/>The ideal solution would be for Alice and Bob to each generate half of the private key on their own. I don't fully understand the math used in modern keypairs, but I doubt this is possible with the current algorithm.<br/><br/>Is there an alternative way for Alice and Bob to each acquire half of a private key without giving the whole key to any party?<br/><br/>-Dave<br/><br/>[1] See: <a href=\"http://en.wikipedia.org/wiki/Shamir's_Secret_Sharing\">http://en.wikipedia.org/wiki/Shamir's_Secret_Sharing</a><br/></div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 225,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: How To Make a Distributed BitCoin Escrow Service",
        "url": "https://bitcointalk.org/index.php?topic=1283.msg14136#msg14136",
        "date": "September 26, 2010, 05:34:26 PM",
        "content": "<div class=\"post\">It's not implemented yet, but the network can support a transaction that requires two signatures.  It's described here:<br/><a href=\"http://bitcointalk.org/index.php?topic=750.0\">http://bitcointalk.org/index.php?topic=750.0</a><br/><br/>It's absolutely safer than a straight payment without escrow, but not as good as a human arbitrated escrow, assuming you trust the human enough.<br/><br/>In this kind of escrow, a cheater can't win, but it's still possible for you to lose.  It at least takes away the profit motive for cheating you.  The seller is assured that the money is reserved for him, while the buyer retains the leverage that the seller hasn't been paid yet until completion.<br/></div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    }
]