[
    {
        "thread_id": 21,
        "name": "BitcoinFX",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=30",
        "subject": "Win32 CPU Cycles vs 'Live Protection' Engines ?",
        "url": "https://bitcointalk.org/index.php?topic=35.msg189#msg189",
        "date": "February 01, 2010, 06:51:53 PM",
        "content": "<div class=\"post\">I wanted to document an issue I encountered when first installing and using the Bitcoin software.<br/><br/>Despite a correct installation and port forward settings I noticed that Bitcoin was not generating any coins or 'blocks' despite having 20+ connections for the first 24hrs. The block count just remained at 0. After realizing that Bitcoin was not 'catching up' with the collective network block download or generation I opened up the Task Manager to investigate the issue further.<br/><br/>I noticed that the bitcoin.exe process seemed to be 'fighting' for CPU usage against MsMpEng.exe (Microsoft Security Essentials). I hadn't noticed any system slowdown due to having a fairly high spec. PC. After adding bitcoin.exe and the appropriate program folder locations to Exclude 'Files and Locations' and 'Exclude Processes' - Bitcoin instantly started generating blocks and the CPU processes returned to normal.<br/><br/>I did <b>not</b> have any virus alerts or even 'false positive' identifications for Bitcoin. <b>I know that the software is 100% OK</b>. I'm assuming that the 'Live Protection' engine in Microsoft Security Essentials just doesn't 'play well' with some aspect of the CPU hungry cycles used in 'block' generation.<br/><br/>I have yet to do more testing, however I also encountered the same issue when using Comodo Internet Security (free version).<br/><br/>This is obviously going to be an issue for lots of new Bitcoin users who will perhaps be less 'tech savvy'. Has anyone else encountered any similar issues ?</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 21,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Win32 CPU Cycles vs 'Live Protection' Engines ?",
        "url": "https://bitcointalk.org/index.php?topic=35.msg220#msg220",
        "date": "February 03, 2010, 11:36:54 PM",
        "content": "<div class=\"post\">Thanks for that.  Which version of Windows?</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    }
]