[
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7771#msg7771",
        "date": "August 06, 2010, 01:52:00 AM",
        "content": "<div class=\"post\">Let me begin by saying that Bitcoin is an amazing project and I am very impressed with the implementation and the goals. From reading these forums it seems to be understood that debate about the design and operation of the bitcoin economy ultimately serves to strengthen it, so I hope these comments are taken in that spirit. *EDIT - I have been convinced by further research and discussion that Bitcoin is actually highly efficient compared to most traditional currencies, because the infrastructure required to support a government issued fiat currency represents a much larger investment of resources than Bitcoin's cpu power consumption. I am leaving this thread active though because it has been generating a lot of interesting discussion.*<br/><br/>I believe that the amount of energy input required to the bitcoin economy represents a serious obstacle to its growth. I think in the long-term, transactions may be even more serious than minting in this regard, but I will for the moment discuss minting because it is more precisely bounded and defined. The idea that the value of bitcoins is in some way related to the value of the electricity required, on average, to mint a winning block is generally accepted, but the precise nature of this relationship is contentious. <br/><br/>One argument is that anyone who chooses to generate coins is actually making the choice to purchase bitcoins with electricity/computational resources, and that because some/many people are in fact making that choice, bitcoins have at least that much \"value\" to the generators, who can be assumed to be maximizing their utility. A contrasting argument is that cost of production is different than market value, and the most objective measure is the current market conversion price to a more liquid and widely traded currency such as the US dollar.<br/><br/>My contention is that both of these arguments miss the point and the real problem, which is the fundamental perversity of wasting large amounts of energy and computations in generating the winning blocks for the minting process. The minting process exists because of the necessity of actually \"printing\" the currency, and certain desirable properties of crypto-math for making the currency's behavior predictable. The fact that the current minting process requires a large energy input of computational work is highly unfortunate and has the perverse consequence that bitcoin may actually be \"destroying wealth\" in the sense of wasting energy producing a digital object worth less than the resources invested in it.<br/><br/>As is often pointed out, a currency does not necessarily have, or need to have, any inherent value - a medium of exchange is a useful tool and can have value purely as a consequence of social convention. The cost of production of bitcoins in electricity consumed represents a waste, a \"thermodynamic burden\" that the currency has to carry. Consider a hypothetical alternative digital currency called \"compucoin\", which purchases cpu cycles from nodes on the network. The market value of this currency would converge very closely with the cost of electricity required to generate cpu cycles. Instead of costing cpu cycles to mint, the value of the cpu cycles the coins could be exchanged for would create a rational basis for the currency's value and integrate it with an existing market. I imagine that alternatives to Bitcoin (many of them probably sharing a lot of Bitcoin's source code) will inevitably emerge and Bitcoin's current minting process makes the currency \"expensive\" in terms of energy input. I believe this places it at a competitive disadvantage to other currencies and can only hinder its widespread adoption and long-term value. *Edit - as mentioned above, I am now much more optimistic about Bitcoin long term. I still think compucoins would be a cool idea, though!*</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7772#msg7772",
        "date": "August 06, 2010, 02:26:50 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7771#msg7771\">Quote from: gridecon on August 06, 2010, 01:52:00 AM</a></div><div class=\"quote\">I believe that the amount of energy input required to the bitcoin economy represents a serious obstacle to its growth. I think in the long-term, transactions may be even more serious than minting in this regard, but I will for the moment discuss minting because it is more precisely bounded and defined. The idea that the value of bitcoins is in some way related to the value of the electricity required, on average, to mint a winning block is generally accepted, but the precise nature of this relationship is contentious. <br/><br/>One argument is that anyone who chooses to generate coins is actually making the choice to purchase bitcoins with electricity/computational resources, and that because some/many people are in fact making that choice, bitcoins have at least that much \"value\" to the generators, who can be assumed to be maximizing their utility. A contrasting argument is that cost of production is different than market value, and the most objective measure is the current market conversion price to a more liquid and widely traded currency such as the US dollar.<br/></div>My only counter is that it will seem that way to a first time user, because they have no bitcoins at all. But there are a possible 3.6 million bitcoins out there plus a member here runs a site that gives away free bitcoins so people can experiment with the system. The amount of actually energy, if you break it down, is only that of the PC itself. When you consider how few watts a processor runs to get a block where each 50 BTC block is worth about $3 USD, that's much more than the electricity cost it took to create it. Right now, you can generate BitCoins and sell them for more than it cost the electricity to run the PC to do it unless your electrical rates are the highest in the world. The only reason no one does is the scale of economics that would be required to make it profitable.<br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">My contention is that both of these arguments miss the point and the real problem, which is the fundamental perversity of wasting large amounts of energy and computations in generating the winning blocks for the minting process. The minting process exists because of the necessity of actually \"printing\" the currency, and certain desirable properties of crypto-math for making the currency's behavior predictable. The fact that the current minting process requires a large energy input of computational work is highly unfortunate and has the perverse consequence that bitcoin may actually be \"destroying wealth\" in the sense of wasting energy producing a digital object worth less than the resources invested in it.<br/></div>The same can be said about gene folding or SETI since a ton of CPU time and electricity often does not reward the individual user of the their client software. It's the collection as a whole that rewards everyone in non-monetary ways (find cure for cancer, find aliens, etc.)<br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">As is often pointed out, a currency does not necessarily have, or need to have, any inherent value - a medium of exchange is a useful tool and can have value purely as a consequence of social convention. The cost of production of bitcoins in electricity consumed represents a waste, a \"thermodynamic burden\" that the currency has to carry. Consider a hypothetical alternative digital currency called \"compucoin\", which purchases cpu cycles from nodes on the network. The market value of this currency would converge very closely with the cost of electricity required to generate cpu cycles. Instead of costing cpu cycles to mint, the value of the cpu cycles the coins could be exchanged for would create a rational basis for the currency's value and integrate it with an existing market. I imagine that alternatives to Bitcoin (many of them probably sharing a lot of Bitcoin's source code) will inevitably emerge and Bitcoin's current minting process makes the currency \"expensive\" in terms of energy input. I believe this places it at a competitive disadvantage to other currencies and can only hinder its widespread adoption and long-term value.<br/></div>Unless electrical rates go up higher than the value of BTC, there will always be people willing to trade out CPU resources for it. Currently, cheap VPS farming has a return on BTC generation, though not very much. The other benefit is that the generation rate tries to remain constant, so it's not always going be hard to generate BTC if less and less people decide to do it, the difficulty goes back down.</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7775#msg7775",
        "date": "August 06, 2010, 03:00:12 AM",
        "content": "<div class=\"post\">Thanks very much for the extensive and informative reply. I do not disagree with the points that you made, but I also don't believe it invalidates my fundamental point: it is not inherently necessary for a digital currency such as bitcoin to require as much energy input as bitcoin does. A digital currency that offers bitcoin's behavior at a \"lower cost\" of energy overhead of the currency and transaction system has a competitive advantage. The digital currencies that will win and become standards, I believe, are the ones that offer the most value-added on top of the costs of running the system. Of course, there is room for many currencies - we already have a multiplicity - so it is not necessary for Bitcoin to become the \"one true money\" for it to succeed, but I believe the current minting policies will be harmful to its growth and adoption long-term. Much of the utility value of bitcoin resides in the work done to establish the security and reliability of the system - accomplishing that work with a smaller energy input would seem to be beneficial.</div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7777#msg7777",
        "date": "August 06, 2010, 03:30:45 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7775#msg7775\">Quote from: gridecon on August 06, 2010, 03:00:12 AM</a></div><div class=\"quote\">Thanks very much for the extensive and informative reply. I do not disagree with the points that you made, but I also don't believe it invalidates my fundamental point: it is not inherently necessary for a digital currency such as bitcoin to require as much energy input as bitcoin does. A digital currency that offers bitcoin's behavior at a \"lower cost\" of energy overhead of the currency and transaction system has a competitive advantage. The digital currencies that will win and become standards, I believe, are the ones that offer the most value-added on top of the costs of running the system. Of course, there is room for many currencies - we already have a multiplicity - so it is not necessary for Bitcoin to become the \"one true money\" for it to succeed, but I believe the current minting policies will be harmful to its growth and adoption long-term. Much of the utility value of bitcoin resides in the work done to establish the security and reliability of the system - accomplishing that work with a smaller energy input would seem to be beneficial.<br/></div><br/>I think though you are comparing apples to oranges. The coin generation is for currency creation. You don't need to generate any coin to use the bitcoin system. You can purchase it from many market sites or get some donated for free from other sites. The current minting policy is what makes it useful because a digital currency where everyone has unlimited amounts (or large starting amounts) just causes unnecessary starting inflation. The overhead for the currency is by design, otherwise if someone creates an *easier* system, it will be quickly abused. Since you can't make everyone play fair, you create something where it's nearly impossible to cheat by using math. To make cheating expensive instead of \"easy\" is where this system works. If it's more profitable to generate coin than to cheat it, guess which one everyone will go with?</div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7781#msg7781",
        "date": "August 06, 2010, 03:50:10 AM",
        "content": "<div class=\"post\">Nicely written gridecon. I completely agree. <br/><br/>I've been considering posting a similar critique but you've laid the issue out clearly. if you don't mind I'll add my thoughts here.<br/><br/>As the minting process and the transaction recording process are one, there is really no reason to separate them. I don't disagree with knightmb's points at all. But I do think that is is really important to point out that all that CPU power and electricity usage is absolutely NOT required for the task at hand.<br/><br/>Generating blocks serves three critical but independent functions in the bitcoin system.<br/><br/>1. It permanently records valid transactions in a roughly chronological order.<br/>2. It creates *consensus* among all nodes on what transactions took place and when, WITHOUT relying on a central authority. That was a hugely clever breakthrough.<br/>3. It trickles bitcoins into circulation at a regularly scheduled rate. (roughtly 50 BTC/10 min) Also a nice motivational trick.<br/><br/><br/>However, all of these required tasks could be done in a much more efficient manner.<br/><br/>Generally in a P2P system, if you add more nodes then the necessary machine resources needed per node decrease. (for a given usage level of the service)<br/>However, if we add more nodes to the bitcoin network the necessary machine resources needed per node increase. This is true of CPU usage and network bandwidth. <br/><br/>Satoshi already pointed out that the goal of this is not to scale to millions of pure P2P nodes. But instead to have thousands of transaction checking peers each having thousands of clients. That means the goal is to create core \"central authority\" of peer nodes each of which is trusted by some clients, but the core peers do not necessarily need to trust each other. This is a absolutely critical design construct if the current implementation of bitcoin is expected to scale to millions of traders.<br/><br/>However, there are other design possibilities that could meet each of these three critical goals without exponential growth in resources utilization.<br/><br/>Implementing the transaction graph using a redundant distributed hash table comes to mind. This could be done with or without a core of central peers. Another possibility would be just to store the transaction graph in a SQL database and use database replication among the core peers. Either of those satisfies goal 1 and 2 using minimal system resources.<br/><br/>Goal 3 is implementable by simply generating a distributed shared secret, then using that shared secret as a concensus random node to send 50 BTC to.<br/><br/><br/>I agree with gridecon that such an implementation would out compete the current implementation. Even if it otherwise following exactly the same external behavior and transaction validation rules.</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7783#msg7783",
        "date": "August 06, 2010, 03:53:24 AM",
        "content": "<div class=\"post\">I understand that bitcoin's utility as a currency is independent of the method of minting - that is crucial to what I'm trying to express. My claim is that the positive properties of bitcoin's security could be implemented using a different method of minting, and that users will likely gravitate to currencies with whatever they believe are the most fair and efficient minting systems. <br/><br/>Maybe an even simpler way to put it is that I think that it is a huge waste of resources to generate a digital currency by doing fundamentally useless computational work. If you want to regulate currency production in this way, it should be done \"parasitically\" on top of useful computation, such as that done by distributed computing research projects. <br/><br/>Let me make an analogy that I believe is actually very close to the current truth of the matter. The current method of coin minting is similar to a currency based on photographs of burned wheat. People grow wheat, burn it, and take photos of the burned wheat to prove that it was really grown and burnt, and then use the photographs as a medium of exchange. Does that sound sensible? No, and fundamentally it is just as senseless to waste potentially useful computer cycles on calculating the hash of random data until you hit the winning number. </div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7790#msg7790",
        "date": "August 06, 2010, 04:51:07 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7783#msg7783\">Quote from: gridecon on August 06, 2010, 03:53:24 AM</a></div><div class=\"quote\">I understand that bitcoin's utility as a currency is independent of the method of minting - that is crucial to what I'm trying to express. My claim is that the positive properties of bitcoin's security could be implemented using a different method of minting, and that users will likely gravitate to currencies with whatever they believe are the most fair and efficient minting systems. <br/><br/></div><br/><br/>Go for it.  In the meantime, I think that you both miss some fundamental truths.<br/><br/>1)  The point of the system is not to 'mint' coins at a high energy cost, but a high computational cost, to protect the system no matter how high Moore's law may go.  <br/><br/>2)  The award of bitcoins is not 'minting' really anyway, it is an award by lottery for participating in the strenghtening the currency.  Those 50 bitcoins already existed from the moment that the rules were conceived and the process set into motion.  They are just distrubuted from the original owner in a systematic manner. <br/><br/> The computations are a neccessary part of keeping the system strong and confidence high, and are a small price to pay when compared to the costs that we all incur from the administration of fiat currencies.  I think that it was a brilliant idea.</div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7809#msg7809",
        "date": "August 06, 2010, 08:30:23 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7771#msg7771\">Quote from: gridecon on August 06, 2010, 01:52:00 AM</a></div><div class=\"quote\">I believe that the amount of energy input required to the bitcoin economy represents a serious obstacle to its growth. I think in the long-term, transactions may be even more serious than minting in this regard, but I will for the moment discuss minting because it is more precisely bounded and defined. The idea that the value of bitcoins is in some way related to the value of the electricity required, on average, to mint a winning block is generally accepted, but the precise nature of this relationship is contentious. <br/></div><br/>I don't accept that.<br/>The idea that the value of a Bitcoin is in some way related to the value of the electricity required on average is a fallacy that has been widely spread by armchair economists to get-rich-quick merchants who don't understand the system.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">My contention is that both of these arguments miss the point and the real problem, which is the fundamental perversity of wasting large amounts of energy and computations in generating the winning blocks for the minting process. The minting process exists because of the necessity of actually \"printing\" the currency, and certain desirable properties of crypto-math for making the currency's behavior predictable. The fact that the current minting process requires a large energy input of computational work is highly unfortunate and has the perverse consequence that bitcoin may actually be \"destroying wealth\" in the sense of wasting energy producing a digital object worth less than the resources invested in it.<br/></div><br/>It's not about the minting at all.<br/><br/>The computation required is to maintain the integrity of the system by growing the block chain which serves as a 'timestamp' of transactions.<br/>It is probably possible to make the computation required for this process less than it currently is, but it would be at the expense of disk space or bandwidth or integrity or processing power required to validate transactions, or all of the above. The current system provides a good balance of all these things.<br/><br/>The minting is just a side effect, and an elegant way to reward those who have contributed processing power to the integrity of the system.<br/>There are many other threads that try to propose 'better' ways of rewarding these contributions, but the 'winner takes all' system is the one we have at the moment.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">As is often pointed out, a currency does not necessarily have, or need to have, any inherent value - a medium of exchange is a useful tool and can have value purely as a consequence of social convention. The cost of production of bitcoins in electricity consumed represents a waste, a \"thermodynamic burden\" that the currency has to carry. Consider a hypothetical alternative digital currency called \"compucoin\", which purchases cpu cycles from nodes on the network. The market value of this currency would converge very closely with the cost of electricity required to generate cpu cycles. Instead of costing cpu cycles to mint, the value of the cpu cycles the coins could be exchanged for would create a rational basis for the currency's value and integrate it with an existing market. I imagine that alternatives to Bitcoin (many of them probably sharing a lot of Bitcoin's source code) will inevitably emerge and Bitcoin's current minting process makes the currency \"expensive\" in terms of energy input. I believe this places it at a competitive disadvantage to other currencies and can only hinder its widespread adoption and long-term value.<br/></div><br/>Good luck with implementing compucoins..<br/><br/>Again, it is <b>not about the minting</b><br/><br/></div>",
        "post_num": 8,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7817#msg7817",
        "date": "August 06, 2010, 09:24:47 AM",
        "content": "<div class=\"post\">I understand the bitcoin is not INTENDED to be about the minting. The essence of my criticism is that a digital currency SHOULD NOT be \"about the minting\" but the current bitcoin system works against that goal! My argument is that the current minting system limits the utility of the currency largely because entirely too much attention is focused on \"winning the block generation lottery\" and the process of choosing these winners is highly inefficient and resource intensive. If potential users of the currency believe that bitcoin is simply a way for botnet herders to convert spare cpu cycles into cash, they are unlikely to participate in the emergence of the economy. The current system could easily result in the perception that bitcoin is basically being used as a vector for the indirect monetization of the theft of electricity via compromised computer systems. I assume most people interested in bitcoin understand that self-interested individuals will obviously seek to exploit opportunities like this, and the design of a popular currency has to prioritize how a prospective user will evaluate its fairness.</div>",
        "post_num": 9,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "pyrrhos",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=635",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7819#msg7819",
        "date": "August 06, 2010, 09:37:43 AM",
        "content": "<div class=\"post\">The minting should be seen as digging for gold in a gold mine. This is similarly wasting energy and resources for actually not doing anyone any favor since you increase the supply of gold. Except for yourself of course, and that why people will always will dig for gold as long as the price of gold dug will be higher than the cost of resources needed to dig. However, this difficulty is what gives scarcity and therefore value to gold.<br/><br/>Similarly, if and when bitcoin becomes more mainstream and follows economic sense (rather than beeing driven by curiosity, fun and excitement for participating in something new) the cost of electricity (in dollars or equivalent bitcoins) to create a bitcoin will never exceed the value of the created bitcoin. If that would happen, many will shut down their bitcoin generation for it would make no economic sense (I already stopped mine!). Luckily, and unlike gold mining, this behavior will adjust the cost of creating bitcoin to a sensible level (below the value of the generated bitcoin)<br/><br/>In the long run i expect that bitcoin minting will indeed be left to the supernodes which will probably have specialized hardware  that are excellent in hash calculations and can do that way better than anyone with a general purpose pc. Similarly to specialized gold digging machines.<br/><br/>So although you are right that it would be nice to find a system that provides scarcity without cost (I dont know whether this is possible, it seems not), the costs are certainly connected and less to the value of the created bitcoin. And it is a self regulated system that will increase the cost of creation only if the use of bitcoin actually adds value (in the form of ease of use, anonimity etc.) and therefore is worth it.<br/>The cost of creation is therefore is no limitation of the growth but more and indication of the added value of the use of bitcoin.<br/><br/>fuuny note: Following this logic the cost of minting will be somewhat less than 21million bitcoins which with the current prize of bitcoin is  around 1 million dollars.<br/><br/>------<br/>1neNcqV4yRUNwP9xCdcgRvBrNwWdFo3Wv</div>",
        "post_num": 10,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7825#msg7825",
        "date": "August 06, 2010, 10:00:16 AM",
        "content": "<div class=\"post\">Thanks to everyone for all the well-considered responses. I am, you could say, half-convinced - I understand the motivations for the design decisions bitcoin has made, but I still think more optimal solutions are likely to evolve. That said, the obvious intelligence and open-mindedness shown by the discussion here is in some ways the most convincing selling point! Any currency with a user community who engages in quality dialogue earns additional credibility with me, so based on the quality of this thread, I have acquired a few bitcoins, and distributed some of them to the posters who included a bitcoin address. As I hope I have emphasized, I think bitcoin is brilliant and I want it to succeed, I raise these issues because I would hate to see the success of bitcoin impeded by something, the minting model, that everyone agrees is in many ways arbitrary.<br/></div>",
        "post_num": 11,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7828#msg7828",
        "date": "August 06, 2010, 10:46:29 AM",
        "content": "<div class=\"post\">If the problem you are identifying is that too much attention is<br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">too much attention is focused on \"winning the block generation lottery\" and the process of choosing these winners is highly inefficient and resource intensive.<br/></div><br/>I would tend to agree with you on the first part, but disagree on the second. <br/>Chosing the 'winners' is a side-effect of the security of the system, if we were to choose the winners just based on picking a random address out of the transaction list this would certainly be less resource intensive, but you still need to make sure that the that the blocks cannot be easily forged by an attacker.<br/><br/>Perhaps you could contribute your ideas on how bitcoin should be publicized. <br/>We (the bitcoin community) don't have a large corporate PR department who are paid to sit around and come up with good ideas. <br/><a href=\"http://bitcointalk.org/index.php?topic=697.0\">Bitcoin video bounty thread</a> might be a good place to start.<br/><br/>Another problem is that there is no one controlling focus group to set the direction of Bitcoin publicity and there are people who want to use bitcoins for all kinds of different reasons. <br/><br/>P.S. Thanks for the tip.</div>",
        "post_num": 12,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7829#msg7829",
        "date": "August 06, 2010, 10:51:51 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7817#msg7817\">Quote from: gridecon on August 06, 2010, 09:24:47 AM</a></div><div class=\"quote\">I understand the bitcoin is not INTENDED to be about the minting. The essence of my criticism is that a digital currency SHOULD NOT be \"about the minting\" but the current bitcoin system works against that goal! My argument is that the current minting system limits the utility of the currency largely because entirely too much attention is focused on \"winning the block generation lottery\" and the process of choosing these winners is highly inefficient and resource intensive.<br/></div>I think that's the issue you have though, you think it's inefficient and resource intensive on purpose when really it's not. No one is required to generate coins to use the system. If you click the generate coin list, you are basically volunteering your resources to strengthen the network and in exchange, you *might* get some coin for it. Since coin is in demand to use the system, someone has to generate it. If generation was as easy as \"input how many you want, *bam*, you have 1 million now\" it would make the entire system pointless. It's a chicken and the egg puzzle except there really isn't a puzzle here. People need bitcoins, they generate them at a fixed rate to make it worth spending the CPU time.<br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">If potential users of the currency believe that bitcoin is simply a way for botnet herders to convert spare cpu cycles into cash, they are unlikely to participate in the emergence of the economy. The current system could easily result in the perception that bitcoin is basically being used as a vector for the indirect monetization of the theft of electricity via compromised computer systems. I assume most people interested in bitcoin understand that self-interested individuals will obviously seek to exploit opportunities like this, and the design of a popular currency has to prioritize how a prospective user will evaluate its fairness.<br/></div>There's no reason to think of it that way, anymore than the local barber is collecting hair to clone an army of super-men for world domination. You have to draw the line somewhere. If someone is going to steal electricity, targeting a 30 watt computer doesn't make a lot of sense.<br/><br/>I have seen the topic come up here a few times \"what if someone seeks to exploit this?\" and the answer is the same over and over, it has been designed from the ground up to counter this exact concern. If you want to \"game\" the system, you need a lot of CPU power. CPU power cost money. The system scales itself to the available CPU power it has so if you bought 10,000 EC2 sessions from Amazon and started a massive bitcoin generating farm, you would never make more money out of it than what you put into it for long because the system would self-adjust against it. If someone throughs a massive botnet at it, the same thing will happen. The system is set for self-feedback, so to try to steal from everyone is to try to steal from yourself at the same time.</div>",
        "post_num": 13,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7889#msg7889",
        "date": "August 06, 2010, 04:48:00 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7829#msg7829\">Quote from: knightmb on August 06, 2010, 10:51:51 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7817#msg7817\">Quote from: gridecon on August 06, 2010, 09:24:47 AM</a></div><div class=\"quote\">If potential users of the currency believe that bitcoin is simply a way for botnet herders to convert spare cpu cycles into cash, they are unlikely to participate in the emergence of the economy. The current system could easily result in the perception that bitcoin is basically being used as a vector for the indirect monetization of the theft of electricity via compromised computer systems. I assume most people interested in bitcoin understand that self-interested individuals will obviously seek to exploit opportunities like this, and the design of a popular currency has to prioritize how a prospective user will evaluate its fairness.<br/></div>There's no reason to think of it that way, anymore than the local barber is collecting hair to clone an army of super-men for world domination. You have to draw the line somewhere. If someone is going to steal electricity, targeting a 30 watt computer doesn't make a lot of sense.<br/><br/>I have seen the topic come up here a few times \"what if someone seeks to exploit this?\" and the answer is the same over and over, it has been designed from the ground up to counter this exact concern. If you want to \"game\" the system, you need a lot of CPU power. CPU power cost money. The system scales itself to the available CPU power it has so if you bought 10,000 EC2 sessions from Amazon and started a massive bitcoin generating farm, you would never make more money out of it than what you put into it for long because the system would self-adjust against it. If someone throughs a massive botnet at it, the same thing will happen. The system is set for self-feedback, so to try to steal from everyone is to try to steal from yourself at the same time.<br/></div>I think you are rationalizing away a serious issue. Botnets exist, and the owners of botnets seek to monetize them. Bitcoin minting is an available strategy. Saying \"If someone is going to steal electricity, targeting a 30 watt computer doesn't make a lot of sense\" is a complete non sequitir. Being in control of a botnet means YOU ALREADY HAVE STOLEN the electricity, the question is - how are you going to make use of it? It is very simple economics that bitcoin production is roughly proportional to energy input, and that therefore the most efficient producers will be those who are able to obtain that electricity at zero cost. <br/><br/>In making an analysis of an economic system, you obviously proceed by determining how self-interested actors will behave in that system. I am completely unconvinced by hand-waving arguments that try to claim people will not behave in selfish and unethical ways, if they see an opportunity for profit. We already KNOW that people are throwing a lot of computational resources into minting bitcoins, the steadily increasing difficulty is exactly equivalent to a steadily increasing computational cost of the system! The more energy invested in the production of the same quantity of coins, the harder bitcoin has to work to deliver value added on that cost.<br/><br/>Again, an analysis of the behavior of self-interested actors is instructive. The most energy-efficient scenario for bitcoin generation in the current regime would be if there was ONE NETBOOK that generated all the coins - the rate of coin production is fixed, so you'd still have the same amount of coins entering circulation. The person who ran that netbook would obviously be in a position to charge a high \"rent\" from the population that needed bitcoins for their transactions. An examination of this limit case makes it clear that bitcoin minters have a strong incentive to encourage use and circulation of the currency while discouraging additional minting nodes from coming online. This is not any kind of criticism of anyone's ethics - it is simply an examination of how the game is set up, and what strategies players will adopt.<br/><br/>As an overall point, I also do not agree with the idea that the very high computational burden of coin generation is in fact a necessity of the current system. As I understand it, currency creation is fundamentally metered by TIME - and if that is the fundamental controlling variable, what is the need for everyone to \"roll as many dice as posible\" within that given time period? The \"chain of proof\" for coin ownership and transactions doesn't depend on the method for spawning coins. </div>",
        "post_num": 14,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "kiba",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=491",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7890#msg7890",
        "date": "August 06, 2010, 04:52:12 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7889#msg7889\">Quote from: gridecon on August 06, 2010, 04:48:00 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7829#msg7829\">Quote from: knightmb on August 06, 2010, 10:51:51 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7817#msg7817\">Quote from: gridecon on August 06, 2010, 09:24:47 AM</a></div><div class=\"quote\">If potential users of the currency believe that bitcoin is simply a way for botnet herders to convert spare cpu cycles into cash, they are unlikely to participate in the emergence of the economy. The current system could easily result in the perception that bitcoin is basically being used as a vector for the indirect monetization of the theft of electricity via compromised computer systems. I assume most people interested in bitcoin understand that self-interested individuals will obviously seek to exploit opportunities like this, and the design of a popular currency has to prioritize how a prospective user will evaluate its fairness.<br/></div>There's no reason to think of it that way, anymore than the local barber is collecting hair to clone an army of super-men for world domination. You have to draw the line somewhere. If someone is going to steal electricity, targeting a 30 watt computer doesn't make a lot of sense.<br/><br/>I have seen the topic come up here a few times \"what if someone seeks to exploit this?\" and the answer is the same over and over, it has been designed from the ground up to counter this exact concern. If you want to \"game\" the system, you need a lot of CPU power. CPU power cost money. The system scales itself to the available CPU power it has so if you bought 10,000 EC2 sessions from Amazon and started a massive bitcoin generating farm, you would never make more money out of it than what you put into it for long because the system would self-adjust against it. If someone throughs a massive botnet at it, the same thing will happen. The system is set for self-feedback, so to try to steal from everyone is to try to steal from yourself at the same time.<br/></div>I think you are rationalizing away a serious issue. Botnets exist, and the owners of botnets seek to monetize them. Bitcoin minting is an available strategy. Saying \"If someone is going to steal electricity, targeting a 30 watt computer doesn't make a lot of sense\" is a complete non sequitir. Being in control of a botnet means YOU ALREADY HAVE STOLEN the electricity, the question is - how are you going to make use of it? It is very simple economics that bitcoin production is roughly proportional to energy input, and that therefore the most efficient producers will be those who are able to obtain that electricity at zero cost. <br/><br/>In making an analysis of an economic system, you obviously proceed by determining how self-interested actors will behave in that system. I am completely unconvinced by hand-waving arguments that try to claim people will not behave in selfish and unethical ways, if they see an opportunity for profit. We already KNOW that people are throwing a lot of computational resources into minting bitcoins, the steadily increasing difficulty is exactly equivalent to a steadily increasing computational cost of the system! The more energy invested in the production of the same quantity of coins, the harder bitcoin has to work to deliver value added on that cost.<br/></div><br/>The computational and energy cost for generating bitcoins is quite irrelevant to the bitcoin economy since it does not compromise the integrity of bitcoins. People should be more concerned about a botnet trying to cheat rather than mine bitcoins.</div>",
        "post_num": 15,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7891#msg7891",
        "date": "August 06, 2010, 04:55:22 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7889#msg7889\">Quote from: gridecon on August 06, 2010, 04:48:00 PM</a></div><div class=\"quote\">As an overall point, I also do not agree with the idea that the very high computational burden of coin generation is in fact a necessity of the current system. As I understand it, currency creation is fundamentally metered by TIME - and if that is the fundamental controlling variable, what is the need for everyone to \"roll as many dice as posible\" within that given time period? The \"chain of proof\" for coin ownership and transactions doesn't depend on the method for spawning coins. <br/></div><br/>Hear hear! <br/><br/>I though I tried to explain the lack of necessity, but people seem distracted by their repetition of mantras.</div>",
        "post_num": 16,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7897#msg7897",
        "date": "August 06, 2010, 05:15:28 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7889#msg7889\">Quote from: gridecon on August 06, 2010, 04:48:00 PM</a></div><div class=\"quote\">As an overall point, I also do not agree with the idea that the very high computational burden of coin generation is in fact a necessity of the current system. As I understand it, currency creation is fundamentally metered by TIME - and if that is the fundamental controlling variable, what is the need for everyone to \"roll as many dice as posible\" within that given time period? The \"chain of proof\" for coin ownership and transactions doesn't depend on the method for spawning coins. <br/></div><br/>You seem to have things backwards.<br/>The \"dice rolling\" is to maintain the \"chain of proof\".<br/>Actually giving out the coins is a side effect.<br/><br/>I have 2 questions for you: <br/><br/>Without high computational burden how do you propose we:<br/><br/>a) Maintain the integrity of the system?<br/>b) Distribute/Seed the system with coins?<br/></div>",
        "post_num": 17,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7904#msg7904",
        "date": "August 06, 2010, 05:24:10 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7889#msg7889\">Quote from: gridecon on August 06, 2010, 04:48:00 PM</a></div><div class=\"quote\">I think you are rationalizing away a serious issue. Botnets exist, and the owners of botnets seek to monetize them. Bitcoin minting is an available strategy. Saying \"If someone is going to steal electricity, targeting a 30 watt computer doesn't make a lot of sense\" is a complete non sequitir. Being in control of a botnet means YOU ALREADY HAVE STOLEN the electricity, the question is - how are you going to make use of it? It is very simple economics that bitcoin production is roughly proportional to energy input, and that therefore the most efficient producers will be those who are able to obtain that electricity at zero cost. <br/></div>A botnet is a stolen computer already, the concern people have is that it will take over bitcoin in some way. What you are talking about is what we already know. They use the stolen CPU time to generate BTC and then sell it on the market. It's stolen CPU time, we have no control of that. What we do have control over is how much damage it can do to others that are running honest clients.<br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">In making an analysis of an economic system, you obviously proceed by determining how self-interested actors will behave in that system. I am completely unconvinced by hand-waving arguments that try to claim people will not behave in selfish and unethical ways, if they see an opportunity for profit. We already KNOW that people are throwing a lot of computational resources into minting bitcoins, the steadily increasing difficulty is exactly equivalent to a steadily increasing computational cost of the system! The more energy invested in the production of the same quantity of coins, the harder bitcoin has to work to deliver value added on that cost.<br/></div>The system was designed with that in mind. That's why it uses a formula that forces anyone that participates in the protocol to behave or else they are ignored. So if anyone is going to game the system, they have to do it by the rules that everyone else is following. Right now, the only rule to game is CPU time. It's either expensive, donated, or stolen.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">Again, an analysis of the behavior of self-interested actors is instructive. The most energy-efficient scenario for bitcoin generation in the current regime would be if there was ONE NETBOOK that generated all the coins - the rate of coin production is fixed, so you'd still have the same amount of coins entering circulation. The person who ran that netbook would obviously be in a position to charge a high \"rent\" from the population that needed bitcoins for their transactions. An examination of this limit case makes it clear that bitcoin minters have a strong incentive to encourage use and circulation of the currency while discouraging additional minting nodes from coming online. This is not any kind of criticism of anyone's ethics - it is simply an examination of how the game is set up, and what strategies players will adopt.<br/><br/>As an overall point, I also do not agree with the idea that the very high computational burden of coin generation is in fact a necessity of the current system. As I understand it, currency creation is fundamentally metered by TIME - and if that is the fundamental controlling variable, what is the need for everyone to \"roll as many dice as posible\" within that given time period? The \"chain of proof\" for coin ownership and transactions doesn't depend on the method for spawning coins. <br/></div>That's the problem with having one PC generate all the coin, that one PC is a central authority of it and can price it anyway he/she likes. To de-centralize it means you need some way to force everyone to play by the rules or else one person will try to bend the rules.<br/><br/>I respect that you don't agree with how it works, so I offer up that we be shown a better way that we can't all punch holes in. It's open source software, if there is a better way, it can be used. Currently the rules are why they are because the entire network is designed with \"trust no one\" but instead \"trust everyone collectively\".</div>",
        "post_num": 18,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "kiba",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=491",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7907#msg7907",
        "date": "August 06, 2010, 05:30:41 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7904#msg7904\">Quote from: knightmb on August 06, 2010, 05:24:10 PM</a></div><div class=\"quote\">Currently the rules are why they are because the entire network is designed with \"trust no one\" but instead \"trust everyone collectively\".<br/></div><br/>You mean it is designed  to \"trust no one\", not of \"trust everyone collectively\"?</div>",
        "post_num": 19,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7918#msg7918",
        "date": "August 06, 2010, 05:46:56 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7907#msg7907\">Quote from: kiba on August 06, 2010, 05:30:41 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7904#msg7904\">Quote from: knightmb on August 06, 2010, 05:24:10 PM</a></div><div class=\"quote\">Currently the rules are why they are because the entire network is designed with \"trust no one\" but instead \"trust everyone collectively\".<br/></div><br/>You mean it is designed  to \"trust no one\", not of \"trust everyone collectively\"?<br/></div>Trust no one node, but if enough nodes are saying the same thing, then trust that.  <img alt=\"Grin\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/grin.gif\"/></div>",
        "post_num": 20,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7926#msg7926",
        "date": "August 06, 2010, 06:16:51 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7918#msg7918\">Quote from: knightmb on August 06, 2010, 05:46:56 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7907#msg7907\">Quote from: kiba on August 06, 2010, 05:30:41 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7904#msg7904\">Quote from: knightmb on August 06, 2010, 05:24:10 PM</a></div><div class=\"quote\">Currently the rules are why they are because the entire network is designed with \"trust no one\" but instead \"trust everyone collectively\".<br/><br/></div>You mean it is designed  to \"trust no one\", not of \"trust everyone collectively\"?<br/></div>Trust no one node, but if enough nodes are saying the same thing, then trust that.  <img alt=\"Grin\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/grin.gif\"/><br/></div><br/>This exchange is fascinating! At some sense it's just a matter of semantics, but it is very insightful semantics.<br/><br/>Logically I can support knightmb's statement \"trust everyone collectively\".<br/>However kiba's statement \"trust no one\" is disprovable,<br/>as is knightmb's statement \"Trust no one node, but if enough nodes are saying the same thing, then trust that.\"<br/><br/>The way the system works is every node attempts to receive every transaction, they each try to put every received transaction into a block at the same time. And while they are doing that, they each play the hashing game individually looking for fate to bless them with a match before it does anyone else.<br/><br/>So at any given point in time the system is really *trust (but validate) someone arbitrarily*. This happens when someone declares a block &amp; hash \"solved\". All the other nodes check the block for self consistency, but they DON'T check the block's transactions for consistency with the transactions they themselves were working on. Nor do they check against the transactions other nodes received. So I see no support for the \"if enough nodes are saying the same thing, then trust that.\"<br/><br/>All nodes simply declare, \"I will trust this node's work as the next increment of bitcoin truth, because fate has blessed it.\" So it doesn't qualify as a \"trust no one\" system. Node's never say, \"Hey you fuck head! I have 5 known transactions you didn't bother to put in your block! You are a lying bastard.\" Everyone just presumes the missing transactions will be resubmitted and they'll end up in a subsequent block. This is heuristically plausible, but not absolutely deterministic. Everyone has to keep checking to make sure their transactions actually cleared the process.<br/><br/>So if knight's \"trust everyone collectively\" meant, \"trust in the process\" I find that insightful and a good motto. I'd probably add \"...but keep doing your own validation!\"<br/><br/></div>",
        "post_num": 21,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7928#msg7928",
        "date": "August 06, 2010, 06:23:42 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7897#msg7897\">Quote from: Insti on August 06, 2010, 05:15:28 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7889#msg7889\">Quote from: gridecon on August 06, 2010, 04:48:00 PM</a></div><div class=\"quote\">As an overall point, I also do not agree with the idea that the very high computational burden of coin generation is in fact a necessity of the current system. As I understand it, currency creation is fundamentally metered by TIME - and if that is the fundamental controlling variable, what is the need for everyone to \"roll as many dice as posible\" within that given time period? The \"chain of proof\" for coin ownership and transactions doesn't depend on the method for spawning coins. <br/></div><br/>You seem to have things backwards.<br/>The \"dice rolling\" is to maintain the \"chain of proof\".<br/>Actually giving out the coins is a side effect.<br/><br/>I have 2 questions for you: <br/><br/>Without high computational burden how do you propose we:<br/><br/>a) Maintain the integrity of the system?<br/>b) Distribute/Seed the system with coins?<br/><br/></div>I understand that the incredibly thermodynamic inefficiency I was complaining about is in fact very deliberate, and bitcoin might be said to waste as much energy as possible, as a security feature! Now I really don't know what to think - because exactly what I was complaining about gives the system its diabolical effectiveness. I think my earlier analogy with deliberately burning wheat and trading photographs of the ruined crops is very apt. We are all ceremonially burning computer cycles as an investment of resources in a \"trust pool\". The irreversibility of the process - the fact that we are burning our computational wheat crop just to crank out unusually numerically small hashes - is definitely perverse, and deliberately so. The entirely stupid amount of resources wasted minting bitcoins makes it nigh-impossible that anyone would choose to be EVEN STUPIDER as to waste the amount of resources necessary to outcompute you.<br/><br/>The problem is, if you look at the competition in the world of digital currencies - online casino currencies, mmorpg currencies, and the like - they often have much larger economies than bitcoin, with much less security, verifiability, and certainly much lower thermodynamic burden! The market, in the form of consumers, does not seem to demand a massive investment of random numbers to be willing to trade in a currency. I understand of course that the competition is generally centralized and that the thermodynamics of bitcoin are designed as a substitute for central authority - but I personally would regard a \"large enough\" network of nodes signing a transaction history using standard public key cryptography to be secure enough to use without demanding to see photographs of 500 billion bushels of burnt wheat as proof of the network's seriousness.<br/><br/>I see three additional replies written while I was typing this, so I'll try to refocus:<br/><br/>I understand the system, and appreciate its strengths. I am actually happy to participate in the bitcoin economy, sending coins around as tips for forum posts and the like is enjoyable as a \"game\" and the cost of entry is currently pretty low. My personal concern is not over botnets taking over with forged currency, but with botnets taking over the issuance of genuine coins. That is why I think the \"security through wasting energy\" concept is flawed - not because it isn't secure, but because it has the potential to create incentives for harmful behaviors, which in turn diminishes the likelihood of building social trust in the currency.</div>",
        "post_num": 22,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7933#msg7933",
        "date": "August 06, 2010, 07:17:39 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7928#msg7928\">Quote from: gridecon on August 06, 2010, 06:23:42 PM</a></div><div class=\"quote\">I see three additional replies written while I was typing this, so I'll try to refocus:<br/><br/>I understand the system, and appreciate its strengths. I am actually happy to participate in the bitcoin economy, sending coins around as tips for forum posts and the like is enjoyable as a \"game\" and the cost of entry is currently pretty low. My personal concern is not over botnets taking over with forged currency, but with botnets taking over the issuance of genuine coins. That is why I think the \"security through wasting energy\" concept is flawed - not because it isn't secure, but because it has the potential to create incentives for harmful behaviors, which in turn diminishes the likelihood of building social trust in the currency.<br/></div><br/>Ah I understand then, the answer is botnets can't forge currency because the swarm would not accept it. The only thing they can do is produce \"real\" currency at the expense of the stolen CPU time. Just like forcing slaves to mine gold will still net you real gold, just at no cost.<br/><br/>The only known *practical* attack to bitcoin from a botnet would be to have more CPU than the swarm at your command and to use that CPU power to double-speed currency. So while that could possible fall in into the \"forged currency\" category, it's not so much to make fake currency as it is spending valid currency twice before anyone notices.</div>",
        "post_num": 23,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7936#msg7936",
        "date": "August 06, 2010, 07:20:47 PM",
        "content": "<div class=\"post\">I had all four of my cores dedicated previously toward the goal of generating bitcoins, but it's no longer worth the cost to me. I am now only generating using one core but the goal is no longer to generate bitcoins. My current goal is to help maintain the strength of the network and to help the network recover (get to the next block adjustment) when and if a large botnet drops out. Bitcoin was about generating bitcoins, but now it's not. Now it's about competing botnets providing a secure and reliable foundation for an open currency. Yeah, they're stealing the electricity and yeah, they're profiting, but at least they're putting their stolen CPU cycles to a useful and accepted purpose instead of more harmful activities that they probably would be engaged in if they had not discovered bitcoin.</div>",
        "post_num": 24,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7938#msg7938",
        "date": "August 06, 2010, 07:30:32 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7936#msg7936\">Quote from: NewLibertyStandard on August 06, 2010, 07:20:47 PM</a></div><div class=\"quote\">I had all four of my cores dedicated previously toward the goal of generating bitcoins, but it's no longer worth the cost to me. I am now only generating using one core but the goal is no longer to generate bitcoins. My current goal is to help maintain the strength of the network and to help the network recover (get to the next block adjustment) when and if a large botnet drops out. Bitcoin was about generating bitcoins, but now it's not. Now it's about competing botnets providing a secure and reliable foundation for an open currency. Yeah, they're stealing the electricity and yeah, they're profiting, but at least they're putting their stolen CPU cycles to a useful and accepted purpose instead of more harmful activities that they probably would be engaged in if they had not discovered bitcoin.<br/></div>Ok, bravo for an amazingly honest and straightforward answer. That is probably the most overall convincing argument I have seen made in the thread. You are arguing that the overall social utility of Bitcoin is \"worth it\" - worth both the raw energy cost of the computational work, and worth the regrettable fact that it provides a profit opportunity for botnet operators. I don't have a proposal for how exactly you measure the costs and benefits, but I entirely agree with your analysis of the bottom line of the situation. You could even make the argument that minting bitcoins as an activity is less harmful than other botnet activities like sending out spam. </div>",
        "post_num": 25,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7946#msg7946",
        "date": "August 06, 2010, 07:48:31 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7938#msg7938\">Quote from: gridecon on August 06, 2010, 07:30:32 PM</a></div><div class=\"quote\"> You could even make the argument that minting bitcoins as an activity is less harmful than other botnet activities like sending out spam. <br/></div><br/>I think that he already did.<br/><br/></div>",
        "post_num": 26,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "jgarzik",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=541",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7950#msg7950",
        "date": "August 06, 2010, 07:53:25 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7936#msg7936\">Quote from: NewLibertyStandard on August 06, 2010, 07:20:47 PM</a></div><div class=\"quote\">I had all four of my cores dedicated previously toward the goal of generating bitcoins, but it's no longer worth the cost to me. I am now only generating using one core but the goal is no longer to generate bitcoins. My current goal is to help maintain the strength of the network and to help the network recover (get to the next block adjustment) when and if a large botnet drops out. Bitcoin was about generating bitcoins, but now it's not. Now it's about competing botnets providing a secure and reliable foundation for an open currency.<br/></div><br/>Well said.<br/><br/>Participation in the network as an honest node helps everyone.</div>",
        "post_num": 27,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "BitLex",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=292",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg7955#msg7955",
        "date": "August 06, 2010, 08:02:34 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7938#msg7938\">Quote from: gridecon on August 06, 2010, 07:30:32 PM</a></div><div class=\"quote\">You are arguing that the overall social utility of Bitcoin is \"worth it\" - worth both the raw energy cost of the computational work, and worth the regrettable fact that it provides a profit opportunity for botnet operators. <br/></div>I'd rather like to support a system like bitcoin, that i can use myself for value-transaction, than searching for E.T. to make some scientist save cash. That's a waste of energy and still people do it voluntarily without any benefits.<br/><br/>And i really dont care if some botnet-ops make a profit or not, as long as they don't bother ME (or anyone else).<br/><br/><br/><br/></div>",
        "post_num": 28,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8114#msg8114",
        "date": "August 07, 2010, 05:46:09 PM",
        "content": "<div class=\"post\">It's the same situation as gold and gold mining.  The marginal cost of gold mining tends to stay near the price of gold.  Gold mining is a waste, but that waste is far less than the utility of having gold available as a medium of exchange.<br/><br/>I think the case will be the same for Bitcoin.  The utility of the exchanges made possible by Bitcoin will far exceed the cost of electricity used.  Therefore, <i>not</i> having Bitcoin would be the net waste.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg7889#msg7889\">Quote from: gridecon on August 06, 2010, 04:48:00 PM</a></div><div class=\"quote\">As an overall point, I also do not agree with the idea that the very high computational burden of coin generation is in fact a necessity of the current system. As I understand it, currency creation is fundamentally metered by TIME - and if that is the fundamental controlling variable, what is the need for everyone to \"roll as many dice as posible\" within that given time period? The \"chain of proof\" for coin ownership and transactions doesn't depend on the method for spawning coins. <br/></div>Each node's influence on the network is proportional to its CPU power.  The only way to show the network how much CPU power you have is to actually use it.<br/><br/>If there's something else each person has a finite amount of that we could count for one-person-one-vote, I can't think of it.  IP addresses... much easier to get lots of them than CPUs.<br/><br/>I suppose it might be possible to measure CPU power <i>at certain times</i>.  For instance, if the CPU power challenge was only run for an average of 1 minute every 10 minutes.  You could still prove your total power at given times without running it all the time.  I'm not sure how that could be implemented though.  There's no way for a node that wasn't present at the time to know that a past chain was actually generated in a duty cycle with 9 minute breaks, not back to back.<br/><br/>Proof-of-work has the nice property that it can be relayed through untrusted middlemen.  We don't have to worry about a chain of custody of communication.  It doesn't matter who tells you a longest chain, the proof-of-work speaks for itself.</div>",
        "post_num": 29,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8130#msg8130",
        "date": "August 07, 2010, 06:48:01 PM",
        "content": "<div class=\"post\">I say this half flippantly and half seriously. :-)<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8114#msg8114\">Quote from: satoshi on August 07, 2010, 05:46:09 PM</a></div><div class=\"quote\">If there's something else each person has a finite amount of that we could count for one-person-one-vote, I can't think of it.  IP addresses... much easier to get lots of them than CPUs.<br/></div><br/>If I were you, I would have considered a mapping that included, \"For each entry into the bitcoin transaction recording/gold mining lottery, please send $10 to Satoshi.\"<br/><br/>That would discourage botnet operators from thousands of nodes. And if it didn't you would have tens of thousands of dollars! ;-)<br/><br/></div>",
        "post_num": 30,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8133#msg8133",
        "date": "August 07, 2010, 06:56:27 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8130#msg8130\">Quote from: Red on August 07, 2010, 06:48:01 PM</a></div><div class=\"quote\">I say this half flippantly and half seriously. :-)<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8114#msg8114\">Quote from: satoshi on August 07, 2010, 05:46:09 PM</a></div><div class=\"quote\">If there's something else each person has a finite amount of that we could count for one-person-one-vote, I can't think of it.  IP addresses... much easier to get lots of them than CPUs.<br/></div><br/>If I were you, I would have considered a mapping that included, \"For each entry into the bitcoin transaction recording/gold mining lottery, please send $10 to Satoshi.\"<br/><br/>That would discourage botnet operators from thousands of nodes. And if it didn't you would have tens of thousands of dollars! ;-)</div>I can't imagine a more splintered network. <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/></div>",
        "post_num": 31,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8138#msg8138",
        "date": "August 07, 2010, 08:09:19 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8133#msg8133\">Quote from: NewLibertyStandard on August 07, 2010, 06:56:27 PM</a></div><div class=\"quote\">I can't imagine a more splintered network. <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/><br/></div><br/>You laugh and I did too. But consider that the launch of bitcoin could have gone this way.<br/><br/>--------<br/><br/>Hi I'm Satoshi, you a are the 20 largest ISP's in the world. I'm launching a new network cash service. It will add significant value to your existing customer base and make you some additional revenue.<br/><br/>So here is the deal, In exchange for each of you running a bitcoin transaction verification peer and signing this contract, you will receive 1,000,000 BTC. You agree (in the contract) to distribute &gt;= 500,000 BTC to your existing customer base in the first year. You may sell them, give them away to new subscribers or as a value add to promotions. Compete among yourselves, dispose of them anyway you want. Dispose of or keep the rest to dispose of in the future.<br/><br/>You also agree to run the transaction verification servers honestly for X years. Here is a free client you can pass out to your customers, you can give it away or charge them a service fee. Compete among yourselves.<br/><br/>Each of you pay me $100 for the privilege, you'll make that back the first day.<br/><br/>Thank you for your $2,000 good luck to you all!<br/><br/>Poof, now there is a functioning bitcoin network will all 21,000,000 coins in circulation. Satoshi gets to keep the last 1,000,000 BTC + he gets the $2,000.<br/><br/>Bitcoin builds on the reputation of the 20 largest ISP's and is adopted immediately. 20 trusted nodes can reach consensus quickly so there is no reason for the hashing game or new minting rewards.<br/><br/>----<br/><br/>I don't think that is too pie in the sky for some of the clever salesmen I know to pull off.<br/></div>",
        "post_num": 32,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8156#msg8156",
        "date": "August 07, 2010, 10:11:28 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8138#msg8138\">Quote from: Red on August 07, 2010, 08:09:19 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8133#msg8133\">Quote from: NewLibertyStandard on August 07, 2010, 06:56:27 PM</a></div><div class=\"quote\">I can't imagine a more splintered network. <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/><br/></div><br/>You laugh and I did too. But consider that the launch of bitcoin could have gone this way.<br/><br/>--------<br/><br/>Hi I'm Satoshi, you a are the 20 largest ISP's in the world. I'm launching a new network cash service. It will add significant value to your existing customer base and make you some additional revenue.<br/><br/>So here is the deal, In exchange for each of you running a bitcoin transaction verification peer and signing this contract, you will receive 1,000,000 BTC. You agree (in the contract) to distribute &gt;= 500,000 BTC to your existing customer base in the first year. You may sell them, give them away to new subscribers or as a value add to promotions. Compete among yourselves, dispose of them anyway you want. Dispose of or keep the rest to dispose of in the future.<br/><br/>You also agree to run the transaction verification servers honestly for X years. Here is a free client you can pass out to your customers, you can give it away or charge them a service fee. Compete among yourselves.<br/><br/>Each of you pay me $100 for the privilege, you'll make that back the first day.<br/><br/>Thank you for your $2,000 good luck to you all!<br/><br/>Poof, now there is a functioning bitcoin network will all 21,000,000 coins in circulation. Satoshi gets to keep the last 1,000,000 BTC + he gets the $2,000.<br/><br/>Bitcoin builds on the reputation of the 20 largest ISP's and is adopted immediately. 20 trusted nodes can reach consensus quickly so there is no reason for the hashing game or new minting rewards.<br/><br/>----<br/><br/>I don't think that is too pie in the sky for some of the clever salesmen I know to pull off.<br/><br/></div><br/>You would then have to rely on \"for profit\" companies to be the central authority for the new currency and how long would it take to generate the full chain even at a difficulty of 1.00?</div>",
        "post_num": 33,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8163#msg8163",
        "date": "August 07, 2010, 10:37:49 PM",
        "content": "<div class=\"post\">I'm not opposed to for profit companies. Nor am I opposed to your for profit venture. Eventhough you have a huge advantage by learning about bitcoin before most people.<br/><br/>My point was, if you have only twenty-one nodes validating transactions you don't need the block list at all. There are easier ways of reaching consensus with a smaller pool of peers.<br/></div>",
        "post_num": 34,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "gridecon",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=692",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8165#msg8165",
        "date": "August 07, 2010, 10:43:17 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8114#msg8114\">Quote from: satoshi on August 07, 2010, 05:46:09 PM</a></div><div class=\"quote\">It's the same situation as gold and gold mining.  The marginal cost of gold mining tends to stay near the price of gold.  Gold mining is a waste, but that waste is far less than the utility of having gold available as a medium of exchange. I think the case will be the same for Bitcoin.  The utility of the exchanges made possible by Bitcoin will far exceed the cost of electricity used.  Therefore, <i>not</i> having Bitcoin would be the net waste.<br/>[...] <br/>Proof-of-work has the nice property that it can be relayed through untrusted middlemen.  We don't have to worry about a chain of custody of communication.  It doesn't matter who tells you a longest chain, the proof-of-work speaks for itself.<br/></div><br/>Thanks very much for your reply. I agree with your analysis, and this thread has actually changed my mind as to my initial criticism. After more careful study of the design of the Bitcoin network and trying to understand the exact manner in which Bitcoin attempts to create value from the computational work invested, I am now inclined to think that bitcoin is in fact high EFFICIENT rather than inefficient. My thinking now is that bitcoin does not, in fact \"waste\" computational work at all - instead it works hard to deliver the most value possible from that computational work. Something like a governnment issued fiat currency may not have any obvious energy burden beyond its printing - but in fact, maintaining the value of a fiat currency requires a substantial investment in maintaining police enforcement, a legal system, and national defense. In comparison to the energy cost of hiring police officers to enforce economic honesty, the energy costs of investing cpu cycles in guaranteeing that honesty mathematically seem very small!<br/></div>",
        "post_num": 35,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "joechip",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=397",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8365#msg8365",
        "date": "August 09, 2010, 02:23:15 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=721.msg8114#msg8114\">Quote from: satoshi on August 07, 2010, 05:46:09 PM</a></div><div class=\"quote\">It's the same situation as gold and gold mining.  The marginal cost of gold mining tends to stay near the price of gold.  <b>Gold mining is a waste</b>, but that waste is far less than the utility of having gold available as a medium of exchange.<br/><br/>I think the case will be the same for Bitcoin.  The utility of the exchanges made possible by Bitcoin will far exceed the cost of electricity used.  Therefore, <i>not</i> having Bitcoin would be the net waste.<br/></div><br/>I agree with nearly everything you said, but I disagree, fundamentally, with the bolded.  Gold mining is not a waste of energy.  It is the opposite of waste, it is the measure of value people place in the 'utility of having gold as a medium of exchange' or a store of wealth, jewelry around their body parts or connectors on their home theater system.  If there was no demand for gold, the price would be zero.  Hence it is not a 'waste,' by definition.<br/><br/>I object strenuously to this idea, promulgated by the Monetarists, that the production of money is wasted capital which could be spent on other wealth-building projects.  It's a short-sighted argument which does not fully encompass the value we place in our money.<br/><br/>It's semantics, yes, but the negative connotations associated with the word \"waste\" is a tool of the money masters designed to confuse us and elevate their bankrupt system.<br/><br/>Ta,</div>",
        "post_num": 36,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8385#msg8385",
        "date": "August 09, 2010, 06:36:05 PM",
        "content": "<div class=\"post\">I really I understood the point of this thread but I guess I didn't.<br/><br/>I assumed that if you could design to do the exact same thing in the same commodity quantities and at the same protection level, BUT consuming less energy and producing less BTUs of heat, then that would be less wasteful.<br/><br/>You can mine gold in lots of ways, some require less resources than others. If two processes produce the same amount of gold then no point in optimizing anything else?<br/></div>",
        "post_num": 37,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8394#msg8394",
        "date": "August 09, 2010, 07:12:09 PM",
        "content": "<div class=\"post\">The power used is not wasteful.  It is simply what the owner is willing to commit to the project.  Even so, it may be used even as \"waste heat\".  I am an electritian by trade, and years ago I had the following idea form, while installing a 'heat trace' network on insulated sprinkler lines inside an open air parking garage.<br/><br/>The 'heat trace' is a fairly expensive cable that has a continuous resistive core to produce low intensity electric heat along the length of the pipe that it's taped onto.  Insulation is then wrapped around this assembly.  The best, and most efficient, systems have a temp reactive core; so that the closer to the freezing point that the cable itself becomes at any given length, the lower the resistance across the core becomes, resulting in an increase in heat output along the colder and less well insulated sections.  <br/><br/>At the time, I was playing with an early form of distributed computing called \"Condor\", which allowed single processes to be exported to other computers upon a network and their disk I/O shipped back across the network to a master server without the process being able to tell the difference.  I thought then that a small \"computer on a chip\" wired upon a flat network cable would be able to effectively perform the same functions of keeping the pipes above freezing with local temp sensitivity while also crunching numbers in exactly the same way that bitcoin requires.  Such an idea would require a network that permited quite a bit of power in order to not need an unacceptable number of power points along the pipe, but imagine the usefulness of such a system for companies that have such needs in very high (or very low) latitudes.<br/><br/>What if such a system were retrofitted onto the Alaskan Oil Pipeline, for example, one mile at a time?<br/></div>",
        "post_num": 38,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 167,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Bitcoin minting is thermodynamically perverse",
        "url": "https://bitcointalk.org/index.php?topic=721.msg8431#msg8431",
        "date": "August 09, 2010, 09:28:39 PM",
        "content": "<div class=\"post\">The heat from your computer is not wasted if you need to heat your home.  If you're using electric heat where you live, then your computer's heat isn't a waste.  It's equal cost if you generate the heat with your computer.<br/><br/>If you have other cheaper heating than electric, then the waste is only the difference in cost.<br/><br/>If it's summer and you're using A/C, then it's twice.<br/><br/>Bitcoin generation should end up where it's cheapest.  Maybe that will be in cold climates where there's electric heat, where it would be essentially free.</div>",
        "post_num": 39,
        "is_displayed": true,
        "nested_level": 0
    }
]