[
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "The current Bitcoin economic model doesn't work",
        "url": "https://bitcointalk.org/index.php?topic=57.msg390#msg390",
        "date": "February 18, 2010, 07:12:50 AM",
        "content": "<div class=\"post\"><span style=\"text-decoration: underline;\">Edit 24 May 2011</span>: <i>This post has just been majorly updated after more than a year to address the technical issues raised against the original suggestions. The ones presented now are practical. They're also credible as the early warning turned out to be true: Bitcoin has transformed into a ridiculously volatile speculation and hoarding tool rather than a stable medium of exchange.</i><br/><br/><a href=\"http://postimage.org/image/2zivvoft0/\"><img alt=\"\" border=\"0\" class=\"userimg\" src=\"https://ip.bitcointalk.org/?u=http%3A%2F%2Fs3.postimage.org%2F2zivvoft0%2Fchart.jpg&amp;t=589&amp;c=9dNTJ61BQzoxTw\"/></a><br/><br/>I dare not spend a coin today lest its price doubles tomorrow, nor dare I receive a payment in coins today lest their price crashes before I rush to sell them, nor dare I, naturally, store my wealth in the form coins so I'm relying on vulnerable exchangers to store it in the form of fiat currency. Something must be very wrong...<br/><br/>Yet that was all but unexpected; it was inevitable given how the limited supply system was designed. Let's stop and think about this for a minute:<br/><br/>Satoshi stated in his FAQ that <i>When Bitcoins start having real exchange value, the competition for coin creation will drive the price of electricity needed for generating a coin close to the value of the coin</i>. Now the only problem is that this \"real exchange value\" itself would be determined in part by electricity, computer deterioration, and time expenditures needed to generate new BTCs. And those expenditures increase with time. We have a loop.<br/><br/><b>Every four years a miner needs to exert double the virtual effort to create the same amount of coins</b>, which means he'll be constantly demanding higher prices to compensate for his costs. Which also means that bitcoins won't generally be spendable. Why? Because only an idiot spends a currency which he is certain its price will double within 4 years, effectively granting him about <b>19% real annual interest</b>--significantly better than any bank or mutual fund.<br/><br/><i>Great!</i> I hear you say, <i>free money for everyone, right?</i><br/><br/>Wrong. <br/><br/>Just as it's futile to create and distribute free extra coins to anyone already owning them \"to make everyone richer\", built-in deflation won't be helping anyone on the long term. That free money will encourage people to <b>hoard BTCs forever</b> or until another wishful investor buys them, fueling <b>speculation and price bubbles</b>. Bitcoin will ultimately be regarded as a phony <i>investment</i> with no real value, just like the good ol' <b>Pyramid (Ponzi) Scheme</b> where everyone purchases a ticket just to sell it to someone else later for a high profit until <b>the whole system collapses when it runs out of new victims</b>.<br/><br/><b>This scenario can only be avoided if the cost of generating new BTCs got constant</b>. Which can only happen if participating nodes needed to exert a more or less constant amount of work (cost) to generate a given amount of BTCs. Only then will people be inclined to actually spend their coins, and they can finally serve their purpose as a stable medium of exchange.<br/><br/>But that's not it. The very fact that the <b>newly-generated coin supply dwindles as its user base (hopefully) continues to grow will raise that 19% deflation rate even higher</b>. Let alone that many coins are forever destroyed via HDD failures and lost thumb drives, pushing the deflation even higher and higher. <b>High deflation is bad because nobody spends their money, they only save it because it gains value over time</b>. Can you imagine what would've happened if, say, the Japanese government hasn't printed any (or very few) Yens during the last century while the population exploded? One 1911 Yen would have been more than enough to buy a house today. Who then would've spent their Yens in 1911? Why, almost noone of course! <b>This scenario is only avoidable if the number of available BTCs continues to grow with its user base at least proportionally.</b> If both figures match, <b>we won't have deflation nor inflation</b>.<br/><br/>But under the current model the price wouldn't necessarily be tied to the increasing generating electricity costs forever, which means there's a different scenario other than a perpetually deflating currency, and it's much worse: After about 14 years almost no new coins will be produced. Generating costs could then be largely irrelevant, resulting in a <b>lack of a price anchor</b>. This would leave the price solely to the market's supply and demand forces. <b>Just like Picasso paintings</b>, a coin could then be worth $1 on a given day then literally be worth $100 on the next and vice versa.<br/><br/>So what's the solution? Well, as you might have already guessed, <b>we should remove both the 4-years doubling interval rule and the 21M limit. Just allow BTCs to be generated indefinitely</b>.<br/><br/>Don't sigh in relief just yet. After removing the limit we're better off but <b>still have another issue: The number of users and generating nodes grows exponentially while the existing coins grow arithmetically</b>. We therefore need a mechanism to reflect the number of generating nodes (i.e the total exerted effort) into the resulting bitcoins. But blocks aren't the answer: Technical difficulties have been addressed against my original suggestion which advised rendering the amount of generatable blocks unlimited and totally dependent on the number of nodes. The problem was that a minimum \"cooling down\" period is needed to propagate who owns the new block across the entire network to avoid conflicts.<br/><br/><b>My modified suggestion therefore is to reflect the total exerted effort in the number of coins</b>, not blocks. So we'd still have only 144 new daily blocks, but the amount of coins in these new blocks will depend on the proof-of-work difficulty (which automatically adjusts to the number of generating nodes). That makes sense. <b>A late adopter who needs to spend weeks, months, or even years to generate a block should end up with more coins in that block than an early adopter who had to spend only a couple of hours.</b><br/><br/>And no, sorry, early adopters didn't take any risk to deserve a reward. Running a computer program which pops deflationary money isn't a risky activity, not one that warrants a 1,000,000% profit anyway. <b>No wonder Satoshi (not his real name, which is unknown) was fiercely defending the original design</b> and wanted to keep it going for as long as possible. It allowed him to initially produce all 144 daily blocks (7200 coins/day) for quite a while before having competing miners drive his coins' price way up. He's probably following up on this forum from his Caribbean beach seat now, with other \"early adopters\" eager to join him. The proposed system is the way to halt this pyramid scheme.<br/><br/><b>The coins' price will then depend on the total cost of electricity sacrificed to generate the newest block</b>. Think of it as if everyone in the network bought some electricity from their utilities company before loading it all onto the network where the roulette runs every ten minutes on average with one lucky winner hitting the jackpot. <b>Bitcoins would have a real value equal to the amount of electricity sacrificed to create them, and their price would essentially be a function of the (pretty stable) average worldwide home electricity costs</b>, not a function of the number of generating nodes nor total demand, which will never stabilize in the foreseeable future. <b>Under the proposed system, if the number of generating users doubles tomorrow, the number of coins generated tomorrow will double as well, offsetting the demand surge with a supply surge without the need for a price jump followed by price crash as is the case now</b>.<br/><br/>This flexible supply system will be telling everyone <b>there's no advantage to being an early adopter</b>. A user doesn't need another victim to reap rewards later because there are no rewards to begin with. <b>Bitcoin is a medium of exchange, not a profit-making tool</b>. Speculators and investors can go ruin another currency for there's nothing for them to gain here until they can manipulate global electricity prices. By <b>eliminating risk and uncertainty</b> we're showing them the door, thus accomplishing the most important task towards achieving a stable medium of exchange the general population can trust.<br/><br/>Finally, a simple numerical example: If we assume the average worldwide cost of running a modern CPU for 24 hours is 20 cents, and if our initial goal is to have one BTC roughly equaling one US dollar, then the amount of coins each new block contains should equal: (fifth of a BTC/144 * the estimated equivalent of the modern CPUs number in the network). Thus, if the exerted power was then estimated to equal 10,000 CPUs, the new block created at that point would contain 14 BTC because the whole network spent $14 during the last 10 minutes to create it. If it was 20,000 CPUs, the new block would have 28 BTC and so on. <b>Once enough coins are produced for ฿1 equaling $1, miners would generate just enough to cover the economy's expansion</b> because any excess will come to them at a loss. The price would then fluctuate approximately along the lines of 99¢-$1.03.<br/><br/>Practically speaking, if the price of 1 BTC after implementing the new system was, say $10, we could simply add a zero to increase the amount of existing coins ten-fold, making 1 BTC equaling 1 dollar, after which <b>the price will essentially stabilize itself automatically forever</b>. Note that the estimated CPUs figure is arbitrarily set using current computer power and running costs. Errors won't be detrimental because the market will correct itself resulting in 1 BTC equaling slightly more or less than $1. For example, if computers became more energy-efficient while electricity costs stayed constant, then ฿1 will equal a bit less than $1 because it now costs less to produce and vice versa. Whatever the case may be, the price would be stable on the short term and move slowly along with electricity costs and CPU/GPU efficiency on the long term, rendering coins as stable as major fiat currencies.<br/><br/><i>Note that some replies before page 7 might seem irrelevant because of the suggestion improvements addressing them. The removed obsolete paragraphs from the original entry have been copied below in the third post of this thread just in case anyone wants to have a look to understand the full context of the discussion.</i><br/><br/><i>Note2: I've revived the thread at the bottom of page 20 due to the increased hacking and abuse of intermediary services such as the MtGox and Bitcoin7 exchangers. The underlying logic is that, had the coin's price been stable, we wouldn't have needed to trust them as often because we wouldn't have been forced to keep our wealth with them in the form of stable fiat instead of in our computers in the form of unstable coins.</i></div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "I-am-not-anonymous",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=41",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg391#msg391",
        "date": "February 18, 2010, 07:36:51 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg390#msg390\">Quote from: Suggester on February 18, 2010, 07:12:50 AM</a></div><div class=\"quote\">Every four years, the average BTC generator will need to spend double the effort to create the same amount of coins. </div><br/>As I understood it people will not need to double their CPU power to get the same amount of coins, rather there'd be half as many coins \"up for grabs\" by anybody with enough CPU power.<br/><br/>In other words, let's say a Powerful CPU can pull in 500 coins a day and a weaker CPU can pull in 300 coins per day from a pool of 10,500,000.<br/><br/>After 4 years, they are still pulling in 500 coins and 300 coins respectively, but now they can only access a pool of 5,250,000.<br/><br/>I could be wrong though.  Somebody who know what they're talking about please comment instead of me!</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg392#msg392",
        "date": "February 18, 2010, 07:43:10 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg391#msg391\">Quote from: I-am-not-anonymous on February 18, 2010, 07:36:51 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg390#msg390\">Quote from: Suggester on February 18, 2010, 07:12:50 AM</a></div><div class=\"quote\">Every four years, the average BTC generator will need to spend double the effort to create the same amount of coins. </div><br/>As I understood it people will not need to double their CPU power to get the same amount of coins, rather there'd be half as many coins \"up for grabs\" by anybody with enough CPU power.<br/><br/>In other words, let's say a Powerful CPU can pull in 500 coins a day and a weaker CPU can pull in 300 coins per day from a pool of 10,500,000.<br/><br/>After 4 years, they are still pulling in 500 coins and 300 coins respectively, but now they can only access a pool of 5,250,000.<br/><br/>I could be wrong though.  Somebody who know what they're talking about please comment instead of me!<br/></div><br/>The plan is to halve the value of the block every four years. So if your PC is making 6 blocks/day now (i.e 300 BTC/day), in 4 years it could be also be making 6 blocks/day, but your balance will only increase by 150 because the block would equal 25 instead of 50 BTCs<br/><br/><span style=\"text-decoration: underline;\">Edit 24 May 2011</span>: These are the removed paragraphs from the original 2010 first post. They are obsolete and no longer relevant as the post is now heavily edited. Nevertheless I thought I'd include them for anyone who wishes to understand the full context of the 2010 discussion (up to page 7).<br/><br/><i>So what's the solution? Well, as you might have already guessed, we should remove both the 4-years interval thing and the 21M limit. Just let BTCs continue to be created forever at a constant rate*. The rate should be divisible enough to give up to, say, 100,000 people an incentive to run the network simultaneously. In other words, the current 144 daily blocks (or units) aren't enough because this means that @ 100,000 users, one has to wait an average of 757.6 days (that's 2+ years) to see something pop up on his screen. 100k is an arbitrary figure, but remember that we need to mobilize as many nodes as possible to resist the tampering attempts of supercomputer-owning governments who can and will try to generate their own proof of work to ruin the project if it ever reaches mainstream. Also note that this will not lead to inflation in the foreseeable future, because the user base of bitcoin will continue to grow for years to come, let alone natural economic and population growth (unless the Mayans turn out to be right, of course).<br/><br/>This way, when the number of bitcoin-generating nodes approaches stability, we will end up with a slowly-growing number of bitcoins matching a slowly-growing number of nodes, resulting in the currency's relative price stability, leading in turn to the ultimate goal of it being used for exchange purposes.<br/><br/>Now for the fun part, a numerical example: If the system is producing 10k bitcoins/day at a constant rate (with difficulty adjusted by collective CPU power just like it is now), and the number of users attempting to generate BTCs was 10k after 1,000 days from now, and increasing at a constant rate of 10 new users/day, we will have and continue to have an average of 1,000 BTCs/user. No inflation, no deflation, no incentive to hoard BTCs, and no incentive to spend BTCs quickly (though that wouldn't necessarily be a bad thing!). Remember that we can always add or remove zero's if the numbers turned out to be awkward at some point, like Germany did in the 1920's hyper-inflation. Note that under this model, an initial price surge is inevitable because the number of nodes increases at abnormal rates at the project's beginning. As the project matures, there would be only reasonable user-base increases, so the price won't fluctuate much any longer (think the percentage increase in newly opened email accounts from 2000 to 2001 vs from 2020 to 2021, for example).<br/><br/>*Another idea would be to set the BTCs creation's difficulty irrelevant of total CPU power in the network so that, say, the average computer would create 1 BTC/day. The global price would then automatically adjust to the participants' average electricity and machine consumption cost. It would be sort of like buying some electricity from the utilities company and loading it on your machine as transferable BTCs. If electricity happens to be cheapest in India, Indians will initially profit from creating BTCs, but as their proportion among the nodes increases, the BTCs price will decrease as it approaches India's average electricity cost. Exchangers will quickly balance supply and demand just as in ForEx fluctuations, Econ 101, remember? Non-Indians would purchase BTCs from Indian exchangers at a very small profit margin because of competition. I personally prefer this model to the constant rate one because the amount of BTCs in circulation would generally be proportionate to the amount of users (sort of like farming gold in MMORPGs), instead of picking an arbitrary constant figure and letting users adjust to it. Thus this model avoids the initial price surge because there will be a balance from day one.<br/><br/>Admittedly, BTCs' price would be tied to energy's under this model. But then again, this is also the case in both my other and the current model. Besides, using Bitcoin for casual quick transfers (rather than as savings) would virtually eliminate this risk. Also granted that creating zillions of BTCs (eg. via governmental sabotage) would lead to inflation in this case if they flood the market with cheap coins, but then again this problem exists in the other two models as well, and can also be avoided by those using the coin for transfers only. But whereas in the other two models a supercomputer-or-two can ruin the whole project by barring most of the honest nodes from creating coins (via controlling most of the CPU power and skyrocketing coin-generating needed effort), under this uber-flexible model everybody will be able to create some coins and use them for transfers regardless of sabotage attempts.</i></div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "I-am-not-anonymous",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=41",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg394#msg394",
        "date": "February 18, 2010, 07:58:12 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg392#msg392\">Quote from: Suggester on February 18, 2010, 07:43:10 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg391#msg391\">Quote from: I-am-not-anonymous on February 18, 2010, 07:36:51 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg390#msg390\">Quote from: Suggester on February 18, 2010, 07:12:50 AM</a></div><div class=\"quote\">Every four years, the average BTC generator will need to spend double the effort to create the same amount of coins. </div><br/>As I understood it people will not need to double their CPU power to get the same amount of coins, rather there'd be half as many coins \"up for grabs\" by anybody with enough CPU power.<br/><br/>In other words, let's say a Powerful CPU can pull in 500 coins a day and a weaker CPU can pull in 300 coins per day from a pool of 10,500,000.<br/><br/>After 4 years, they are still pulling in 500 coins and 300 coins respectively, but now they can only access a pool of 5,250,000.<br/><br/>I could be wrong though.  Somebody who know what they're talking about please comment instead of me!<br/></div><br/>The plan is to halve the value of the block every four years. So if your PC is making 6 blocks/day now (i.e 300 BTC/day), in 4 years it could be also be making 6 blocks/day, but your balance will only increase by 150 because the block would equal 25 instead of 50 BTCs<br/></div><br/>I think I understand, thank you for correcting me.<br/><br/>Right now, Your average coin creation rate will be (6 * 50 coins / hour) * (your CPU speed / the total CPU speed in the system)<br/><br/>4 Years from now, Your average coin creation rate will be (6 * 25 coins / hour) * (your CPU speed / the total CPU speed in the system)<br/><br/>Because the amount of bitcoins per block <i>halves</i> every 4 years.<br/><br/>My question is, what happens if (your CPU Speed) and (The total CPU Speed in the System) <i>double </i> in 4 years?</div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg395#msg395",
        "date": "February 18, 2010, 08:02:53 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg394#msg394\">Quote from: I-am-not-anonymous on February 18, 2010, 07:58:12 AM</a></div><div class=\"quote\">I think I understand, thank you for correcting me.<br/></div>NP, I just sent you a PM <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/><br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg394#msg394\">Quote from: I-am-not-anonymous on February 18, 2010, 07:58:12 AM</a></div><div class=\"quote\">My question is, what happens if (your CPU Speed) and (The total CPU Speed in the System) <i>double </i> in 4 years?<br/></div>If both doubles then the ratio will stay the same, so the generation will stay the same. You see, it's all relative. Practically, of course, what will probably happen is that your ratio will be much less since more people will hear about Bitcoin (also given the recent surge in capitalist-anarchists and communists).</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "I-am-not-anonymous",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=41",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg396#msg396",
        "date": "February 18, 2010, 08:50:05 AM",
        "content": "<div class=\"post\">I'm really tired and I have work tomorrow so this will be my final post for possibly 18 hours but I see what you're saying--your ability to generate bitcoins will inevitably be reduced because people with high-power server farms will take over production.<br/><br/>But when the first system-wide \"halving\" of bitcoins occurs there will be 10,500,000 while the server farms get started on the 5,200,000.<br/><br/>This means twice as many bitcoins will be available via exchange than via creation.  If some CPU farmer determines that in now takes double his resources to make bitcoins and thus doubles his exchange rate for his fresh product, he is very likely to be underbid by the people controlling the 10,500,000 because of the time value of money.<br/><br/>You said \"only and idiot would sell at 19% interest rates\" (paraphrase) but in a free market, somebody HAS to be willing to sell for there to even BE an interest rate, people willing to exchange value today for value tomorrow.</div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg397#msg397",
        "date": "February 18, 2010, 09:10:12 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg396#msg396\">Quote from: I-am-not-anonymous on February 18, 2010, 08:50:05 AM</a></div><div class=\"quote\">I see what you're saying--your ability to generate bitcoins will inevitably be reduced because people with high-power server farms will take over production.<br/></div>That's only a tiny part of the problem!<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg396#msg396\">Quote from: I-am-not-anonymous on February 18, 2010, 08:50:05 AM</a></div><div class=\"quote\">This means twice as many bitcoins will be available via exchange than via creation.  If some CPU farmer determines that in now takes double his resources to make bitcoins and thus doubles his exchange rate for his fresh product, he is very likely to be underbid by the people controlling the 10,500,000 because of the time value of money.<br/></div>What will probably happen is the other way around: Those who create BTCs in the first 4 years will make unreasonable profit as they enter the 5th year, and those who create BTCs in the second 4 years will make unreasonable profit as they enter the 9th year, etc<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg396#msg396\">Quote from: I-am-not-anonymous on February 18, 2010, 08:50:05 AM</a></div><div class=\"quote\">You said \"only and idiot would sell at 19% interest rates\" (paraphrase) but in a free market, somebody HAS to be willing to sell for there to even BE an interest rate, people willing to exchange value today for value tomorrow.<br/></div>The \"interest rate\" would be the expected future value at best, or Bitcoin will be regarded as a currency without a future at worst. Just like Pyramid Schemes: Many people bought them but nobody took them seriously. It is well established that under perfectly free markets, commodities are sold at a very small or even no margin above their cost on the long run. Since BTCs cost will double every 4 years, so will their price. So nobody under normal circumstances would be willing to sell his ever-inflating BTCs unless he wants to escape the system with some profit before it collapses.</div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "sirius",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=4",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg398#msg398",
        "date": "February 18, 2010, 01:31:50 PM",
        "content": "<div class=\"post\">Bitcoin is similar to gold in terms of finite supply and increasing mining costs. Every argument you can make against Bitcoin economy you can make against gold economy, but gold economy still works. Actually, gold currency has been throughout the history unmatched by any paper money in stability.<br/><br/>It's an old keynesian argument that deflation is bad because it leads to a \"deflationary spiral\" where nobody eventually buys anything, because they can get more the next day. That didn't happen where gold standard was applied. Maybe some people will not buy today, but they'll buy tomorrow when the price is lower and they want to enjoy their finite lifetime. A good example is the computers market - you can get twice as good a computer with the same price if you wait a few years, but people still do buy computers today.<br/><br/>Also, it's good to note that production cost doesn't equal value. You could start printing a currency of your own, but it's value wouldn't be equal to your printing costs. The value is zero if nobody accepts them as payment, or it can be more than the printing costs if many people accept it for payment and there's not too many notes in circulation. That's why I've found NewLibertyStandard's pricing by the production costs a bit misleading, giving the wrong picture to some people that bitcoin <i>value</i> is somehow bound to the electricity <i>cost</i>. He may of course sell and buy at whatever price he wants, but he'll be short on either bitcoins or dollars if it's not the market price (supply/demand).</div>",
        "post_num": 8,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg399#msg399",
        "date": "February 18, 2010, 07:58:55 PM",
        "content": "<div class=\"post\">There isn't a right and wrong economic model. Every model adjusts to supply and demand, they just adjust in different ways.<br/><br/>The current model is beneficial to early adopters in three different ways. First, early adopters generate more bitcoins while there is less competition at the beginning. Second, the availability of bitcoins decreases, which cements their position of wealth. Last, the early adopters have the potential to get rich off the latecomers once generating blocks becomes extremely difficult. Latecomers will have to inject dollars or something else of worth in order to get access to bitcoins and the wealth will go disproportionately to the early adopters.<br/><br/>The idea of the swarm increasing the amount of bitcoins awarded as processing power increases is interesting, but I think it would give too much advantage to botnets. With a constant amount of bitcoins being generated, they can only collect a days worth of bitcoins per day, but if the number of bitcoins was variable, they could swoop in and generate a thousand years worth of bitcoins in a few weeks.<br/><br/>In my ideal model, the same amount of blocks would be generated per day, but 100 bitcoins with no decimal would be awarded for generating a block instead of 50.00 and the amount of bitcoins awarded per block would stay the same forever instead of halving every four years. This would give one advantage to the early adopters who would be able to generate bitcoins more easily while there is less competition at the beginning and it would allow deflation as more people adopt bitcoins, but it would also allow for inflation as more bitcoins are generated, thus encouraging people to spend their bitcoins. Eventually creating bitcoins will still become very difficult and dollars or something else of worth will have to be injected in order for latecomers to get access to bitcoins, but as time passes, that wealth will be distributed more and more evenly between early adopters and latecomers. I prefer 100 to 50.00 because bitcoins are going to take a while before they are worth enough to need to be more divisible and because it's not clear whether a single bitcoin is ฿1.00 or ฿0.01.</div>",
        "post_num": 9,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg400#msg400",
        "date": "February 18, 2010, 09:19:23 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">Bitcoin is similar to gold in terms of finite supply and increasing mining costs. Every argument you can make against Bitcoin economy you can make against gold economy, but gold economy still works. Actually, gold currency has been throughout the history unmatched by any paper money in stability.<br/></div>No. Gold was synonymous to \"money\". Things were valued for how much gold they were worth, not vice versa. We should think of bitcoin today as a new unestablished currency in a world of established alternatives (eg. the Euro 10 years ago). Additionally, if we assume that it became impossible to mine virtually anymore gold today, and we further assume that the demand for gold was perpetually on the rise (for example because women were increasingly using it for jewelery), then yes, it will result in a perpetual deflation for its value and nobody would be willing to sell their gold except for emergencies. Under these conditions, using gold as a means of payment is a sure way for starting a depression!<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">It's an old keynesian argument that deflation is bad because it leads to a \"deflationary spiral\" where nobody eventually buys anything, because they can get more the next day. <br/></div>Old and true <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/><br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">That didn't happen where gold standard was applied. <br/></div>What has gold standard got with increasing the value of BTCs over time? Gold was ALREADY a medium of exchange when the gold standard was applied. I can imagine that the very first time some human discovered the first gold mine, everybody in their area thought it looked cool and started using it as a medium of exchange. People have been mining gold for thousands of years and we haven't still run out of it. BTCs will essentially stop its generation within 15 years.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">Maybe some people will not buy today, but they'll buy tomorrow when the price is lower and they want to enjoy their finite lifetime. <br/></div>They won't buy tomorrow when the price is lower because it will never be lower as we approach the \"next four years limit\".<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">A good example is the computers market - you can get twice as good a computer with the same price if you wait a few years, but people still do buy computers today.<br/></div>Computers are totally different because you can't sell them 4 years from now for double what they're worth today. Had this been the case, nobody would ever sell a computer unless he's starving. Heck, just look at NewLibertyStandard's graph. It will keep shooting up as long as this 4-year model continues.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">Also, it's good to note that production cost doesn't equal value. You could start printing a currency of your own, but it's value wouldn't be equal to your printing costs. The value is zero if nobody accepts them as payment, or it can be more than the printing costs if many people accept it for payment and there's not too many notes in circulation. That's why I've found NewLibertyStandard's pricing by the production costs a bit misleading, giving the wrong picture to some people that bitcoin <i>value</i> is somehow bound to the electricity <i>cost</i>.<br/></div>If the value is more than my printing costs, I'll be busy printing like there's no tomorrow until the price equals my cost (remember that I'm acting like a selfish unorganized person, not an entity or a country, just like most of Bitcoin users will be). If the value is less than my printing costs, me or anyone who wishes to acquire that currency will buy it from others instead of creating it, raising the price of coins already in circulation and dropping the competition and cost of creating new ones (and in bitcoin's case that means network and proof-of-work failure). So you see, in our coin's case, its market value must equal electricity &amp; computer cost. Not more or less. And in any perfectly free market you'll find a similar situation: price = cost.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">He may of course sell and buy at whatever price he wants, but he'll be short on either bitcoins or dollars if it's not the market price (supply/demand).<br/></div>You said it: Supply &amp; demand. What will happen if BTC got successful is that demand will increase while supply dwindles. At some point (after about 15 years) there will be more and more people demanding coins while almost none is generated. This will result in the price increasing until every human on the planet who will potentially use bitcoin has already joined its market (assuming the 4-year doubling thing was removed). And you know what? Maybe that happened to gold in the beginning of its discovery, until almost all people on the planet had gold available to them if they had a reasonable equivalent (e.g. In Arabia, more than a thousand years ago, you could have sold a camel at a time for about 70 gold dinars, and a rabbit for tenth of a gold dinar. Not too difficult to make).<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg399#msg399\">Quote from: NewLibertyStandard on February 18, 2010, 07:58:55 PM</a></div><div class=\"quote\">There isn't a right and wrong economic model. Every model adjusts to supply and demand, they just adjust in different ways.<br/></div>Pyramid Schemes is an absolutely \"wrong\" economic model!<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg399#msg399\">Quote from: NewLibertyStandard on February 18, 2010, 07:58:55 PM</a></div><div class=\"quote\">The current model is beneficial to early adopters in three different ways.<br/></div>Who said it should be beneficial to early adopters? I mean, that's cool because I happen to be one, but if it undermines the model's sustainability then it shouldn't stay.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg399#msg399\">Quote from: NewLibertyStandard on February 18, 2010, 07:58:55 PM</a></div><div class=\"quote\">The idea of the swarm increasing the amount of bitcoins awarded as processing power increases is interesting, but I think it would give too much advantage to botnets. With a constant amount of bitcoins being generated, they can only collect a days worth of bitcoins per day, but if the number of bitcoins was variable, they could swoop in and generate a thousand years worth of bitcoins in a few weeks.<br/></div>Uh huh, but botnets can't start generating now and collecting 90%+ of newly created blocks? Botnets/supercomputers will always be a problem in any model. But with a limited supply such as 6 blocks/hour, almost nobody can compete with them (can you wait 2 months for a coin to appear?). While if the supply is unlimited, at least we'll end up getting something, and hopefully trading it for a price close to what you've paid for it.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg399#msg399\">Quote from: NewLibertyStandard on February 18, 2010, 07:58:55 PM</a></div><div class=\"quote\">In my ideal model, the same amount of blocks would be generated per day, but 100 bitcoins with no decimal would be awarded for generating a block instead of 50.00 and the amount of bitcoins awarded per block would stay the same forever instead of halving every four years. <br/></div>That's what I've been advocating as the second-best solution. But we'll need to increase the # of daily blocks to give enough incentives though as I explained in the initial post.</div>",
        "post_num": 10,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg401#msg401",
        "date": "February 18, 2010, 10:29:13 PM",
        "content": "<div class=\"post\">I stand by my statement that the current economic model is not wrong. You might dislike it and I might not prefer it, but other people do prefer it. Our perspective is no more valid than theirs. But that's not to say that I wouldn't use a bitcoin variant if it more closely resembled the description I offered.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg400#msg400\">Quote from: Suggester on February 18, 2010, 09:19:23 PM</a></div><div class=\"quote\">Who said it should be beneficial to early adopters?<br/></div>I'm just stating the facts, sir.<br/><br/>Currently a botnet could generate 99.9% of bitcoins per day, but if bitcoin generation payout was variable, they could generate over 9000% of how many bitcoins are generated per day without them. Botnet operators value their CPU cycles, so being able to generate over 9000% until they have as many as they currently want and then being able to stop and use their CPU cycles for other purposes is much more advantageous than having to use their spare CPU cycles to only generate a capped amount per day.<br/><br/>The number of blocks generated per day can not be easily increased or decreased because there has to be enough time to propagate the blocks to all other nodes while still being frequent enough to allow timely transactions. What can vary is the amount of bitcoins per block. The amount of bitcoins awarded per block can either increase, decrease or stay constant over time. If every person had an equal amount of CPU cycles at his disposal, I would prefer for the amount of bitcoins awarded per generated block to increase proportionally to the amount of CPU used to generate bitcoins. As it is, I'm in favor of the amount staying constant over time.</div>",
        "post_num": 11,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg402#msg402",
        "date": "February 18, 2010, 10:42:03 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg400#msg400\">Quote from: Suggester on February 18, 2010, 09:19:23 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg398#msg398\">Quote from: sirius-m on February 18, 2010, 01:31:50 PM</a></div><div class=\"quote\">Maybe some people will not buy today, but they'll buy tomorrow when the price is lower and they want to enjoy their finite lifetime. <br/></div>They won't buy tomorrow when the price is lower because it will never be lower as we approach the \"next four years limit\".<br/></div>He was referring to the price of goods decreasing as value of a bitcoin increases. Eventually the value of bitcoins will go high enough and the price of the goods will go low enough that the person will feel rich enough to spend his bitcoins. To take it to an extreme, if a person has ten thousand bitcoins and can buy the TV of his dreams for one bitcoin, the value of having the TV now is greater than the future potential increased value of the one 10,000th of his total bitcoins.</div>",
        "post_num": 12,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg404#msg404",
        "date": "February 19, 2010, 01:06:34 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg401#msg401\">Quote from: NewLibertyStandard on February 18, 2010, 10:29:13 PM</a></div><div class=\"quote\">Currently a botnet could generate 99.9% of bitcoins per day, but if bitcoin generation payout was variable, they could generate over 9000% of how many bitcoins are generated per day without them. <br/></div>9000% of the now-cheaper-coin because so much of it is available after they joined. It all balances out in the end, and in both cases they have an incentive to join the network. Actually, under the current model they have even more incentive because the coin can never get cheaper!<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg401#msg401\">Quote from: NewLibertyStandard on February 18, 2010, 10:29:13 PM</a></div><div class=\"quote\">Botnet operators value their CPU cycles, so being able to generate over 9000% until they have as many as they currently want and then being able to stop and use their CPU cycles for other purposes is much more advantageous than having to use their spare CPU cycles to only generate a capped amount per day.<br/></div>To be honest, I don't see what more harm a botnet can make if we changed to the suggested model. Economically, it would be just like 1,000 honest members joined the network. This can even help the project with some free advertising on security blogs <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/><br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg401#msg401\">Quote from: NewLibertyStandard on February 18, 2010, 10:29:13 PM</a></div><div class=\"quote\">The number of blocks generated per day can not be easily increased or decreased because there has to be enough time to propagate the blocks to all other nodes while still being frequent enough to allow timely transactions. What can vary is the amount of bitcoins per block. The amount of bitcoins awarded per block can either increase, decrease or stay constant over time. If every person had an equal amount of CPU cycles at his disposal, I would prefer for the amount of bitcoins awarded per generated block to increase proportionally to the amount of CPU used to generate bitcoins. As it is, I'm in favor of the amount staying constant over time.<br/></div>How about a middle solution then? For example, the default difficulty be adjusted to about 1 block/CPU/day (assuming an average 2.4 GHz processor), but in case more than X blocks/day was being created (X = the maximum # of daily blocks afterwhich there is no enough time for propagation across the network), then difficulty gets automatically adjusted. Practically, it would end up being like my second-best and your best model. In other words, very close to the current situation except that we assume the current 4-years-period is extended to forever. So let's at least agree that the removal of the 4-year thing and the 21M limit is essential to avoid an ever-deflating currency.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg402#msg402\">Quote from: NewLibertyStandard on February 18, 2010, 10:42:03 PM</a></div><div class=\"quote\">He was referring to the price of goods decreasing as value of a bitcoin increases. Eventually the value of bitcoins will go high enough and the price of the goods will go low enough that the person will feel rich enough to spend his bitcoins. To take it to an extreme, if a person has ten thousand bitcoins and can buy the TV of his dreams for one bitcoin, the value of having the TV now is greater than the future potential increased value of the one 10,000th of his total bitcoins.<br/></div>You only switched the problem to another user then: The TV seller! He would also keep this coin until he has 10,000 coins. The point is that it's very hard (albeit not impossible) to convince people to spend or transfer a coin they are pretty sure will be 19% more valuable within a year. Moreover, economic-savvy folks might as well choose not to join the network if they predict this will happen, or join it with the intent of \"hitting-and-running\" a quick profit before the system's failure becomes imminent, and they will be right.</div>",
        "post_num": 13,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg405#msg405",
        "date": "February 19, 2010, 06:26:18 PM",
        "content": "<div class=\"post\">The problem with botnets is that their operators are stealing electricity, bandwidth and access to RAM, hard drive space and CPU time. Everyone else is paying for those resources out of their own pockets.<br/><br/>The order of my preferences for how I would like bitcoin to work is first, for the amount of bitcoins awarded to stay constant as I <a href=\"https://www.bitcoin.org/smf/index.php?topic=57.msg399#msg399\">previously described</a>, second, for the amount of bitcoins awarded to increase at a constant rate, third, for the amount of bitcoins awarded to decrease at a constant rate, last and least, for the amount of bitcoins awarded to increase at a variable rate. If botnets did not exist than the variable option would be at the top of my list instead of the bottom.<br/><br/>EDIT: My new highest preference for how I would like bitcoin to work is for the amount of bitcoins awarded to increase at the same rate as worldwide human population growth.<br/><br/>If the TV buyer is an early adopter and the TV seller is a latecomer, then the TV buyer already has many bitcoins and it would cost the TV seller more dollars worth of electricity than the price of the TV to generate 1 bitcoin. I do not agree that it will be hard to get people to spend their bitcoins. People do value potential future increases, but they also value having an item now. Why would someone borrow money on a credit card with a 19% interest rate instead of keeping their money in their savings account? They do it because they value having the TV now more than the potential losses over time. Life is short. You're welcome to save all your high returning money until the day you die, but the rest of us are going to make use of it before it's no use to us.</div>",
        "post_num": 14,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg406#msg406",
        "date": "February 19, 2010, 06:48:30 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg400#msg400\">Quote from: Suggester on February 18, 2010, 09:19:23 PM</a></div><div class=\"quote\">Heck, just look at NewLibertyStandard's graph. It will keep shooting up as long as this 4-year model continues.<br/></div>My exchange rate will only increase as Bitcoin becomes more popular. There are practical limits to the popularity of Bitcoin. Sure, potentially it could be run on every functional computer around the world, but from practical perspective, that will never happen. The swarm is currently pretty small, so when a few new users join, there is a large effect on my exchange rate and it increases fairly quickly. As the rate of growth slows or reverses and as my exchange rate average increases over the next two years, the exchange rate will steady out with only very small increases AND decreases every day. As for the impending doom and gloom you're prophesying will accompany the decreased payout in a few years, all I have to do is add a little multiply by two to my exchange rate calculation and the problem is solved. The exchange rate stays constant and everyone is happy. In any case, hopefully by then there will be other ways of calculating the value of a bitcoin other than my single solitary exchange service.</div>",
        "post_num": 15,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "I-am-not-anonymous",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=41",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg407#msg407",
        "date": "February 20, 2010, 01:06:02 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg400#msg400\">Quote from: Suggester on February 18, 2010, 09:19:23 PM</a></div><div class=\"quote\">No. Gold was synonymous to \"money\". Things were valued for how much gold they were worth, not vice versa. </div><br/>In school, they taught us (i.e. me) that a good's <del>value</del> price is based solely on what people can exchange it for.  They also taught us that a good's value was <i>not</i> determined by how much labor went into the good.<br/><br/>We were essentially told that if one camel is worth 50 gold dinars, then 50 gold dinars is also worth one camel.  Or something to that effect.<br/><br/>If this is the case, then the cost of producing bitcoins would only a be a factor in, not a determinant of, their value.<br/><br/>Did I understand the lesson correctly?<br/><br/>_______________________________________________________________________________<span style=\"width: 0; margin: 0 -0.6ex 0 -1px;\"> </span>______________________________<br/>On the general topic of whether bit-coin will/will not be successful--I don't really know.  I act as though I am a \"bitcoin defender\" but this is mostly because I am excited about the new currency and want to support it, not because I know enough about economics to predict it's eventual usefulness.  <br/><br/>I would very much like to see people who dislike bitcoin's design organize and code alternative currencies that inflate according to a monetary rule, or have the built in safeguards you described.  That way, the market will eventually choose the best currency as people move towards the good ones and away from the bad.  <br/><br/>I am not sure if bitcoin's creators will be convinced to implement the changes you recommend--but i think you are very likely to find people who agree with your plan for a better encrypted digital currency and will help you modify or re-write bitcoin's source to make it happen.</div>",
        "post_num": 16,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg408#msg408",
        "date": "February 20, 2010, 01:15:18 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg405#msg405\">Quote from: NewLibertyStandard on February 19, 2010, 06:26:18 PM</a></div><div class=\"quote\">The problem with botnets is that their operators are stealing electricity, bandwidth and access to RAM, hard drive space and CPU time. Everyone else is paying for those resources out of their own pockets.<br/></div>That's not a problem for Bitcoin or its users. If those CPU cycles aren't used to steal electricity for bitcoin, they'd be used to steal electricity to DDoS some site or brute-force some account. We shouldn't worry about them. As I said, they're just as if those users voluntarily joined the network for all practical purposes.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg405#msg405\">Quote from: NewLibertyStandard on February 19, 2010, 06:26:18 PM</a></div><div class=\"quote\">EDIT: My new highest preference for how I would like bitcoin to work is for the amount of bitcoins awarded to increase at the same rate as worldwide human population growth.<br/></div>\"Human population\" is totally irrelevant. Even if human population was shrinking by, say 1% annually now, I assure you that Internet users population will be increasing and bitcoin users will be increasing at an even higher rate. \"Bitcoin users\" is the magic word here. With the suggested variable model, we're always sure that new coin generation matches the expanding (or shrinking) user base. But anyway, I see that you're beginning to side with me that the 4-year-doubling isn't a good idea.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg405#msg405\">Quote from: NewLibertyStandard on February 19, 2010, 06:26:18 PM</a></div><div class=\"quote\">If the TV buyer is an early adopter and the TV seller is a latecomer, then the TV buyer already has many bitcoins and it would cost the TV seller more dollars worth of electricity than the price of the TV to generate 1 bitcoin. <br/></div>Man, if you paid $1,000 for an ounce of gold, then a few months later it was worth $2,000, are you going to sell it for $1,000?! No? Good. Because the early adopter will not treat his coins as if they're worth the pennies he paid for them anymore now that they're worth a ton of electricity. He'd treat them for what they're worth today.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg405#msg405\">Quote from: NewLibertyStandard on February 19, 2010, 06:26:18 PM</a></div><div class=\"quote\">I do not agree that it will be hard to get people to spend their bitcoins. People do value potential future increases, but they also value having an item now. Why would someone borrow money on a credit card with a 19% interest rate instead of keeping their money in their savings account? They do it because they value having the TV now more than the potential losses over time. Life is short. You're welcome to save all your high returning money until the day you die, but the rest of us are going to make use of it before it's no use to us.<br/></div>My answer is simple: Assuming people approve the current Bitcoin's model, it will turn out to be the #1 worldwide investment: Just buy (or hack) a bunch of PCs, let them run, and you'll be earning at least 19% annually with no risk involved! Investors (and indeed, botnets) won't leave a chance for normal folks like you and me to earn any BTCs much less spend them. Any bitcoin will be spent 2-3 times at most before falling into the hands (well, \"the computers\" is the better term here) of an investor who'll keep it for a very long time or forever. This model has to change or it will destroy the otherwise excellent idea. Making bitcoin a way to INVEST rather than to SPEND is its one-way ticket to failure. You also forgot that bitcoins will leave the stream all the time (eg. computer failures or accidental deletion), which will add to their deflating. Might as well turn this 19% into 20% or something.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg406#msg406\">Quote from: NewLibertyStandard on February 19, 2010, 06:48:30 PM</a></div><div class=\"quote\">My exchange rate will only increase as Bitcoin becomes more popular. There are practical limits to the popularity of Bitcoin. Sure, potentially it could be run on every functional computer around the world, but from practical perspective, that will never happen. The swarm is currently pretty small, so when a few new users join, there is a large effect on my exchange rate and it increases fairly quickly. As the rate of growth slows or reverses and as my exchange rate average increases over the next two years, the exchange rate will steady out with only very small increases AND decreases every day. <br/></div>Even if we assume that Bitcoin's current users will never increase (thus not making it more difficult to generate coins), we're sure that its value will increase by at least 19% annually because of the expected 4-year-old D-day when which all BTCs price magically doubles because it will cost double to generate them.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg406#msg406\">Quote from: NewLibertyStandard on February 19, 2010, 06:48:30 PM</a></div><div class=\"quote\">As for the impending doom and gloom you're prophesying will accompany the decreased payout in a few years, all I have to do is add a little multiply by two to my exchange rate calculation and the problem is solved. The exchange rate stays constant and everyone is happy.<br/></div>Can you explain that part? I didn't understand how multiplying by two will achieve stability.<br/><br/>PS. It might be a good idea to merge your previous double-posts in one via Edit to make reading easier for us and those following us. The world is watching (or some three-letter-agencies anyway <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/>)<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg407#msg407\">Quote from: I-am-not-anonymous on February 20, 2010, 01:06:02 AM</a></div><div class=\"quote\">We were essentially told that if one camel is worth 50 gold dinars, then 50 gold dinars is also worth one camel.  Or something to that effect.<br/></div>If we assume that dinars can't be used for any other non-monetary purposes (such as jewelry, paperweights, etc), then it's practically very difficult for them to have a demand curve by themselves. Camels can be used to ride, so their gold price fluctuated (i.e. They become more or less popular with time). Bitcoin can only be used as money, so it's used solely to value things not vice versa.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg407#msg407\">Quote from: I-am-not-anonymous on February 20, 2010, 01:06:02 AM</a></div><div class=\"quote\">Did I understand the lesson correctly?<br/></div>If raising a camel costed more than 50 dinars, you can count on people stopping raising camels until the price goes back up due to supply shortage. With the absolutely arbitray 4-year model, this can never happen. Supply will ALWAYS decrease no matter what. I'm asking for a more flexible method which depends on the actual number of users.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg407#msg407\">Quote from: I-am-not-anonymous on February 20, 2010, 01:06:02 AM</a></div><div class=\"quote\">On the general topic of whether bit-coin will/will not be successful--I don't really know.  I act as though I am a \"bitcoin defender\" but this is mostly because I am excited about the new currency and want to support it, not because I know enough about economics to predict it's eventual usefulness.  <br/></div>If I wasn't, I wouldn't be here crying my lungs out to correct the model for a one which will work!<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg407#msg407\">Quote from: I-am-not-anonymous on February 20, 2010, 01:06:02 AM</a></div><div class=\"quote\">but i think you are very likely to find people who agree with your plan for a better encrypted digital currency and will help you modify or re-write bitcoin's source to make it happen.<br/></div>I know practically nothing about programming or coding. I'm interested in economics (as you might have guessed <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/>) and was trying to offer a bit of advice to the geeks who do the coding.</div>",
        "post_num": 17,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg409#msg409",
        "date": "February 20, 2010, 02:44:56 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg408#msg408\">Quote from: Suggester on February 20, 2010, 01:15:18 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg406#msg406\">Quote from: NewLibertyStandard on February 19, 2010, 06:48:30 PM</a></div><div class=\"quote\">As for the impending doom and gloom you're prophesying will accompany the decreased payout in a few years, all I have to do is add a little multiply by two to my exchange rate calculation and the problem is solved. The exchange rate stays constant and everyone is happy.<br/></div>Can you explain that part? I didn't understand how multiplying by two will achieve stability.<br/></div>I use a formula to calculate my exchange rate which is described on my <a href=\"http://newlibertystandard.wetpaint.com/page/Exchange+Rate\">exchange rate page</a>. When I generate my first block of ฿25 rather than ฿50, I can simply change my formula to multiply bitcoins generated by two which will turn that ฿25 into ฿50 within my formula. Bitcoins are worth how much I say they are worth. If tomorrow I say they're all worth half as much as today then it would be so. Go ahead and create your own exchange service using your own formula to value bitcoins and you can have just as much control over the worth of bitcoins.<br/><br/>I absolutely disagree that the current model is unsustainable and I absolutely disagree that people will not spend their bitcoins. If I had my druthers, the amount of bitcoins awarded would grow at the same rate as worldwide human population growth, but it doesn't matter because druthers are just druthers and they ain't important at all.</div>",
        "post_num": 18,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "Suggester",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=31",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg410#msg410",
        "date": "February 20, 2010, 03:56:26 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg409#msg409\">Quote from: NewLibertyStandard on February 20, 2010, 02:44:56 AM</a></div><div class=\"quote\">I use a formula to calculate my exchange rate which is described on my <a href=\"http://newlibertystandard.wetpaint.com/page/Exchange+Rate\">exchange rate page</a>. When I generate my first block of ฿25 rather than ฿50, I can simply change my formula to multiply bitcoins generated by two which will turn that ฿25 into ฿50 within my formula. Bitcoins are worth how much I say they are worth. If tomorrow I say they're all worth half as much as today then it would be so. Go ahead and create your own exchange service using your own formula to value bitcoins and you can have just as much control over the worth of bitcoins.<br/></div>OMG. The moment you do that you'll run out of coins immediately because buying them from you would cost only half as much as generating them!<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg409#msg409\">Quote from: NewLibertyStandard on February 20, 2010, 02:44:56 AM</a></div><div class=\"quote\">I absolutely disagree that the current model is unsustainable and I absolutely disagree that people will not spend their bitcoins. <br/></div>Fine. But until someone answers the numerous doubts I've raised in here, I (and anyone with basic economics background) won't believe Bitcoin's current model has a promising future.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg409#msg409\">Quote from: NewLibertyStandard on February 20, 2010, 02:44:56 AM</a></div><div class=\"quote\">If I had my druthers, the amount of bitcoins awarded would grow at the same rate as worldwide human population growth<br/></div>But I already explained why that was irrelevant. Oh well... nevermind.</div>",
        "post_num": 19,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Current Bitcoin economic model is sustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg411#msg411",
        "date": "February 20, 2010, 05:12:51 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg410#msg410\">Quote from: Suggester on February 20, 2010, 03:56:26 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg409#msg409\">Quote from: NewLibertyStandard on February 20, 2010, 02:44:56 AM</a></div><div class=\"quote\">I use a formula to calculate my exchange rate which is described on my <a href=\"http://newlibertystandard.wetpaint.com/page/Exchange+Rate\">exchange rate page</a>. When I generate my first block of ฿25 rather than ฿50, I can simply change my formula to multiply bitcoins generated by two which will turn that ฿25 into ฿50 within my formula. Bitcoins are worth how much I say they are worth. If tomorrow I say they're all worth half as much as today then it would be so. Go ahead and create your own exchange service using your own formula to value bitcoins and you can have just as much control over the worth of bitcoins.<br/></div>OMG. The moment you do that you'll run out of coins immediately because buying them from you would cost only half as much as generating them!<br/></div>I will always have dollars and bitcoins available to inject into my exchange service. I may run out today, but there will always be more available tomorrow. It's all detailed on <a href=\"http://newlibertystandard.wetpaint.com/page/Exchange+Rate\">my exchange rate page</a>.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=57.msg410#msg410\">Quote from: Suggester on February 20, 2010, 03:56:26 AM</a></div><div class=\"quote\">Fine. But until someone answers the numerous doubts I've raised in here, I (and anyone with basic economics background) won't believe Bitcoin's current model has a promising future.<br/></div>Fine. But regardless of whether someone answers the numerous doubts you've raised in here, I (and anyone with advanced economics background) will believe Bitcoin's current model has a promising future.</div>",
        "post_num": 20,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "xc",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=40",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg412#msg412",
        "date": "February 20, 2010, 06:39:33 AM",
        "content": "<div class=\"post\">Nothing to sweat people.  Nobody ever died of a 'deflationary spiral.'  <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/>  I agree with \"I-am-not-anonymous.\"  The market will choose the best bitcoin-like currency.  I happen to believe, however, that the rules that Satoshi has founded bitcoin on will be more than adequate for the future of a thriving bitcoin economy.  <br/><br/>Everybody knows exactly how fast the supply of bitcoins will grow: it's set in stone in the rules of the programming and the bitcoin network.  While it's true that there is not a currently existing fully-fleshed out market to truly price bitcoins, such markets and exchanges are being developed.  As far as future would-be bitcoin generators are concerned, the question is not how much will he \"demand....to compensate for his costs.\"  The question he'll be asking himself is \"given current market values and my ability to utilize electricity and CPU resources, is it worth it for me to generate bitcoins?\"  If the answer is yes, he participates.  If it's no, he stops trying to mine for bitcoins and focuses on trading tangible assets with bitcoins serving as an appropriate intermediary.  If he's not sure, he tries his hand at it for a while and then makes a final decision.<br/><br/>The number of nodes and associated computational cpu power will be in flux, and that competitive flux will allow for costs to approximate value (not the other way around.)  Value being set by the markets and the demand for use of bitcoin as a trade intermediary (a money).  In the far future, the competition of transaction costs will play a more important role for the would-be node operator.<br/><br/>Contrary to the paradox of thrift argument you present, collecting bitcoins and saving them with hopes of earning purchasing power through deflation is not a bad thing.  It will allow for the pooling of bitcoin capital and make purchases of larger capital investments possible.  In the future, there might even be bitcoin banks that lend out saved bitcoins with market-set interest rates, thereby diminishing the effects of hoarding.  All this wonderful saving, however, comes at a price: delayed gratification of present desires.  From the perspective of the would-be saver, the question will always be denying present desires to purchase real tangible assets now versus the future possibilities of purchasing more later.  This time preference naturally varies with people and in different circumstances. <br/><br/>Given the fact that bitcoins are by their electronic nature easily divisible, prices will be able to easily adjust to deflationary pressures.  If too many are saving, prices will fall and the rate of interest will go down.  This encourages demand (lower prices) and decreases the desire to save (less interest). <br/><br/>XC</div>",
        "post_num": 21,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 31,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Current Bitcoin economic model is unsustainable",
        "url": "https://bitcointalk.org/index.php?topic=57.msg415#msg415",
        "date": "February 21, 2010, 05:44:24 AM",
        "content": "<div class=\"post\">Excellent analysis, xc.<br/><br/>A rational market price for something that is expected to increase in value will already reflect the present value of the expected future increases.  In your head, you do a probability estimate balancing the odds that it keeps increasing.<br/><br/>In the absence of a market to establish the price, NewLibertyStandard's estimate based on production cost is a good guess and a helpful service (thanks).  The price of any commodity tends to gravitate toward the production cost.  If the price is below cost, then production slows down.  If the price is above cost, profit can be made by generating and selling more.  At the same time, the increased production would increase the difficulty, pushing the cost of generating towards the price.<br/><br/>In later years, when new coin generation is a small percentage of the existing supply, market price will dictate the cost of production more than the other way around.<br/><br/>At the moment, generation effort is rapidly increasing, suggesting people are estimating the present value to be higher than the current cost of production.</div>",
        "post_num": 22,
        "is_displayed": true,
        "nested_level": 0
    }
]