[
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9186#msg9186",
        "date": "August 14, 2010, 12:43:54 PM",
        "content": "<div class=\"post\">The difficulty for generating bitcoins is periodically adjusted using a method<br/>that has worked well this far.  However, I am afraid there are plausible<br/>scenarios where the current method would misbehave quite spectacularly.<br/><br/>One scenario goes like this:<br/><br/>1) As bitcoins become more known, competition among minters continues to<br/>    increase, with corresponding increases in difficulty.  The increased<br/>    difficulty will eventually make bitcoin minting clearly unprofitable for<br/>    those who do not have access to good energy prices and cheap access to an<br/>    energy-efficient HW/SW combination.<br/><br/>2) Some bitcoin users may continue to mint bitcoins even though it is not<br/>    profitable for them.  This could be due to ideology, the fun factor, or<br/>    just ignorance.  But it is quite plausible that the vast majority of<br/>    bitcoins will be minted by those who profit from it.  Let's say that 99% of<br/>    all bitcoins are eventually minted by for-profit-minters.<br/><br/>3) The competition among for-profit-minters will drive profit margins down, to<br/>    the point where it is profitable to continue minting, but barely so.  Let's<br/>    say that the typical profit margin during one difficulty adjustment period<br/>    (2016 blocks) is 10%.<br/><br/>4) Since bitcoin minting is a decentralized uncoordinated process, we can<br/>    expect random fluctuations in bitcoin minting activity.  This does not<br/>    affect the difficulty during a specific 2016-block period, so the minting<br/>    activity can e.g. increase by 20% during a period without making minting<br/>    unprofitable within that period.<br/><br/>Given the above assumptions, we now have a disaster at hand at the next<br/>difficulty adjustment.  As bitcoin production was 20% more than target,<br/>difficulty is adjusted upwards by 20%.  But the profit margin was only 10%, so<br/>for-profit-minters would now lose money if they continued minting.  They will<br/>therefore stop minting, and as they make up 99% of the minting capacity,<br/>generating the next 2016 blocks will take 100 times longer than normal.<br/>Everything that depends on block generation will slow to a crawl, and this<br/>slowness will persist for a very long time, since the next 2016 blocks will<br/>take 100 times longer to generate (almost 4 years rather than two weeks).<br/><br/>Now, if this was to happen, I guess a new client could be released that resets<br/>the difficulty to some sensible number and started using a better algorithm<br/>for difficulty adjustment.  But it would be much better to do it proactively<br/>before it becomes a problem (perhaps with a predetermined \"flag day\"<br/>activating the new algorithm at a certain time in the future, giving the new<br/>client a chance to propagate).<br/><br/>A simple(?) modification of the algorithm would be to apply the adjustment<br/>after a certain amount of time rather than at a certain block number.  The<br/>switch could still be synced to take effect for the next block, so time<br/>synchronization between clients would not need to be super exact to have the<br/>vast majority of them agree on when the new difficulty is to be applied.<br/><br/>Also, the difficulty adjustment should probably take into account the<br/>adjustments of the number of bitcoins minted per event (now 50, halved every 4<br/>years).  Halving the number of bitcoins generated each time is equivalent to<br/>doubling the difficulty as far as profitability is concerned, and such a<br/>drastical drop in profitability is unnecessary if it can be avoided easily.<br/>I'm not sure if the current adjustment algorithm already takes that into<br/>account somehow, but I couldn't see any obvious adjustment for it in the<br/>source code.<br/></div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9195#msg9195",
        "date": "August 14, 2010, 02:01:24 PM",
        "content": "<div class=\"post\">I think there is a limit to the amount that the difficulty can increase at each step.<br/><br/>The more the bitcoin network grows, the less likely it is to have large spikes in difficulty. The likelihood of a jump of that magnitude from a single entity is very unlikely. If that kind of jump does occur, it will more likely be from a large interested demographic discovering Bitcoin all at once, such as if it was featured in a major magazine. Bitcoin will cope with such increases and subsequent decreases just fine.<br/><br/>In the very unlikely event of blocks taking hours or days to be completed, the transaction fee feature would quickly be added back to the program and people would start including a ฿0.01 transaction fee with each transaction they sent. The mega-minter would have a modified client which would monitor how many bitcoins in transaction fees were available and once it was enough to be profitable, they would turn on their mega-hash-cruncher and you'd get your block within ten minutes on average.<br/><br/>It doesn't much matter whether minting is profitable or not. In not too many years, total transaction fees per block will be higher than new bitcoins per block.</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9209#msg9209",
        "date": "August 14, 2010, 03:14:44 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9195#msg9195\">Quote from: NewLibertyStandard on August 14, 2010, 02:01:24 PM</a></div><div class=\"quote\">I think there is a limit to the amount that the difficulty can increase at each step.<br/><br/>The more the bitcoin network grows, the less likely it is to have large spikes in difficulty. The likelihood of a jump of that magnitude from a single entity is very unlikely. If that kind of jump does occur, it will more likely be from a large interested demographic discovering Bitcoin all at once, such as if it was featured in a major magazine. Bitcoin will cope with such increases and subsequent decreases just fine.<br/></div><br/>There is a limit to the difficulty adjustment, but for upward adjustments it is 300% (factor of 4 between new and old) rather than the 20% in my scenario, so it wouldn't help.  <br/><br/>I would argue that a 20% difficulty adjustment is in no sense extreme - the last five adjustments were 44%, 35%, 300%, 93%, and 21%.  This hasn't been a problem up to now, but obviously not because a 20% adjustment would be too extreme, but more likely because it hasn't been enough to make minting unprofitable (or otherwise uninteresting).  My scenario does not assume that a single entity is responsible for a jump in difficulty - it is just as problematic if e.g. publicity makes minting 20% more popular at a time when the profit margin is less than 20%.  The extreme effects come from the proportion of minters who are unwilling to continue minting at a loss.  If this proportion is large while the profit margin is low, the system becomes very unstable.<br/><br/>Also, if I am right about the 4-year halving of bitcoins generated (i.e. that it <i>doesn't</i> affect the difficulty adjustment) such events alone would be equivalent to a 100% upward difficulty adjustment.  And it seems very reasonable to assume that most minters will have a lower profit margin than 100% in the future.<br/></div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9211#msg9211",
        "date": "August 14, 2010, 03:35:33 PM",
        "content": "<div class=\"post\">It's already not interesting to mint bitcoins. Also, for the average person, I think they're hardly profitable. Even if the average person can sell bitcoins at slightly above production costs, it's difficult to invest more than pocket change worth of electricity per day. Profit on pocket change in exchange for hearing your fan running full blast all day everyday is not very interesting to the average person. If there is a sudden spike in new users, they're not going to all show up at the beginning of a difficulty cycle, stay until the cycle until it's over and then all leave. Most will not last a week generating bitcoins on our already boring to generate network, so as all these flaky new users quit generating, we'll have half a week without them and half a week with them. Those that do stick around will help adjust difficulty back to what it should be.<br/><br/>And like I said about the worst case scenario, if we're going on a week without generating a block, then we start including some transaction fees and somebody from the community rents a cloud to get to the next adjustment.<br/><br/>In short, I don't think there's much anything to worry about. But you're welcome to go on worrying about it. <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/></div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "lachesis",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=237",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9223#msg9223",
        "date": "August 14, 2010, 05:38:45 PM",
        "content": "<div class=\"post\">The problem with your analysis is that you assume that all for-profit minters will have the same profit margin. They won't. Among other things, larger minters will have economies of scale in their favour, making them more profitable.<br/><br/>In addition, as Bitcoin grows, people will develop dedicated hardware that maximizes the khash/dollar spent. In addition, people will tune the software in more and more precise ways to squeeze slightly more khash/second out of the same hardware. The people who invest a large fixed cost to do that will receive a correspondingly lower variable cost per Bitcoin minted in return, so they'll be able to mint at price levels that would drive others out.<br/><br/>Finally, at the point that this becomes an issue, everyone will be including transaction fees with their transactions to incentivize minting.</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9232#msg9232",
        "date": "August 14, 2010, 06:34:23 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9211#msg9211\">Quote from: NewLibertyStandard on August 14, 2010, 03:35:33 PM</a></div><div class=\"quote\">It's already not interesting to mint bitcoins. Also, for the average person, I think they're hardly profitable.<br/></div><br/>Well, there might be an important psychological difference between being marginally profitable and by clearly losing money.  The range of efficiency in bitcoin minting is such that some people may be profitable at a difficulty level where most are clearly losing money.  If this happens, I suspect the share of nonprofit minting activity would dwindle quite quickly.  We are then in the unstable situation I warned about.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9211#msg9211\">Quote from: NewLibertyStandard on August 14, 2010, 03:35:33 PM</a></div><div class=\"quote\">In short, I don't think there's much anything to worry about. But you're welcome to go on worrying about it.  <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/><br/></div><br/>Of course I'm worrying - my entire bitcoin fortune (150 BC) is at stake here!  <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/></div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9235#msg9235",
        "date": "August 14, 2010, 06:53:26 PM",
        "content": "<div class=\"post\">You ignore all kinds of things that help solve this.<br/><br/>Transaction fees will increase if blocks come more slowly because it will be more desirable to get your transactions in the next block.<br/><br/>If an entity calculates that (fixed costs + variable costs &lt; revenue) adjusted for risk the it is pretty unlikely that they will hit the (variable costs &gt; revenue) easily at all and that is the shutdown point.<br/><br/>These minters will usually have and use bitcoins themselves. This gives two extra incentives to operate at a \"loss\". They want their transactions to get processed, and they want to maintain bitcoin as a working system.</div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9243#msg9243",
        "date": "August 14, 2010, 07:30:43 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9223#msg9223\">Quote from: lachesis on August 14, 2010, 05:38:45 PM</a></div><div class=\"quote\">The problem with your analysis is that you assume that all for-profit minters will have the same profit margin. They won't. Among other things, larger minters will have economies of scale in their favour, making them more profitable.<br/></div><br/>Actually, I was not assuming that.  In the scenario, the profit margin of 10% was the typical profit margin, by which I meant that most of the minting was done by players with a profit margin around 10%.  The scenario assumed the fluctuation in minting activity to be 20%, so it allows quite a lot of variance around the 10% mean without affecting the outcome as long as the bulk is within the 0%-20% interval (and the bulk cannot very well be <i>above</i> 20% - then the typical profit margin would not be 10%).<br/><br/>Regarding the effect of transaction fees, they may alleviate the problem somewhat, but at an unnecessary cost.  There will be some balance between monetary costs and convenience costs, but avoiding the costs altogether seems preferable to me.</div>",
        "post_num": 8,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9246#msg9246",
        "date": "August 14, 2010, 07:45:42 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9243#msg9243\">Quote from: gebler on August 14, 2010, 07:30:43 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9223#msg9223\">Quote from: lachesis on August 14, 2010, 05:38:45 PM</a></div><div class=\"quote\">The problem with your analysis is that you assume that all for-profit minters will have the same profit margin. They won't. Among other things, larger minters will have economies of scale in their favour, making them more profitable.<br/></div><br/>Actually, I was not assuming that.  In the scenario, the profit margin of 10% was the typical profit margin, by which I meant that most of the minting was done by players with a profit margin around 10%.  The scenario assumed the fluctuation in minting activity to be 20%, so it allows quite a lot of variance around the 10% mean without affecting the outcome as long as the bulk is within the 0%-20% interval (and the bulk cannot very well be <i>above</i> 20% - then the typical profit margin would not be 10%).<br/><br/>Regarding the effect of transaction fees, they may alleviate the problem somewhat, but at an unnecessary cost.  There will be some balance between monetary costs and convenience costs, but avoiding the costs altogether seems preferable to me.<br/></div><br/>What if I had a factory and hired you as a consultant? Would you tell me avoiding costs altogether was the best thing? Many, many costs are worth it.<br/><br/>Having a secure, open, P2P, pseudonymous, limited quantity money, is worth a ton. People who agree will pay the .001BTC or whatever to make a transaction if that's about what it ends up costing.  </div>",
        "post_num": 9,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9249#msg9249",
        "date": "August 14, 2010, 08:06:01 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9246#msg9246\">Quote from: FreeMoney on August 14, 2010, 07:45:42 PM</a></div><div class=\"quote\">What if I had a factory and hired you as a consultant? Would you tell me avoiding costs altogether was the best thing? Many, many costs are worth it.<br/></div><br/>Sure, I just thought this was an unnecessary cost, best avoided by fixing the algorithm before it causes real problems and associated costs.  I understand that the 4x limit to the difficulty adjustment was added quite recently, so there is some precedent in fixing problematic aspects of the algorithm. </div>",
        "post_num": 10,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9254#msg9254",
        "date": "August 14, 2010, 08:21:51 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9249#msg9249\">Quote from: gebler on August 14, 2010, 08:06:01 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9246#msg9246\">Quote from: FreeMoney on August 14, 2010, 07:45:42 PM</a></div><div class=\"quote\">What if I had a factory and hired you as a consultant? Would you tell me avoiding costs altogether was the best thing? Many, many costs are worth it.<br/></div><br/>Sure, I just thought this was an unnecessary cost, best avoided by fixing the algorithm before it causes real problems and associated costs.  I understand that the 4x limit to the difficulty adjustment was added quite recently, so there is some precedent in fixing problematic aspects of the algorithm. <br/></div><br/>Really? Source?</div>",
        "post_num": 11,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9257#msg9257",
        "date": "August 14, 2010, 08:29:35 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9249#msg9249\">Quote from: gebler on August 14, 2010, 08:06:01 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9246#msg9246\">Quote from: FreeMoney on August 14, 2010, 07:45:42 PM</a></div><div class=\"quote\">What if I had a factory and hired you as a consultant? Would you tell me avoiding costs altogether was the best thing? Many, many costs are worth it.<br/></div><br/>Sure, I just thought this was an unnecessary cost, best avoided by fixing the algorithm before it causes real problems and associated costs.  I understand that the 4x limit to the difficulty adjustment was added quite recently, so there is some precedent in fixing problematic aspects of the algorithm. <br/></div>I'll bite.  <img alt=\"Grin\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/grin.gif\"/><br/><br/>How would you fix the algorithm?</div>",
        "post_num": 12,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9262#msg9262",
        "date": "August 14, 2010, 08:48:57 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9254#msg9254\">Quote from: FreeMoney on August 14, 2010, 08:21:51 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9249#msg9249\">Quote from: gebler on August 14, 2010, 08:06:01 PM</a></div><div class=\"quote\">I understand that the 4x limit to the difficulty adjustment was added quite recently, so there is some precedent in fixing problematic aspects of the algorithm. <br/></div><br/>Really? Source?<br/></div><br/>Sorry, I was wrong about that.  I though I had read something on the forum to that effect, but now I can't find it.  Looking at old sources, I see that the 4x cap was there as early as bitcoin-0.1.0.rar, so this is definitely not a new modification.</div>",
        "post_num": 13,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9263#msg9263",
        "date": "August 14, 2010, 08:50:12 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9262#msg9262\">Quote from: gebler on August 14, 2010, 08:48:57 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9254#msg9254\">Quote from: FreeMoney on August 14, 2010, 08:21:51 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9249#msg9249\">Quote from: gebler on August 14, 2010, 08:06:01 PM</a></div><div class=\"quote\">I understand that the 4x limit to the difficulty adjustment was added quite recently, so there is some precedent in fixing problematic aspects of the algorithm. <br/></div><br/>Really? Source?<br/></div><br/>Sorry, I was wrong about that.  I though I had read something on the forum to that effect, but now I can't find it.  Looking at old sources, I see that the 4x cap was there as early as bitcoin-0.1.0.rar, so this is definitely not a new modification.<br/></div><br/>I thought so, but still, some changes can be made. What is the change that solves this problem?</div>",
        "post_num": 14,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9265#msg9265",
        "date": "August 14, 2010, 08:51:14 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9257#msg9257\">Quote from: knightmb on August 14, 2010, 08:29:35 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9249#msg9249\">Quote from: gebler on August 14, 2010, 08:06:01 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9246#msg9246\">Quote from: FreeMoney on August 14, 2010, 07:45:42 PM</a></div><div class=\"quote\">What if I had a factory and hired you as a consultant? Would you tell me avoiding costs altogether was the best thing? Many, many costs are worth it.<br/></div><br/>Sure, I just thought this was an unnecessary cost, best avoided by fixing the algorithm before it causes real problems and associated costs.  I understand that the 4x limit to the difficulty adjustment was added quite recently, so there is some precedent in fixing problematic aspects of the algorithm. <br/></div>I'll bite.  <img alt=\"Grin\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/grin.gif\"/><br/><br/>How would you fix the algorithm?<br/></div><br/>It's in my original post:<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9186#msg9186\">Quote from: gebler on August 14, 2010, 12:43:54 PM</a></div><div class=\"quote\">A simple(?) modification of the algorithm would be to apply the adjustment after a certain amount of time rather than at a certain block number.  The switch could still be synced to take effect for the next block, so time synchronization between clients would not need to be super exact to have the vast majority of them agree on when the new difficulty is to be applied.<br/><br/>Also, the difficulty adjustment should probably take into account the adjustments of the number of bitcoins minted per event (now 50, halved every 4 years).  Halving the number of bitcoins generated each time is equivalent to doubling the difficulty as far as profitability is concerned, and such a drastical drop in profitability is unnecessary if it can be avoided easily. I'm not sure if the current adjustment algorithm already takes that into account somehow, but I couldn't see any obvious adjustment for it in the source code.<br/></div></div>",
        "post_num": 15,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9268#msg9268",
        "date": "August 14, 2010, 09:04:56 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9265#msg9265\">Quote from: gebler on August 14, 2010, 08:51:14 PM</a></div><div class=\"quote\">It's in my original post:<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9186#msg9186\">Quote from: gebler on August 14, 2010, 12:43:54 PM</a></div><div class=\"quote\">A simple(?) modification of the algorithm would be to apply the adjustment after a certain amount of time rather than at a certain block number.  The switch could still be synced to take effect for the next block, so time synchronization between clients would not need to be super exact to have the vast majority of them agree on when the new difficulty is to be applied.<br/><br/>Also, the difficulty adjustment should probably take into account the adjustments of the number of bitcoins minted per event (now 50, halved every 4 years).  Halving the number of bitcoins generated each time is equivalent to doubling the difficulty as far as profitability is concerned, and such a drastical drop in profitability is unnecessary if it can be avoided easily. I'm not sure if the current adjustment algorithm already takes that into account somehow, but I couldn't see any obvious adjustment for it in the source code.<br/></div></div>How will you account for latency and time hacking then?</div>",
        "post_num": 16,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9273#msg9273",
        "date": "August 14, 2010, 09:52:26 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9268#msg9268\">Quote from: knightmb on August 14, 2010, 09:04:56 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9265#msg9265\">Quote from: gebler on August 14, 2010, 08:51:14 PM</a></div><div class=\"quote\">It's in my original post:<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9186#msg9186\">Quote from: gebler on August 14, 2010, 12:43:54 PM</a></div><div class=\"quote\">A simple(?) modification of the algorithm would be to apply the adjustment after a certain amount of time rather than at a certain block number.  The switch could still be synced to take effect for the next block, so time synchronization between clients would not need to be super exact to have the vast majority of them agree on when the new difficulty is to be applied.<br/><br/>Also, the difficulty adjustment should probably take into account the adjustments of the number of bitcoins minted per event (now 50, halved every 4 years).  Halving the number of bitcoins generated each time is equivalent to doubling the difficulty as far as profitability is concerned, and such a drastical drop in profitability is unnecessary if it can be avoided easily. I'm not sure if the current adjustment algorithm already takes that into account somehow, but I couldn't see any obvious adjustment for it in the source code.<br/></div></div>How will you account for latency and time hacking then?<br/></div><br/>Could you elaborate on what kind of scenarios you see where the proposed algorithm would be more vulnerable than the current one? Note that the current algorithm also uses wallclock time in the difficulty adjustment calculation and is synchronized using newly generated blocks.</div>",
        "post_num": 17,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "GoldRush",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=681",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9285#msg9285",
        "date": "August 14, 2010, 10:49:33 PM",
        "content": "<div class=\"post\">You greatly under estimate the power of the profit motive and a market.  Bitcoins will continue to be generated as people find more clever ways to reduce hardware and power costs.  A lot of people are generating them at zero cost by using their employer's computer.  It's unfair to the employer, but it is the reason why bitcoins will continue to generate.  The current algorithm for difficulty is fine the way it is.<br/><br/>But let's assume you are correct and people stop generating bitcoins early.  So what?  There will always be a market price for the remaining bitcoins.<br/><br/></div>",
        "post_num": 18,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9308#msg9308",
        "date": "August 15, 2010, 12:35:24 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9285#msg9285\">Quote from: trebronics on August 14, 2010, 10:49:33 PM</a></div><div class=\"quote\">But let's assume you are correct and people stop generating bitcoins early.  So what?  There will always be a market price for the remaining bitcoins.</div>Transactions are verified by generating blocks, so although I don't think it will happen, blocks being too difficult to generate would cause the economy to grind to a halt.</div>",
        "post_num": 19,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "GoldRush",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=681",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9334#msg9334",
        "date": "August 15, 2010, 02:01:17 AM",
        "content": "<div class=\"post\">Why would it \"grind to a halt\"?  Economies don't function just because money is being printed.  Are you using the same argument for the US dollar and assuming our \"economy would grind to a halt\" if the government didn't print more dollars?  Of course not.<br/></div>",
        "post_num": 20,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "theymos",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=35",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9337#msg9337",
        "date": "August 15, 2010, 02:15:12 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9334#msg9334\">Quote from: trebronics on August 15, 2010, 02:01:17 AM</a></div><div class=\"quote\">Why would it \"grind to a halt\"?  Economies don't function just because money is being printed.  Are you using the same argument for the US dollar and assuming our \"economy would grind to a halt\" if the government didn't print more dollars?  Of course not.<br/></div><br/>Blocks are used to verify transactions. For example, Bitcoin Market requires two confirmations. If a block takes two hours to make, then it would take four hours to put Bitcoins into Bitcoin Market. This would not be good.<br/><br/>When people start adding transaction fees, the value of the current block will steadily rise until it is solved. If this gets very high, everyone will attempt to \"win the jackpot\". The market will solve the problem.<br/><br/>Botnets will probably be supporting Bitcoin in the future, so it doesn't really matter anyway.</div>",
        "post_num": 21,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "gebler",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=661",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9408#msg9408",
        "date": "August 15, 2010, 08:31:16 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=813.msg9285#msg9285\">Quote from: trebronics on August 14, 2010, 10:49:33 PM</a></div><div class=\"quote\">A lot of people are generating them at zero cost by using their employer's computer.  It's unfair to the employer, but it is the reason why bitcoins will continue to generate.<br/></div><br/>This is a good point.  I don't think I underestimated people's ability to generate bitcoins efficiently and <i>legitimately</i> - the difficulty adjustment does a good job of compensating for that, and that makes it a non-issue in my scenario.  But I probably underestimated the effect of minters using other people's resources without their knowledge and consent.  The FAQ theorizes that the cost of minting will approach the price of electricity minus a thin profit margin, and I probably accepted that theory too uncritically. If resource theft becomes the primary way to finance bitcoin minting, flaws in the difficulty adjustment will have a more subtle impact.  </div>",
        "post_num": 22,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 182,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Potential disaster scenario",
        "url": "https://bitcointalk.org/index.php?topic=813.msg9454#msg9454",
        "date": "August 15, 2010, 04:37:16 PM",
        "content": "<div class=\"post\">Some places where generation will gravitate to:<br/>1) places where it's cheapest or free<br/>2) people who want to help for idealogical reasons<br/>3) people who want to get some coins without the inconvenience of doing a transaction to buy them<br/><br/>There are legitimate places where it's free.  Generation is basically free anywhere that has electric heat, since your computer's heat is offsetting your baseboard electric heating.  Many small flats have electric heat out of convenience.<br/><br/>How expensive is heating oil?  With the price of oil so high, if it's actually more expensive than electric, then generating would have negative cost.<br/><br/>There's also kids putting it on their parent's power bill, employees their employer, botnets, etc.<br/><br/>Case 3 comes into play for small amounts.  The overhead of doing an exchange doesn't make sense if you just need a small bit of pocket change for incidental micropayments.  I think this is a nice advantage vs fiat currency, instead of all the seigniorage going to one big entity, let it go in convenience amounts to people who need to scrape up a small amount of change.<br/></div>",
        "post_num": 23,
        "is_displayed": true,
        "nested_level": 0
    }
]