[
    {
        "thread_id": 137,
        "name": "xc",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=40",
        "subject": "Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg5984#msg5984",
        "date": "July 27, 2010, 02:09:27 AM",
        "content": "<div class=\"post\"><b><span style=\"text-decoration: underline;\">The Money Regression and Emergence of Money from the Barter Economy</span></b><br/>The entire purpose of the regression theorem was to help explain an apparent paradox of money: how does money have value as a medium of exchange if it is valued because it serves as a medium of exchange?  Menger and Mises helped break this apparent circularity by explaining the essential time component missing from the phrasing of the paradox.<br/><br/>As Rothbard explains in Man, Economy, and State (p 270), <br/><span style=\"font-size: 8pt !important; line-height: 1.3em;\">\"...a money price at the <i>end </i>of day X is determined by the marginal utilities of money and the good as they existed at the <i>beginning </i>of day X. But the marginal utility of money is based, as we have seen above, on a <i>previously existing array of money prices</i>. Money is demanded and considered useful because of its already existing money prices. Therefore, the price of a good on day X is determined by the marginal utility of the good on day X and the marginal utility of money on day X, which last in turn depends on the prices of goods on day X \u0096 1. <b>The economic analysis of money prices is therefore not circular. If prices today depend on the marginal utility of money today, the latter is dependent on money prices yesterday.</b>\" [all emphasis added] <br/></span><br/>Rothbard then goes on to explain that in order for money to emerge from a <i><b>barter</b></i> economy, it must have a preexisting commodity value.  This commodity value arises from barter demand for the potential money in <b>direct consumption</b> (i.e. ornamentation).  This value <i><b>seeds</b></i> future estimations of the value of the money as a medium of exchange.  The natural market emergence of money is thus fully explained.<br/><br/><b><span style=\"text-decoration: underline;\">The Monetary Economy</span></b><br/>However, once an economy has been monetized and a memory of price ratios for goods and services has been established, a money may lose its direct commodity value and still be used as a money (medium of indirect exchange).  Rothbard explains (p 275):<br/><span style=\"font-size: 8pt !important; line-height: 1.3em;\">\"On the other hand, it does not follow from this analysis that if an extant money were to lose its direct uses, it could no longer be used as money. Thus, if gold, after being established as money, were suddenly to lose its value in ornaments or industrial uses, it would not necessarily lose its character as a money. Once a medium of exchange has been established as a money, <b>money prices continue to be set</b>. If on day X gold loses its direct uses, there will still be previously existing money prices that had been established on day X \u0096 1, and these prices form the basis for the marginal utility of gold on day X. Similarly, the money prices thereby determined on day X form the basis for the marginal utility of money on day X + 1. From X on, gold could be demanded for its exchange value alone, and not at all for its direct use. Therefore, while it is absolutely necessary that a money <b>originate as a commodity</b> with direct uses, it is not absolutely necessary that the direct uses continue after the money has been established.\"</span><br/><br/>This explains the history of fiat currencies.  They originally started off as simple names for weights of commodity money (silver) that developed out of the pre-monetary barter economy.  Despite later losing their ties to direct commodity value through state interference, paper currency retained status as money because of <span style=\"text-decoration: underline;\"><b>memory of previous money prices</b></span>.  This factor is so strong that the relationship between gold and the USD, for example, is somewhat inverted.  Gold no longer circulates as a common medium of exchange.   Prices are set in USD, not in gold.  Most individuals wishing to trade in gold do so based on their knowledge of USD/gold price ratios.  (\"Hey, let me buy that $100 couch from you in gold?\"  \"Ok, USD/gold is $1000/oz. Give me 1/10oz of gold.\")  Legal tender laws, state taxation, and the entire financial regulatory environment maintain this inertia of USD prices and make it challenging to return to gold money directly, despite the destructive inflationary nature of fiat currencies.<br/><br/><span style=\"text-decoration: underline;\"><b>The Emergence of the Bitcoin Economy</b></span><br/>The very first businesses in the Bitcoin economy were exchangers (NewLibertyStandard, BitcoinMarket, BitcoinExchange,....).  This is not an accident, but flows from the analysis above.  In order for Bitcoins to serve as a medium of exchange without commodity value for uses besides indirect exchange, there must be a translated knowledge of money prices.  Market exchangers fill this gap and give Bitcoin users access to this knowledge.  Bitcoins may therefore currently serve as a money intermediary for paypal dollars\\pecunix\\euros.  But why is there demand for Bitcoin over USD??  This is a subjective valuation arising from properties such as anonymity, decentralized system of clearance, cryptographic trust, predetermined and defined rate of growth, built in deflation, divisibility, low transaction fees, etc.... inherent to the Bitcoin system.<br/><br/>The essential point is that once exchange can occur between a money (USD) and Bitcoins, providers of goods have a means by which to value Bitcoins as a potential medium of exchange.  The money regression is satisfied, because taken back far enough we reach traditional commodity money: BITCOINS -&gt; USD -&gt; MONETIZED GOLD &amp; SILVER [start monetary economy] -&gt; [end barter economy] COMMODITY GOLD &amp; SILVER.  <br/><br/>Of course, if a major meltdown occurred and knowledge of all price ratios was wiped out, Bitcoin probably would NOT directly emerge as a money (assuming Bitcoins have limited value outside of exchange).  Fiat currencies with zero direct barter value certainly would not.  Commodities such as gold and silver that have widely recognized direct value in barter would likely emerge first.  The economy would then be monetized with price ratios in gold and silver.  Bitcoins then, being valued for intrinsic properties amenable to exchange, might then become prevalent in trade.  Initially, creators of value would continue to make their price value ratios in terms of the true money (gold oz/BTC ratio), but with time Bitcoin prices (BTC) can emerge (see vekja.net as example).  We are in this initial phase now.  <br/><br/>Therefore, so long as exchange of BTC and USD/Euros/etc\u0085 occurs, knowledge of existing price ratios can be utilized in the Bitcoin economy.  In time as Bitcoins become increasingly marketable, these fiat&lt;-&gt;BTC price ratios will seed direct BTC price ratios.  The Bitcoin Economy thus emerges.  The Misean regression theorem is satisfied.<br/><br/>XC<br/><br/>edit: clarified possibility of direct emergence of bitcoin as money from barter economy.</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "kiba",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=491",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg5997#msg5997",
        "date": "July 27, 2010, 04:05:16 AM",
        "content": "<div class=\"post\">YOU WIN 20 BTC!  <img alt=\"Grin\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/grin.gif\"/><br/><br/>Now all I need is your address for you to claim Kiba's AWESOME POST prize.<br/><br/>Edit: got it.</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg6001#msg6001",
        "date": "July 27, 2010, 04:26:34 AM",
        "content": "<div class=\"post\">Yes, quite an impressive analysis! Alas I have no coins to send.<br/><br/>Why is there no PPC build for the Mac? I really need new hardware.</div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "Anonymous",
        "poster_url": null,
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg6015#msg6015",
        "date": "July 27, 2010, 10:01:16 AM",
        "content": "<div class=\"post\">Excellent economic breakdown.<br/><br/>A hash cookie for you!</div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "joechip",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=397",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg6065#msg6065",
        "date": "July 27, 2010, 06:06:28 PM",
        "content": "<div class=\"post\">Excellent breakdown.  That helps satisfy my worries about the process by which one type of money can supplant another.  I have not read Man, Economy and State (though I really should) and therefore, missed that portion of Rothbard's analysis.  <br/><br/>Thanks again.<br/><br/>Ta,</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "hugolp",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=183",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg7839#msg7839",
        "date": "August 06, 2010, 11:39:14 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=583.msg5984#msg5984\">Quote from: xc on July 27, 2010, 02:09:27 AM</a></div><div class=\"quote\">But why is there demand for Bitcoin over USD??  This is a subjective valuation arising from properties such as anonymity, decentralized system of clearance, cryptographic trust, predetermined and defined rate of growth, built in deflation, divisibility, low transaction fees, etc.... inherent to the Bitcoin system.</div><br/>Exactly this. Bitcoins have value because they offer some qualities, and some people value them. Also, I would add ideological value.</div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "Anonymous",
        "poster_url": null,
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg8042#msg8042",
        "date": "August 07, 2010, 03:14:25 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=583.msg7839#msg7839\">Quote from: hugolp on August 06, 2010, 11:39:14 AM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=583.msg5984#msg5984\">Quote from: xc on July 27, 2010, 02:09:27 AM</a></div><div class=\"quote\">But why is there demand for Bitcoin over USD??  This is a subjective valuation arising from properties such as anonymity, decentralized system of clearance, cryptographic trust, predetermined and defined rate of growth, built in deflation, divisibility, low transaction fees, etc.... inherent to the Bitcoin system.</div><br/>Exactly this. Bitcoins have value because they offer some qualities, and some people value them. Also, I would add ideological value.<br/></div><br/>What if someone wants to buy something and they dont want it showing on their credit card statement? Bitcoins are the ultimate thing for it. <img alt=\"Cheesy\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/cheesy.gif\"/></div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "aurelian",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=901",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg10552#msg10552",
        "date": "August 21, 2010, 06:24:31 AM",
        "content": "<div class=\"post\">The simpler answer is that Rothbard is wrong here.   Not a statement about Rothbard in general, but on this particular point he's off.  There need be no preexisting \"direct\" value for money, where the value of money itself is artificially deemed as of some second-class \"indirect\" sort.   The value of a commodity _as money_, because it more securely scarce (and portable, hard to steal, etc.) than an alternative commodity, is quite sufficient to make it valuable as money and thus to get it going as money.    Enabling exchange, i.e. lowering transaction costs, is a form of economically useful consumption just as much as satisfying hunger, decoration, or some other \"direct\" use is a form of economic consumption.    In the same way, a stock exchange doesn't have to satisfy your hunger or make a good decoration or have any other \"direct consumption\" value, it just has to be good at exchanging stocks.<br/><br/>This is well explained here (interestingly enough by the guy who originally came up with the bit gold idea):<br/><a href=\"http://szabo.best.vwh.net/shell.html\">http://szabo.best.vwh.net/shell.html</a></div>",
        "post_num": 8,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg10553#msg10553",
        "date": "August 21, 2010, 06:48:36 AM",
        "content": "<div class=\"post\">This might just be semantics. But I'd say that the \"pre-existing value\" was the expectation of some people that it would be a good money. </div>",
        "post_num": 9,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 137,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Bitcoin does NOT violate Mises' Regression Theorem",
        "url": "https://bitcointalk.org/index.php?topic=583.msg11405#msg11405",
        "date": "August 27, 2010, 05:32:07 PM",
        "content": "<div class=\"post\">As a thought experiment, imagine there was a base metal as scarce as gold but with the following properties:<br/>- boring grey in colour<br/>- not a good conductor of electricity<br/>- not particularly strong, but not ductile or easily malleable either<br/>- not useful for any practical or ornamental purpose<br/><br/>and one special, magical property:<br/>- can be transported over a communications channel<br/><br/>If it somehow acquired any value at all for whatever reason, then anyone wanting to transfer wealth over a long distance could buy some, transmit it, and have the recipient sell it.<br/><br/>Maybe it could get an initial value circularly as you've suggested, by people foreseeing its potential usefulness for exchange.  (I would definitely want some)  Maybe collectors, any random reason could spark it.<br/><br/>I think the traditional qualifications for money were written with the assumption that there are so many competing objects in the world that are scarce, an object with the automatic bootstrap of intrinsic value will surely win out over those without intrinsic value.  But if there were nothing in the world with intrinsic value that could be used as money, only scarce but no intrinsic value, I think people would still take up something.<br/><br/>(I'm using the word scarce here to only mean limited potential supply)<br/></div>",
        "post_num": 10,
        "is_displayed": true,
        "nested_level": 0
    }
]