[
    {
        "thread_id": 42,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Idea for file hosting and proxy services",
        "url": "https://bitcointalk.org/index.php?topic=83.msg719#msg719",
        "date": "March 15, 2010, 07:16:56 PM",
        "content": "<div class=\"post\">When you want to upload an image to embed in a forum post, there are services like imageshack, but because they're free, they limit the number of views.  It's a minuscule amount of bandwidth cost, but they can't just give it away for free, there has to be something in it for them.  It would be nice to be able to pay for the bandwidth and avoid the limits, but conventional payments are too inconvenient for such a minor thing.<br/><br/>It's worse if you want to upload a file for others to download.  There are services like rapidshare, but they require the downloaders to go through extra steps and delays to make them look at advertising or encourage upgrading to a paid subscription, and they limit it to 10 or so downloads.<br/><br/>It would be nice if we made some free PHP code for an image and file hosting service that charges Bitcoins.  Anyone with some extra bandwidth quota could throw it on their webserver and run it.  Users could finally pay the minor fee to cover bandwidth cost and avoid the limits and hassles.  Ideally, it should be MIT license or public domain.<br/><br/>Services like this would be great for anonymous users, who have trouble paying for things.</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 42,
        "name": "BitcoinFX",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=30",
        "subject": "Re: Idea for file hosting service",
        "url": "https://bitcointalk.org/index.php?topic=83.msg728#msg728",
        "date": "March 16, 2010, 10:17:55 AM",
        "content": "<div class=\"post\">Good idea.<br/><br/>I'll eventually be setting up a 'one hop', SSL, http, login protected proxy service (similar to the 1st Psiphon project) and accepting bitcoins as payment.<br/><br/>I'm UK based so it will be good for using BBC iplayer etc. <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/> I will be giving bitcoin users priority service, as well as users from 'restricted' countries.<br/><br/>I doubt I'll have the spare bandwidth for a file hosting service though, maybe.</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 42,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Idea for file hosting service",
        "url": "https://bitcointalk.org/index.php?topic=83.msg731#msg731",
        "date": "March 16, 2010, 08:17:34 PM",
        "content": "<div class=\"post\">That's a great idea.  There's a thriving business in those services, but I've always thought the standard payment methods are at odds with privacy minded customers.<br/><br/>Would you consider making your software freely available so anyone could easily set one up?  I know for competitive reasons the inclination is to keep it to yourself, but it could get an order of magnitude more use if anyone could give proxy access to their country just by putting the software on a server.<br/><br/>I wonder if there are other kinds of web application servers where we would only have to tack on the payment mechanism to an already existing system?<br/></div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 42,
        "name": "dwdollar",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=24",
        "subject": "Re: Idea for file hosting service",
        "url": "https://bitcointalk.org/index.php?topic=83.msg751#msg751",
        "date": "March 18, 2010, 12:22:04 PM",
        "content": "<div class=\"post\">There are a ton of Python options for web frameworks.  I'm in the process of learning CherryPy, and I'm new to web development, so it's slow going.  Looks like they have an example for basic uploading.  Something in PHP would probably be best for the community though.  Are there any Python people here?</div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 42,
        "name": "BitcoinFX",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=30",
        "subject": "Re: Idea for file hosting service",
        "url": "https://bitcointalk.org/index.php?topic=83.msg752#msg752",
        "date": "March 18, 2010, 02:36:50 PM",
        "content": "<div class=\"post\">Yes. Any built proxy implementation would be open source and automated bitcoin payments would be great.<br/><br/>I will post the psiphon info. and links because the project has just moved from v1 to v2 and the implementations are very different.<br/><br/>Psiphon is a free 'circumvention' tool and should remain so. However, I've run a private and personally updated / secured 1.6 version and do accept 'token' donations from some of my users.<br/><br/>\"Psiphon is a web proxy designed to help Internet users securely bypass the content-filtering systems used to censor the internet. Psiphon was developed by the Citizen Lab at the University of Toronto.<br/><br/>License: GNU General Public License<br/>Source code: <a href=\"http://psiphon.ca/download/psiphon-src-1.6.tar.gz\">http://psiphon.ca/download/psiphon-src-1.6.tar.gz</a><br/><br/><a href=\"http://wikipedia.org/wiki/Psiphon\">http://wikipedia.org/wiki/Psiphon</a><br/><br/><a href=\"http://psiphon.ca/\">http://psiphon.ca/</a><br/><br/><a href=\"https://launchpad.net/psiphon\">https://launchpad.net/psiphon</a><br/><br/>Psiphon is a user-friendly, simple to administer, web-based proxy application. It allows users in regions with unrestricted Internet access to provide access to denied content to their friends, family, and associates in regions with restricted access.<br/><br/>Please contact the project leader if you're interested in helping us take Psiphon forward.<br/><br/>NOTE: The Psiphon 1.x and 2.x series are essentially different products with different architectures. Psiphon 1.x is a light-weight web proxy designed to run on a home PC (MS Windows-based) with no central management component. With Psiphon 1.x, a user asks a friend to run a proxy and can then access blocked sites via his or her friend's Internet connection. The Psiphon 1.x source code is available here: <a href=\"https://code.launchpad.net/~psiphon-inc/psiphon/psiphon-1.6\">https://code.launchpad.net/~psiphon-inc/psiphon/psiphon-1.6</a>.<br/><br/>The new project is Psiphon 2.x, a centrally managed web proxy system deployed by Psiphon Inc. to provide censorship circumvention services.\"<br/><br/><br/>Great source code here in reference to designing and building our own separate bitcoin style implementation. I'd grab the 1.6.tar.gz for your reference satoshi, before it becomes to 'historical'. It's also not that easy to compile the 1.6 version on Linux anymore.<br/><br/>The 1.6 Win32 version has now been removed from the original project website. I actually run my existing proxy service on a windows box, with additional security. I have the msi and documentation if anyone can't find it elsewhere or would like it for reference etc. I keep it up-to-date and secure from the following sources;<br/><br/>SSL - <a href=\"http://www.slproweb.com/products/Win32OpenSSL.html\">http://www.slproweb.com/products/Win32OpenSSL.html</a><br/><br/>Visual C++ 2008 Redistributables for msvcpXX.dll and msvcrXX.dll<br/><br/><a href=\"http://www.sqlite.org/download.html\">http://www.sqlite.org/download.html</a><br/><br/>Precompiled Binaries For Windows for sqlite3.dll<br/><br/><br/>Java and some flash support is always an issue though !<br/><br/>I would be happy to work on and share contributions for a 'bitcoin' proxy software, but have limited time and developer experience myself. Maybe you should contact the psiphon developers for a separate v1.6 style implementation yourself satoshi ?<br/><br/>I understand that the Tor project is also looking for a payment / incentive system for it's server operators. <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/><br/><br/>Could you change the thread title to \"Re: Idea for file hosting and proxy services\". Thanks.<br/><br/>Regards,<br/><br/>BitcoinFX</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 42,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Idea for file hosting and proxy services",
        "url": "https://bitcointalk.org/index.php?topic=83.msg809#msg809",
        "date": "March 24, 2010, 06:01:57 PM",
        "content": "<div class=\"post\">Title changed.<br/><br/>It helps that we have someone with actual experience running a proxy service.  Do you think Psiphon is the best one currently?  (sometimes the one you run was the best when you started but you found better ones later)</div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 42,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Idea for file hosting and proxy services",
        "url": "https://bitcointalk.org/index.php?topic=83.msg810#msg810",
        "date": "March 24, 2010, 06:02:55 PM",
        "content": "<div class=\"post\">Mihalism Multi Host is a popular open source PHP file hosting server.<br/><br/>It's geared toward image hosting, but I think by increasing the file size limit and liberalising the allowed file extensions, it could just as easily be used for general file upload hosting.  They need the limits to keep it reasonable as a free service, but if we bolt on a Bitcoin payment mechanism, the limits could be relaxed.<br/><br/>It doesn't have a bunch of client side scripting or anti-embedding junk to rip out.  It generates standard links that work normally.<br/><br/>There's a turnover churn in these free hosting sites.  Small sites can give free image hosting, but once one starts getting popular, it gets too swamped with moochers using them for free bandwidth.  Any site that gets well known has to become more aggressively pay-naggy to cover bandwidth costs.  It's a perfect example of a service where the needed price point is in the no-man's-land between just a little too expensive to be free, but too cheap for most users to take the trouble of a conventional payment.  It's in the gap between 0 and 19.95.  The best they can do is try to maybe get 1 out of 1000 users to pay 9.95, but that has 999/1000 users treated like freeloaders.  It can't really be advertising supported because the images are embedded in other sites and downloaded without going to the hosting site.<br/><br/>An example of a site running the software:<br/><a href=\"http://www.imagez.ws/\">http://www.imagez.ws/</a><br/><br/>Forum:<br/><a href=\"http://www.mihalism.net/\">http://www.mihalism.net/</a><br/><br/>Download:<br/><a href=\"http://code.google.com/p/mihalismmh/\">http://code.google.com/p/mihalismmh/</a><br/><br/>What do you think?  If I made a Bitcoin payment integration for this, would anyone be interested in running it?  It might be the first fully automated service available to buy with Bitcoins.  The advantage it could offer over the free services is general file upload hosting of large files without making downloading users go to the upload site and jump through hoops.  It would give a normal link directly to the file.</div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    }
]