[
    {
        "thread_id": 82,
        "name": "theymos",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=35",
        "subject": "Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2025#msg2025",
        "date": "July 07, 2010, 04:54:44 PM",
        "content": "<div class=\"post\">The current BitCoin implementation is certainly better than using a credit card, but I wouldn't use it in environments requiring strong anonymity without a lot of changes.<br/><br/>The history of a coin is publicly available. Anyone can see the flow of BitCoins from address to address.<br/><br/><a href=\"http://img707.imageshack.us/i/unknownaddress.png/\"><img alt=\"\" border=\"0\" class=\"userimg\" src=\"https://ip.bitcointalk.org/?u=http%3A%2F%2Fimg707.imageshack.us%2Fimg707%2F317%2Funknownaddress.th.png&amp;t=589&amp;c=eaO-sQGLTbwtGA\"/></a><br/><br/>This becomes a problem when certain points in the \"transaction chain\" become known to the attacker. In the image below, the attacker controls both the source of Mr. Doe's BitCoins and the destination. Since Doe bought his coins using non-anonymous methods, he is easily identified. His identity is tied to an address in the transaction chain.<br/><br/><a href=\"http://img682.imageshack.us/i/known.png/\"><img alt=\"\" border=\"0\" class=\"userimg\" src=\"https://ip.bitcointalk.org/?u=http%3A%2F%2Fimg682.imageshack.us%2Fimg682%2F6671%2Fknown.th.png&amp;t=589&amp;c=aWYj6VV_LFnRdQ\"/></a><br/><br/>A more likely scenario is for your BitCoin balance to come from transactions made over insecure channels (email, this forum, etc.). If you're particularly careless, the destination can just Google all of the addresses in the transaction chain. Maybe he'll find that one of them is in your forum signature here.<br/><br/>I've thought of two ways to make this harder. The first is to randomly send your coins to new addresses that you've generated just for this purpose. The coins are still part of your balance, but it's impossible for an outsider to prove that you sent the coins to yourself instead of a real person. However, the transaction chain still has your identity in it. In a real investigation, you would be targeted for close examination because you either know (directly or indirectly) the real person who is under investigation, or you are that person.<br/><br/><a href=\"http://img692.imageshack.us/i/simplemix.png/\"><img alt=\"\" border=\"0\" class=\"userimg\" src=\"https://ip.bitcointalk.org/?u=http%3A%2F%2Fimg692.imageshack.us%2Fimg692%2F7418%2Fsimplemix.th.png&amp;t=589&amp;c=jWxI4SumT9BYnw\"/></a><br/><br/>The second way is for an external service to take the coins of many different people, mix them up, and send similar amounts back to those peoples' addresses. If the mixer keeps no logs of who gets which coins, any investigation must stop here.<br/><br/><a href=\"http://img293.imageshack.us/i/external.png/\"><img alt=\"\" border=\"0\" class=\"userimg\" src=\"https://ip.bitcointalk.org/?u=http%3A%2F%2Fimg293.imageshack.us%2Fimg293%2F3070%2Fexternal.th.png&amp;t=589&amp;c=uWGtC-5hroQjDA\"/></a><br/><br/>For maximum security, BitCoin should have the capability to automatically send coins through several external mixers. Assuming at least one of them doesn't keep logs (and all of them actually return your coins), this should keep you completely safe.<br/><br/>There's a problem with safely coordinating all of this. You want all of your coins to be mixed at least once, but keeping track of this in a database will ruin your plausible deniability. Probably you'd have to initially keep track, but then delete the database after all the coins have been made safe.<br/><br/>Unrelated to the chain issues above, BitCoin is vulnerable to network analysis. If an attacker can watch all of your incoming and outgoing traffic, he can easily see which transactions are yours. If the connection is unencrypted (as it is now), he can see when you broadcast a transaction that you didn't receive.<br/><br/>Even when encrypted (through Tor or a built-in mechanism), it's not impossible for an attacker to see which transactions are yours if he can see both ends of one of your connections to the BitCoin network.<br/><br/>Your transactions can be identified through Tor like this:<br/>1. The attacker fills the BitCoin network with IP addresses that he controls.<br/>2. When one of these \"evil nodes\" receives a packet, the attacker sees if it was received close to the time when he saw you send a packet. If this happens a few times, the attacker knows who you are and can see your transmissions to the network.<br/>3. When you send a transaction, the attacker knows it's yours if you send it without receiving a packet in a while.<br/><br/>To fix this, BitCoin should implement encryption, padding (to prevent any size-based identification), dummy packets, and randomization in sending times. Some plausible deniability could also be added if BitCoin could export and import transactions to/from a file (importing would broadcast the transaction to the network, while exporting would not). Then you could transmit this file in other ways (a flash drive, for example).<br/><br/>I also see two structural problems not related to anonymity:<br/>- If the network is segmented at the network layer (because the PoTUS executed his \"Internet kill switch\", for example), the block chain will be forked. This would be really bad.<br/>- It's very easy for an attacker with lots of IP addresses to fill the network with cancer nodes. I'm not sure how badly BitCoin could be affected by this.</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2026#msg2026",
        "date": "July 07, 2010, 05:57:36 PM",
        "content": "<div class=\"post\">Whatever mechanism is chosen, it had better not significantly slow down the network or client unless strong anonymity is required/requested.<br/><br/>I've tried I2P and Tor, and, for me, super-strong privacy isn't worth the performance cost.<br/><br/>Also, regarding forking the block chain by a network split:<br/><br/>It's only \"really bad\" if I can get away with double-spending some coins before the network merges again.<br/>If I'm buying valuable stuff, then the merchants will likely require 6 confirmations before releasing the goods, so I'd have to be able to keep the network split for an hour or more.<br/><br/>Merchants will likely have very-well-connected, long-running nodes.  For example, the Bitcoin Faucet has 66 connections right now.  If I wanted to try to implement a \"fork the block chain attack\" I'd have to somehow manage to insert my \"cancer nodes\" in between two merchants that I want to rip off (I'll end up ripping off one of the two, because eventually one of the two double-spend transactions will \"win\").<br/><br/>I don't know enough about network analysis to figure out how many cancer nodes you'd need to have a significant chance of getting in between two merchants with 60+ connections in a network of (say) 1,000 non-cancerous nodes, but I bet it is a very large number.<br/></div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "theymos",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=35",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2029#msg2029",
        "date": "July 07, 2010, 06:35:21 PM",
        "content": "<div class=\"post\">Everything I mentioned could be user-configurable, and most of it wouldn't slow down actual transactions. Even if you had all of these security features disabled, just having them implemented would give you plausible deniability in certain cases.<br/><br/>Block generation would be slowed in the case of a network split, so executing a double-spend would be even more difficult. I was thinking more of a problem like the Cogent-Level3 peering dispute, where there is no path between two ISPs for a long while. In this case, lots of transactions would be lost when the network is recombined and one of the chain's branches is discarded.</div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2030#msg2030",
        "date": "July 07, 2010, 06:41:56 PM",
        "content": "<div class=\"post\">Would the transactions on the other block chain be lost?<br/><br/>I thought they'd just be re-integrated into the new-best-chain (if they were valid), just starting with '1 confirmation' again...<br/></div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "theymos",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=35",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2031#msg2031",
        "date": "July 07, 2010, 06:53:04 PM",
        "content": "<div class=\"post\">I don't know how this is currently handled. It might already be fixed. I haven't looked at the source.</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "llama",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=270",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2034#msg2034",
        "date": "July 07, 2010, 07:28:05 PM",
        "content": "<div class=\"post\">Anonymity is not a feature that most users need.</div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2038#msg2038",
        "date": "July 07, 2010, 08:26:06 PM",
        "content": "<div class=\"post\">*Strong<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2034#msg2034\">Quote from: amallama on July 07, 2010, 07:28:05 PM</a></div><div class=\"quote\">Anonymity is not a feature that most users need.<br/></div></div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "llama",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=270",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2042#msg2042",
        "date": "July 07, 2010, 10:56:35 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2038#msg2038\">Quote from: NewLibertyStandard on July 07, 2010, 08:26:06 PM</a></div><div class=\"quote\">*Strong<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2034#msg2034\">Quote from: amallama on July 07, 2010, 07:28:05 PM</a></div><div class=\"quote\">Anonymity is not a feature that most users need.<br/></div></div><br/>That's my Steve Jobsian statement of the day <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/> <br/><br/>I'm not saying that it's not something worth working on, but we shouldn't prioritize anonymity features ahead of basic functionality, ease-of-use, and driving adoption.  There can always be a special implementation (maybe a separate client even) down the road that takes care of all of the features for ensuring anonymity.   As Gavin implied, many anonymity features would come at cost to users who don't need them.</div>",
        "post_num": 8,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "Bitcoiner",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=269",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2044#msg2044",
        "date": "July 07, 2010, 11:20:49 PM",
        "content": "<div class=\"post\">I don't know, I personally find it rather disconcerting if users in the chain can be identified. For example, it wouldn't be enough for me to simply get bitcoins at an exchange, send them to a random address, and then use them from that point on. Your identity would still be linked. However, given the public nature of the transactions, I'm not sure if there is any way around this.<br/><br/>I agree with you though, the software needs to be usable with a well-designed UI, and it needs to be robust. Bitcoin needs a full security audit to see how robust it is to different kinds of attacks, and what is compromised.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2042#msg2042\">Quote from: amallama on July 07, 2010, 10:56:35 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2038#msg2038\">Quote from: NewLibertyStandard on July 07, 2010, 08:26:06 PM</a></div><div class=\"quote\">*Strong<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2034#msg2034\">Quote from: amallama on July 07, 2010, 07:28:05 PM</a></div><div class=\"quote\">Anonymity is not a feature that most users need.<br/></div></div><br/>That's my Steve Jobsian statement of the day <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/> <br/><br/>I'm not saying that it's not something worth working on, but we shouldn't prioritize anonymity features ahead of basic functionality, ease-of-use, and driving adoption.  There can always be a special implementation (maybe a separate client even) down the road that takes care of all of the features for ensuring anonymity.   As Gavin implied, many anonymity features would come at cost to users who don't need them.<br/></div></div>",
        "post_num": 9,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2045#msg2045",
        "date": "July 08, 2010, 12:11:08 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=241.msg2044#msg2044\">Quote from: Bitcoiner on July 07, 2010, 11:20:49 PM</a></div><div class=\"quote\">I don't know, I personally find it rather disconcerting if users in the chain can be identified. For example, it wouldn't be enough for me to simply get bitcoins at an exchange, send them to a random address, and then use them from that point on. Your identity would still be linked. However, given the public nature of the transactions, I'm not sure if there is any way around this.<br/></div><br/>I'm sure somebody somewhere would/will be happy to sell you bitcoins anonymously; just put cash and a bitcoin receiving address in an envelope and mail it.  The exchange (who you'd have to trust to actually send you the coins) takes the cash and send coins to the address.  They have no idea who you are, and your identity isn't linked to the coins.<br/><br/>Well, it isn't linked to the coins until you forget to turn on TOR or I2P before spending coins on something illegal.  Or you remain completely and utterly anonymous right up until you spend coins on something physical and have it shipped to your home address.  Or you arrange to have contraband \"dead dropped\" somewhere, and you get arrested when you go to pick it up.<br/><br/>None of which have anything to do with Bitcoins, and all of which seem to me to be more likely ways of getting into trouble than somebody managing to figure out that \"transaction for purchase of illegal stuff\" is linked to \"Gavin purchased a bunch of Bitcoins from Bobby's Discount Bitcoin Emporium\" last year.<br/></div>",
        "post_num": 10,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2046#msg2046",
        "date": "July 08, 2010, 01:36:02 AM",
        "content": "<div class=\"post\">+1 to Previous Post by gavinandresen<br/><br/>Because Bitcoin transactions are not forced through the regulated banking system, bitcoins can range from being not at all anonymous if I announce my transactions on twitter, to being completely anonymous so long as I purchase anonymously, obfuscate ownership by transferring to one or more intermediary addresses and then spend them anonymously. There's nothing wrong with adding that obfuscation optionally, but it's overkill to apply it to all transactions because not everyone needs that level of anonymity and no matter how anonymous you make it, it's never going to be anonymous to the folks who voluntarily reveal their identity.</div>",
        "post_num": 11,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "Anonymous",
        "poster_url": null,
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2049#msg2049",
        "date": "July 08, 2010, 01:48:25 AM",
        "content": "<div class=\"post\">90% of money has cocaine on it. <img alt=\"Cheesy\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/cheesy.gif\"/><br/><br/></div>",
        "post_num": 12,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "Timo Y",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=271",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2056#msg2056",
        "date": "July 08, 2010, 12:59:21 PM",
        "content": "<div class=\"post\">Real life example<br/><br/>1) I set up a fresh Bitcoin address/Bitcoin Client in a VPS hosted in Panama, connected via Tor.<br/><br/>2) I purchase a 100 EUR paysafecard code at some newsagent in a big, densely populated city. I pay cash, and make sure the newsagent is 2 km away from my home.<br/><br/>3) I advertise the sale of the paysafecard code on this forum, via Tor and a free public wifi hotspot,  using a fresh username.<br/><br/>4) A buyer shows up. I send him my bitcoin address and the paysafecard code from a freshly set up webmail address, again via Tor and a free public wifi hotspot.<br/><br/><br/><br/>Using above precautions, it will be very difficult to link my physical identity to my bitcoin address. Not impossible, but difficult enough for my purposes. </div>",
        "post_num": 13,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "llama",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=270",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2057#msg2057",
        "date": "July 08, 2010, 04:37:01 PM",
        "content": "<div class=\"post\">Not bad. <br/><br/>As far as anonymous internet connections go, prepaid phones aren't a bad choice either.  They're cheap, nearly impossible to tie to the user, and can be destroyed when finished.  Again, they can be bought in densely crowded shopping malls or walmarts.<br/><br/>Dont forget to use an anonymous method to pay for the VPS foreverdamaged.  Perhaps a prepaid credit card also bought from a crowded location would do the trick.<br/><br/>By the way, I like to imagine that this user is in China and is trying to buy a book about freedom <img alt=\"Wink\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/wink.gif\"/></div>",
        "post_num": 14,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 82,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Anonymity",
        "url": "https://bitcointalk.org/index.php?topic=241.msg2071#msg2071",
        "date": "July 08, 2010, 07:12:00 PM",
        "content": "<div class=\"post\">It's hard to imagine the Internet getting segmented airtight.  It would have to be a country deliberately and totally cutting itself off from the rest of the world.<br/><br/>Any node with access to both sides would automatically flow the block chain over, such as someone getting around the blockade with a dial-up modem or sat-phone.  It would only take one node to do it.  Anyone who wants to keep doing business would be motivated.<br/><br/>If the network is segmented and then recombines, any transactions in the shorter fork that were not also in the longer fork are released into the transaction pool again and are eligible to get into future blocks.  Their number of confirmations would start over.<br/><br/>If anyone took advantage of the segmentation to double-spend, such that there are different spends of the same money on each side, then the double-spends in the shorter fork lose out and go to 0/unconfirmed and stay that way.<br/><br/>It wouldn't be easy to take advantage of the segmentation to double-spend.  If it's impossible to communicate from one side to the other, how are you going to put a spend on each side?  If there is a way, then probably someone else is also using it to flow the block chain over.<br/><br/>You would usually know whether you're in the smaller segment.  For example, if your country cuts itself off from the rest of the world, the rest of the world is the larger segment.  If you're in the smaller segment, you should assume nothing is confirmed.</div>",
        "post_num": 15,
        "is_displayed": true,
        "nested_level": 0
    }
]