[
    {
        "thread_id": 148,
        "name": "chaord",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=262",
        "subject": "Building initial transaction trust through \"coin ripping\"",
        "url": "https://bitcointalk.org/index.php?topic=635.msg6588#msg6588",
        "date": "July 30, 2010, 04:02:55 AM",
        "content": "<div class=\"post\">I'm certainly not a cryptographer by trade or anything so I'm not sure if this idea holds any water.  As I browse the forums I am noticing that perhaps one of the bigger issues when transacting with BC is building reputation between the transacting parties.  In particular, the very first transaction seems to be critical.<br/><br/>I'm wondering if a solution, similar to what Professor Markus Jakobsson proposed in his paper could work? See <a href=\"http://romualdogrillo.net/index.php?option=com_content&amp;view=article&amp;id=48&amp;Itemid=54\">http://romualdogrillo.net/index.php?option=com_content&amp;view=article&amp;id=48&amp;Itemid=54</a>   for an overview.  In a nutshell, the goal with \"coin ripping\" is similar to what could be done with traditional paper money.  <br/><ul style=\"margin-top: 0; margin-bottom: 0;\"><li>If A is going to perform $5 of service for B, they each can take out a $5 bill and rip them in half.</li><li>Now A and B would each have 2 halve's of a $5 bill, but neither would have the correct halves.</li><li>Therefore A is incentivized to actually perform the service for B, since this is the only way for him to receive both the missing half from his original $5bill back and the missing half of B's original $5 bill.</li><li>The result is a transfer of $5 to A from B (as originally planned) in exchange for service.<br/></li></ul>Of course, if A or B is a scammer, with this scenario both of them would lose.  In other words, it wouldn't pay to be a scammer.<br/><br/>I don't know if this is something that would qualify for design consideration, but if all transactions were \"ripped\" by default, it might set people's minds at ease.  Additionally, it could possibly be algorithmically implemented unlike a staffed escrow account.<br/><br/>What do you guys think?</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 148,
        "name": "xc",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=40",
        "subject": "Re: Building initial transaction trust through \"coin ripping\"",
        "url": "https://bitcointalk.org/index.php?topic=635.msg6592#msg6592",
        "date": "July 30, 2010, 04:43:12 AM",
        "content": "<div class=\"post\">That's very clever. Satoshi has implied that there is great flexibility in the way transactions could work: <a href=\"http://bitcointalk.org/index.php?topic=195.msg1611#msg1611\">http://bitcointalk.org/index.php?topic=195.msg1611#msg1611</a>. I think he may have had such ideas in mind.<br/><br/>In time, hopefully, numerous such arrangements can be used to fully develop the idea of 'smart' contracts (<a href=\"http://en.wikipedia.org/wiki/Smart_contracts\">http://en.wikipedia.org/wiki/Smart_contracts</a>). The current Bitcoin implementation already represents a working example of smart contracts: software encoded rules governing digital property. Rothbard in <i>Ethics of Liberty</i> talks about how powerful the simple penal bond was to medieval commerce (<a href=\"http://mises.org/rothbard/ethics/nineteen.asp\">http://mises.org/rothbard/ethics/nineteen.asp</a>). Given the right contract tools, the Bitcoin economy will be able to flourish without relying on the expense and ethical contradictions of state courts.<br/><br/>XC</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 148,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: Building initial transaction trust through \"coin ripping\"",
        "url": "https://bitcointalk.org/index.php?topic=635.msg6593#msg6593",
        "date": "July 30, 2010, 04:48:49 AM",
        "content": "<div class=\"post\">To make that work in bitcoin you would need to be able to create a private key that both of you know, but a public key that each of you only know *half* of. In the crypto sense of half, where there are two secrets that can be combined together mathematically to make a third secret.<br/><br/>You would both transfer 5 BTC to the bitcoin address matching the public key. Then neither could retrieve the coins until one surrendered his half to the other.<br/><br/>A proxy comes to mine, but that is cheating. If you used a proxy to generate the private key and split it, they would know the private key and in that case you might as well trust them to hold the money without splitting the key.<br/><br/>I don't know enough about how elliptic curve based keys are generated to propose an algorithm. But stranger things have happened in crypto than that. In some cases, you can do math with two unknown encrypted numbers and have and have the answer decrypt correctly.<br/><br/>Go figure.</div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 148,
        "name": "martin",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=310",
        "subject": "Re: Building initial transaction trust through \"coin ripping\"",
        "url": "https://bitcointalk.org/index.php?topic=635.msg6627#msg6627",
        "date": "July 30, 2010, 08:13:24 AM",
        "content": "<div class=\"post\">One possibility would be to ask a algorithmically selected node from the network as intermediary. It would be possible, I suspect, to make the system work in such a way that nobody can get the money unless the two parties and the intermediary cooperate (so the intermediary cannot steal the money)</div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 148,
        "name": "bytemaster",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=611",
        "subject": "Re: Building initial transaction trust through \"coin ripping\"",
        "url": "https://bitcointalk.org/index.php?topic=635.msg7374#msg7374",
        "date": "August 04, 2010, 12:17:33 AM",
        "content": "<div class=\"post\">I think that Red's idea is great if it can be properly designed. <br/><br/>The only problem with this whole procedure is that both parties are required to put up capital.   The one buying a service and the one performing the service both must put up cash.  Unfortunately the one providing the service is also putting up their service. </div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 148,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: Building initial transaction trust through \"coin ripping\"",
        "url": "https://bitcointalk.org/index.php?topic=635.msg7385#msg7385",
        "date": "August 04, 2010, 12:40:40 AM",
        "content": "<div class=\"post\">The software is designed to support things like this.  I was going to post details of the plans for Escrow, but since getting slashdotted I haven't had time.</div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    }
]