[
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7797#msg7797",
        "date": "August 06, 2010, 07:05:56 AM",
        "content": "<div class=\"post\">Hi bitcoin users<br/><br/>I found bitcoin yesterday, and I am really impressed by the idea of avoiding issuers/banks in a digital cash system.<br/><br/>However, I have one objection that I would like your view on.<br/><br/>That is the latency, or delay in a local transaction. Let us say that a payer and payee are located in the same city for example. I will claim, that they want a payment to go through<br/>with a delay not much slower than the latency of network connections. With an issuer and using local coins (a prefix, say, can be used to localize a server of the issuer), the transaction should be done and verified in 100 microseconds or less. With a global p2p network, it is necessary to have all nodes receive the transaction, do some calculations and send results back.<br/>It is not feasible,  with the speed of light as an upper limit, to do this faster than a second. As I understand it you actually use something like 10 minutes for one block, or even more for several block verifications. This means that verification of the absence of double spending is 10,000 or even tens of millions times too slow. This would get even worse in interplanetary trade of course.<br/><br/>The ideal payment system should be decentralized but also local, i.e., the verification of a local transaction must not have to wait for a light signal to travel to the other end of the \"universe\" and come back again. <br/><br/>Locality, in the sense describe here, is crucial, I will claim.<br/><br/>Sincerely,<br/><br/>Morten Krogh.</div>",
        "post_num": 1,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7801#msg7801",
        "date": "August 06, 2010, 07:35:55 AM",
        "content": "<div class=\"post\">Why is it crucial? <br/><br/>One system doesn't have to be used for all needs. If interstellar money is needed people will choose whatever is best for that, same if people need their money in less than a second.</div>",
        "post_num": 2,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "knightmb",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=345",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7806#msg7806",
        "date": "August 06, 2010, 08:04:38 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7797#msg7797\">Quote from: mkrogh on August 06, 2010, 07:05:56 AM</a></div><div class=\"quote\">It is not feasible,  with the speed of light as an upper limit, to do this faster than a second. As I understand it you actually use something like 10 minutes for one block, or even more for several block verifications. This means that verification of the absence of double spending is 10,000 or even tens of millions times too slow. This would get even worse in interplanetary trade of course.<br/></div><br/>It depends on your network layout. If you are using the entire public network, then yes you are depending on that time for the data to be processed by everyone else that is running a node. But, you don't have to do it that way. You can build a trusted node (like a server) and have your clients direct connect to it and let it do the fast verification for you.<br/><br/>It won't net you 20 confirmations in a few milliseconds, but it will help stop double-spending as long as you remain in control of that node because it knows what is being spent. The whole double-spending issue arises from trust. When you are comparing anonymous seller to anonymous buyer, the only \"middle man\" for trust is the entire swarm (hence confirmations that neither is cheating)<br/><br/>If you know you can trust your own node(s), then it reduces the likely-hood that double-spending will occur within your own trusted network. So if your example applied to an ATM like card for example, the bank (or whoever) would have all of those ATM machines networked to their own private node (or server) which would then further connect to the outside (Internet) for the rest of the transactions. So if you went to an ATM, withdrew 100 BTC (say the entire account only had that much), then moments later went to another ATM elsewhere and tried to withdraw that amount again, somewhere along that trusted chain would spot a double-spend attempt and basically report back no BTC left for that address.<br/><br/>The whole verification process is how you put the swarm to work, all those clients are examining if your transaction was valid or not, but you don't have to wait for them to transfer the coin around. You can spend the coin around in circles all day without a single transaction verification. It's only when double-spending occurs does the network correct for itself and fix the balances.<br/><br/>Banks already have this exact same problem. They all have their own networks that connect to other bank networks and it's just as easy to double-spend on their ATM as has been demonstrated at black-hat hacker conventions for probably 10+ years now. I remember reading about the issue back in 1997 because a lot of networks will still on dial-up then for banks and the latency issue was part of the attack because everyone had their own *database* that all had to inter-connect.<br/><br/>With bitcoin, everyone is the database and banker and guard at the same time, so while it's not perfect, it's actually a lot better than what banks are using. Have you ever noticed at an ATM they have about 20 \"network\" stickers for all the different banks and setups that the ATM has to be compatible with?</div>",
        "post_num": 3,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7807#msg7807",
        "date": "August 06, 2010, 08:08:10 AM",
        "content": "<div class=\"post\">OP, have you read the <a href=\"http://bitcointalk.org/index.php?topic=423.0\">Bitcoin snack machine thread</a>?</div>",
        "post_num": 4,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7840#msg7840",
        "date": "August 06, 2010, 11:48:30 AM",
        "content": "<div class=\"post\">FreeMoney, I think it is crucial to have fast local transactions. It is needed for many businesses and person to person payments.<br/>10 minutes or even 10 seconds is too slow. An extraterrestrial system was just an extreme example. <br/><br/>The most pressing problem, as I see it, is to get a digital cash system that makes it possible for people and small businesses to pay each other fast and without <br/>registration and supervision from a big company/government.<br/><br/>I read the thread about vending machines. There were no real solutions except companies that would monitor for double checking in a few seconds. I agree that would be possible, <br/>but we would lose the whole point of not having an issuer. This company needs to be trusted, it will break anonymity, and people need an account with that company.<br/><br/>What is wrong with the follwing \"standard\" system. A central bank/government issues a currency like today. It sets up servers around the world to validate transactions.<br/>People pay each other by means of a single verification with one of the centeal bank's servers. The speed issue is solved by coins having the location of the relevant server embedded in them. In worst case, the server would need to make long round trips to other severs, but in most cases the first server would know the answer already. The cental bank could have an algorithm for distributing coins around the network to optimise latency and server load. The wallet would have an algorithm for choosing the most local coins when making a payment. <br/>The wallet could also prepare by exchanging coins with the server. On your way to Europe, the wallet replaces \"American coins\" with European coins, such that payments will be fast in Europe. For the user, this is incredibly easy. It is anonymous, and it requires no agreements with any processing companies.<br/>Also, there could be many issuers of the same currency if so desired.<br/><br/>Bitcoin gets rid of the issuers, but instead introduces unacceptable slowness or a lot of middlemen like credit card companies/debit accounts etc. Satoshi's solution, on the vending machine thread, with a double spending checking company is still too slow, even though faster than a block, and this company needs an omnipresence on the network almost like <br/>an issuer. <br/><br/>But discarding speed, bitcoin seems extremely elegant. And of course there are uses for this kind of system. One could imagine many local bitcoin systems with an exchange between <br/>different currencies. That would work except that an attacker can take over a small currency.</div>",
        "post_num": 5,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7843#msg7843",
        "date": "August 06, 2010, 12:50:12 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7840#msg7840\">Quote from: mkrogh on August 06, 2010, 11:48:30 AM</a></div><div class=\"quote\">The most pressing problem, as I see it, is to get a digital cash system that makes it possible for people and small businesses to pay each other fast and without <br/>registration and supervision from a big company/government.<br/><br/>...<br/><br/>What is wrong with the follwing \"standard\" system. A central bank/government issues a currency like today. It sets up servers around the world to validate transactions.<br/></div><br/>So the solution to avoiding a big company/government regulation is a big company/government?<br/><br/>It is currently possible with Bitcoin to do transactions which are practically instant particularly if you do not fear some vast conspiracy to defraud you.<br/>If you really do have need of transactions faster than Bitcoin can offer, use a different system, but you will probably have to forgo some of the benefits that Bitcoin currently offers.<br/><br/><br/><br/></div>",
        "post_num": 6,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7850#msg7850",
        "date": "August 06, 2010, 02:00:10 PM",
        "content": "<div class=\"post\">No, my goal is not to avoid government involvement in the payment system, but to not have the government monitor every transaction. There is a difference.<br/><br/>The current bill/coin system works like that. The government/central bank issues the currency but they don't monitor individual cash payments.<br/>I think that is okay.<br/><br/>You claim that is possible to make almost instantaneous payments with bitcoin. How? That is what I thought everybody agreed upon was not possible. You need to wait for <br/>one or more blocks to be solved before you can trust a coin. That takes minutes. Even in the best case it is limited by propagation, with the speed of light, around the network which is slow. The only solution is to create another banking system on top of this. Bitcoin then becomes the backbone of an intebank transfer system, not what the population at large is using. <br/>   <br/>It is not just me that needs fast transactions. There is giant demand for fast transfers of digital cash from cell phone to cell phone, web shopping, stock trading etc.  <br/><br/>But, we might just have different expectations from a digital cash system. <br/><br/>Has anyone ever stated clearly what problem bitcoin is solving? It seems to solve the problem of payments that don't need to be fast. But who are the potential users of that beyond people who thinks it is theoretically interesting like people on this board. <br/><br/>Do people agree with me on this point: We still need another digital cash system, and that probably needs to be issuer based.</div>",
        "post_num": 7,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7855#msg7855",
        "date": "August 06, 2010, 02:30:50 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7850#msg7850\">Quote from: mkrogh on August 06, 2010, 02:00:10 PM</a></div><div class=\"quote\">No, my goal is not to avoid government involvement in the payment system, but to not have the government monitor every transaction. There is a difference.<br/><br/>The current bill/coin system works like that. The government/central bank issues the currency but they don't monitor individual cash payments.<br/>I think that is okay.<br/></div>Every transaction <b>is</b> monitored in the bitcoin system.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">You claim that is possible to make almost instantaneous payments with bitcoin. How? That is what I thought everybody agreed upon was not possible. You need to wait for <br/>one or more blocks to be solved before you can trust a coin.<br/></div>That is your requirement for trust, not mine. You can trust a transaction as soon as you see it if you like.<br/>And people are going to shop with those who will give them speedy transactions.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">That takes minutes. Even in the best case it is limited by propagation, with the speed of light, around the network which is slow. The only solution is to create another banking system on top of this. Bitcoin then becomes the backbone of an intebank transfer system, not what the population at large is using. <br/>   <br/>It is not just me that needs fast transactions. There is giant demand for fast transfers of digital cash from cell phone to cell phone, web shopping, stock trading etc.  <br/><br/>But, we might just have different expectations from a digital cash system. <br/></div>Clearly. <br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">Has anyone ever stated clearly what problem bitcoin is solving? It seems to solve the problem of payments that don't need to be fast. But who are the potential users of that beyond people who thinks it is theoretically interesting like people on this board. <br/></div>Anyone who currently uses PayPal for a start.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">Do people agree with me on this point: We still need another digital cash system, and that probably needs to be issuer based.<br/></div>I don't. But I'm just one person.<br/></div>",
        "post_num": 8,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7861#msg7861",
        "date": "August 06, 2010, 03:12:18 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7855#msg7855\">Quote from: Insti on August 06, 2010, 02:30:50 PM</a></div><div class=\"quote\">Every transaction <b>is</b> monitored in the bitcoin system.<br/></div><br/>But you can make it anonymous. Why are you bringing this up?This is a point, were I thought we agreed.<br/>When I said monitoring, I meant including identification of the payer and payee. <br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\"><br/>That is your requirement for trust, not mine. You can trust a transaction as soon as you see it if you like.<br/>And people are going to shop with those who will give them speedy transactions.<br/></div><br/>Yes, that is my requirement, and will be most others as well. You will see almost no companies that sell without a guarantee against double spending.<br/><br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">Anyone who currently uses PayPal for a start.<br/></div><br/>Most of those will prefer a fast issuer based system over a slow decentralized system, I will claim.<br/>But they might prefer bitcoin over paypal.</div>",
        "post_num": 9,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Insti",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=336",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7872#msg7872",
        "date": "August 06, 2010, 03:53:14 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7861#msg7861\">Quote from: mkrogh on August 06, 2010, 03:12:18 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7855#msg7855\">Quote from: Insti on August 06, 2010, 02:30:50 PM</a></div><div class=\"quote\">Every transaction <b>is</b> monitored in the bitcoin system.<br/></div><br/>But you can make it anonymous. Why are you bringing this up?This is a point, were I thought we agreed.<br/>When I said monitoring, I meant including identification of the payer and payee. <br/></div>Ok, when you said monitoring I thought you meant monitoring, so I was just pointing out that all the transactions were trackable in case you did not already understand this. Since it seems you do it's not a problem <img alt=\"Smiley\" border=\"0\" src=\"https://bitcointalk.org/Smileys/default/smiley.gif\"/><br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\"><div class=\"quoteheader\">Quote</div><div class=\"quote\">That is your requirement for trust, not mine. You can trust a transaction as soon as you see it if you like.<br/>And people are going to shop with those who will give them speedy transactions.<br/></div><br/>Yes, that is my requirement, and will be most others as well. You will see almost no companies that sell without a guarantee against double spending.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">Anyone who currently uses PayPal for a start.<br/></div><br/>Most of those will prefer a fast issuer based system over a slow decentralized system, I will claim.<br/>But they might prefer bitcoin over paypal.<br/></div><br/>It seems we have differing opinions on the way future will develop. Which is fine.<br/>It'll probably turn out nothing like either of us expect anyway.<br/><br/></div>",
        "post_num": 10,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7881#msg7881",
        "date": "August 06, 2010, 04:25:45 PM",
        "content": "<div class=\"post\">Yes, it might turn out very differently. No digital cash for the masses for instance. A giant banking cartel that bribes politicians to keep the current system. </div>",
        "post_num": 11,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7908#msg7908",
        "date": "August 06, 2010, 05:33:30 PM",
        "content": "<div class=\"post\">mkrogh: Yes, you are correct. <br/><br/>There is absolutely no requirement for there to be such latency in the bitcoin system. Nothing fundamental would change if the system were implemented with a block list that updated every 10 seconds, instead of every 10 minutes. It was just a design decision that could be changed without effecting monetary policy a bit.<br/><br/>In fact, there is no requirement their be a block list that updates in increments at all. The system would work fine if each transaction were validated one-by-one. In effect one transaction per block. That was a design decision to make networked consensus building easier.<br/><br/>However, when you say \"local transaction validation\" what you are grasping for is a truly distributed system, rather than a monolithic system made redundant. The current version of bitcoin is the latter. Each node does exactly the same work as every other node. Each redundantly checking every transaction. It is a system horribly wasteful of resources. And because it is so wasteful, generates latency as a waste product.<br/><br/>Bitcoin could be made into a truly distributed system by storing the transaction graph in a distributed hash table. This is the kind of magic that is behind most other P2P systems. In effect, each bitcoin address would be arbitrarily mapped to a smaller set of nodes that checked its transactions. In such a system, there is no need to broadcast global state to every machine. This takes huge amount of latency out without needing to change any of the desired behavior.<br/></div>",
        "post_num": 12,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "FreeMoney",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=381",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7915#msg7915",
        "date": "August 06, 2010, 05:45:32 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7861#msg7861\">Quote from: mkrogh on August 06, 2010, 03:12:18 PM</a></div><div class=\"quote\"> <br/>Yes, that is my requirement, and will be most others as well. You will see almost no companies that sell without a guarantee against double spending.<br/><br/></div><br/>Did you know about this? You don't need to wait for it to get in a block to have way better certainty than PP or checks.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=423.msg3819#msg3819\">Quote from: satoshi on July 17, 2010, 10:29:13 PM</a></div><div class=\"quote\">I believe it'll be possible for a payment processing company to provide as a service the rapid distribution of transactions with good-enough checking in something like 10 seconds or less.<br/><br/>The network nodes only accept the first version of a transaction they receive to incorporate into the block they're trying to generate.  When you broadcast a transaction, if someone else broadcasts a double-spend at the same time, it's a race to propagate to the most nodes first.  If one has a slight head start, it'll geometrically spread through the network faster and get most of the nodes.<br/><br/>A rough back-of-the-envelope example:<br/>1         0<br/>4         1<br/>16        4<br/>64        16<br/>80%      20%<br/><br/>So if a double-spend has to wait even a second, it has a huge disadvantage.<br/><br/>The payment processor has connections with many nodes.  When it gets a transaction, it blasts it out, and at the same time monitors the network for double-spends.  If it receives a double-spend on any of its many listening nodes, then it alerts that the transaction is bad.  A double-spent transaction wouldn't get very far without one of the listeners hearing it.  The double-spender would have to wait until the listening phase is over, but by then, the payment processor's broadcast has reached most nodes, or is so far ahead in propagating that the double-spender has no hope of grabbing a significant percentage of the remaining nodes.</div></div>",
        "post_num": 13,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7934#msg7934",
        "date": "August 06, 2010, 07:17:43 PM",
        "content": "<div class=\"post\">FreeMoney, yes I knew about that.<br/><br/>Red, very interesting. So, a set of transactions in bitcoin can actually be made local. But it must be possible to control where a transaction should be validated. That must be coin <br/>dependent because of double spending. So, if I understand, it must be possible, for any transaction, to choose which location the resulting coin should be validated in when that <br/>coin is used next time. A random choice would not be good enough. But, are there some problems with an attacker taking over a certain location. The global system had the strength that an attacker would be outworked by the sum of all other CPUs.<br/><br/>Red, can you elaborate more on such a distributed version of bitcoin. Is it described anywhere?<br/><br/>Cheers.</div>",
        "post_num": 14,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7940#msg7940",
        "date": "August 06, 2010, 07:36:12 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7908#msg7908\">Quote from: Red on August 06, 2010, 05:33:30 PM</a></div><div class=\"quote\">Bitcoin could be made into a truly distributed system by storing the transaction graph in a distributed hash table. This is the kind of magic that is behind most other P2P systems. In effect, each bitcoin address would be arbitrarily mapped to a smaller set of nodes that checked its transactions. In such a system, there is no need to broadcast global state to every machine. This takes huge amount of latency out without needing to change any of the desired behavior.<br/></div>Interesting idea.<br/><br/>So, lets see, I create a transaction to pay you (say) 100 of my newly minted bitcoins.<br/><br/>That'll be a transaction with two 50BTC TxIns (signed by me, pointing to two mature GENERATE transactions somewhere in the block chain) and one 100BTC TxOuts.<br/><br/>You want to make sure I haven't double-spent those TxIns, so instead of flooding the network with that transaction you find the hash of the two GENERATE transactions and send two queries down into the DHT network:  \"Hey, here's a transaction, tell me if it is valid.\"  They say \"yup\", and then... what?  Include it in any blocks they're lucky enough to generate?  Broadcast it to everybody (which'd be no better than the current scheme) or some subset of the DHT network (what subset?)?<br/><br/>How do you know that you won't get a different answer to \"is this transaction valid\" if you ask again in 10 minutes when the network topology might have changed?<br/><br/>I don't know much about DHT networks and how they manage to keep reliable information when nodes may be coming and going (or buggy or malicious).  How would it work?<br/><br/></div>",
        "post_num": 15,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7958#msg7958",
        "date": "August 06, 2010, 08:11:37 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7934#msg7934\">Quote from: mkrogh on August 06, 2010, 07:17:43 PM</a></div><div class=\"quote\">Red, very interesting. So, a set of transactions in bitcoin can actually be made local. But it must be possible to control where a transaction should be validated. <br/></div><br/>I think that you are getting lost in the choice of wording on this list.  Every bitcoin client, whether or not it is 'generating' or not, has a very recent copy of the entire block chain, and can check any new transactions against that block chain to see if those bitcoins were owned by the *address* that the other client claims he owns, at least up until the last block update.  I'm not saying local verification is implimented in the current client, but it's possible.  But that doesn't protect you from a concurrent double spend.  The distributed verification will add confidence in the validity of the transaction with each passing block, but it's not neccessary to perform a transfer.  Cash in person has similar problems, as the vendor can never be *certain* that the customer isn't passing off counterfit currency.  The risks of fraud are included in the costs of retail business, and if speed of transactions are paramount, the vendor can simply accept the results of his own client and take the risks that he might get burned.  Waiting for confirmation would help protect against fraud, but it's not a *requirement* for completion of a trade.  I would expect that smartphone clients would do this quick local verify by default, particularly when communicating with each other directly over ad-hoc wireless.<br/><br/>Also, the system doesn't even require that the receiving client be on the network at the time of the transfer.  You can send money to any address at any time, and their client could find out about it long after the transfer had been verified by the bitcoin network.</div>",
        "post_num": 16,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7959#msg7959",
        "date": "August 06, 2010, 08:15:31 PM",
        "content": "<div class=\"post\">Just agree to both use the same free online wallet before you make your trade. MyBitcoin.com offers instant transfers.</div>",
        "post_num": 17,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "mkrogh",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=696",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7982#msg7982",
        "date": "August 06, 2010, 09:38:46 PM",
        "content": "<div class=\"post\">creighto, I am only talking about verifying the absence of double spending. Of course, you can always receive a coin and just hope. That is clear. <br/><br/>I don't think that physical coins have this issue. Or gold. Firstly counterfeiting is really difficult, secondly \"bill verifiers or gold verifiers\" are local machines. If someone could <br/>counterfeit gold or coins in a way that no local machine could detect, then it would be the same. But no one can do that.<br/><br/>With bitcoin in the version I have seen (not red's), you cannot build a local machine that verifies it. I don't understand what red exactly is proposing.<br/><br/><br/>NewLibertyStandard, your suggestion is a bank, that the payer and the payee need an account with. I don't mind, but I don't think it is an answer to the issue of this thread.<br/><br/>What I see as the ideal solution has these properties.<br/><br/>1. You can participate by just having some software on your computer/phone.<br/>2. The coins are stored by yourself. A coin is a string of characters, no physical gold or so is involved. Encryption keys are fine if you can generate them yourself.<br/>3. No accounts or registrations with banks or governments are needed.<br/>4. Payments can be totally verified including double spending checks. Tiny probabilites can be ignored. But I mean tiny, not just reasonably small.<br/>5. If a person is traveling to a city, he (she) can prepare for the visit by exchanging coins. This exchange can be slow. After arriving to the city, the person can make fast payments <br/>to a person residing in that city. By fast payments, I mean payments that are completely validated in a time frame that does not depend on the total size of the coin system. In other words local trade should be possible, even if the digital cash system is used all over the world (or galaxy). The preparation before arrival is important here. Of course, many coins can not be verified, fast, against double spending by the payee, but there should exist some coins that can, given the location. And the payer can prepare before arrival by getting such coins.<br/>6. No issuer on whose honesty the system relies.   <br/><br/><br/>1-5 is possible with an issuer. The coins have a tag that denotes where double spending will be verified. The issuer keeps the information about those coins on their servers in that location. In other words, the issuer's distributed hash table follows some rules for what coins are stored where. And those rules are publicly available.<br/><br/>1,2,3,4,6 seems to be bitcoin if I understand correctly.<br/><br/>Does 1-6 exist. Is that what red is saying?</div>",
        "post_num": 18,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7986#msg7986",
        "date": "August 06, 2010, 09:56:38 PM",
        "content": "<div class=\"post\">In real life, bank wires take much much longer than ten minutes. Most traditional services which you see as instantaneous are actually not instantaneous. Credit card charges don't go through immediately, the funds are just reserved immediately and the retailer trusts the credit card company. Not to mention that charges can be challenged, which means the final transaction could take weeks. Real bitcoin transactions occur much more quickly than real traditional electronic money transfers. If you need instant transfers, then you just have to set up the same tricks which the traditional electronic currency market uses, and that is basically what I suggested.</div>",
        "post_num": 19,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg7995#msg7995",
        "date": "August 06, 2010, 10:27:03 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7982#msg7982\">Quote from: mkrogh on August 06, 2010, 09:38:46 PM</a></div><div class=\"quote\">creighto, I am only talking about verifying the absence of double spending. Of course, you can always receive a coin and just hope. That is clear. <br/><br/></div><br/><br/>There is more to it than just hoping.  For starters, you could already have an existing business relationship, and trust built between two parties due to honest prior trading.  <br/><br/><br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\"><br/>I don't think that physical coins have this issue. Or gold. Firstly counterfeiting is really difficult, secondly \"bill verifiers or gold verifiers\" are local machines. If someone could <br/>counterfeit gold or coins in a way that no local machine could detect, then it would be the same. But no one can do that.<br/><br/></div><br/><br/>Counterfeiting bitcoins is really difficult as well, and that is what a local blockchain check would protect you against.  It would also protect you against a double spend that wasn't concurrent, as if one guy backs up his wallet file and then spends his coins the night before and attempts to yank your chain.  It does not protect you against a professional criminal, but against the petty attempt.<br/><br/><br/>[/quote]<br/>With bitcoin in the version I have seen (not red's), you cannot build a local machine that verifies it. <br/>[/quote]<br/><br/><br/>I know from other threads that Red has a different understanding than I about how the system works.  Either or both of us could be wrong.  My understanding is that, at present, the clients attempt to announce a transfer and then wait for the collective to confirm the transfer via accepting the claim as valid in at least two blocks, after which point the network believes that you have valid bitcoins, therefore you do.<br/><br/>However, two clients can interact directly, in theory.<br/><br/>Imagine this picture...<br/><br/>You have a full client on your Iphone running in the background, and then there is a power failure.  You head down to the corner store, and find that the shopkeeper has put everything in the cooler on sale half price, cash or bitcoins only.  Your cellphone client connects with the shopkeeper's cell phone client over ad-hoc bluetooth.  Signs the transfer accouncement (there are no actual cryptocoins in your wallet, they exist only as a series of entries into an encrypted ledger we call the blockchain, more like writing a check than actual coins) over to the shopkeeper's address.  Shopkeeper's client can then (but does not have to) check his copy of the blockchain to verify that you actually owned said bitcoins at the time of his last blockchain update.  If it's good locally, he can assume that you are not trying to cheat him and accept the trade and you leave with your half priced milk.  This does not protect the shopkeeper from an intentional double spend, but you still had to have honestly owned the coins at one time in order to do this.  If you did not own the coins at the time the power went out, his client would have rejected the transfer.<br/><br/>This also means that the shopkeeper can only spend bitcoins that he had at the time of the power failure himself, since any new bitcoins that he receives will not yet be included in the blockchains of any other vendor, and any attempts by his client to transfer his unannounced coins will be rejected by the other clients.  All transfers will either be verified or rejected by the network within 30 minutes of network reconnection.<br/></div>",
        "post_num": 20,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8007#msg8007",
        "date": "August 06, 2010, 11:08:28 PM",
        "content": "<div class=\"post\">What I'm suggesting doesn't exist yet. There was related talk about similar issues on the thermodynamic perversity of generating blocks. If I have just one central node, the system could generate a transaction block in a fraction of a second. If you wanted, it could do this only once every ten minutes. But it wouldn't need any more than a fraction of a second of CPU time on a single processor.<br/><br/>The reason is purely related to consensus. <br/><br/>So if you had two nodes, you could have them both redundantly capture all transactions, and then in a fraction of a second each could generate a block. They could then exchange block hashes and if they matched, they would have consensus. If they didn't match you could reach consensus in one of two ways. 1) compare the transactions of each block one by one, and create a block consisting of the union of all transactions. or 2) Just pick one of the blocks and go with it. The second is what bitcoin actually does now. <br/><br/>It just picks using the worlds most expensive coin flipper. You could accomplish the same task with a much cheaper coin flipper and nothing in bitcoin would change one bit.<br/><br/>That is what I mean by \"design decision\" a it doesn't change any of the requirements for the system's features or behavior. It just implements things differently.<br/><br/>----<br/><br/>So when I talk about distributing the transaction graph throughout a distributed hash table it is just a different possible (but currently non-coded) way of implementing bitcoin's key feature. The feature of verifying the transfer of bitcoins from one address to another, in a way that makes it impossible to double spend coins.<br/><br/>Optimally, if you had x,000 transactions per minute and 100 nodes, each node would only have to do 1/100th of the work of a single node handling x,000 transactions per minute. Each transaction is only required to be recorded once.<br/><br/>However, with the current bitcoin implementation, if you have 100 nodes, they all run at 100% cpu for x,000 transactions. If you add another 100 nodes, they all still run at 100% cpu but do exactly the same job. We used to call it \"government work\" when you could do a job with 5 guys, but instead they used 50 guys, because more people working is better for the economy!<br/><br/>So the new design constraint I'm proposing, is that for a given number of nodes (n), it should take (Order (1/n)) or maybe (Order log(n)) work per cpu to handle a given number of transactions. In this case work means CPU time and network communication. My design modifications FAIL if they give up any of the transaction protections of the existing system.<br/><br/>----<br/><br/>It turns out that the block list itself is not required to validate transactions. Only the transactions are required. So to understand what I'm suggesting you have to think about an equivalent bitcoin implementation without a monolithic block list containing every transaction in the history of the system.<br/><br/>Instead, the transactions are redundantly scattered across all the nodes. No node need keep a complete list off all transactions, but they must be able to quickly retrieve any transaction on demand. Optimally in Order(1) time, but Order(log(n) time would probably suffice. That reduces the storage requirements of any given node to Order(1/n).<br/><br/>Transactions are mapped to nodes by transaction out-points. You generate two unique out-point identifiers by hashing the transaction+out-point information. You then store the transaction redundantly on the five \"closest nodes\" to each out-point ID. That means for a system with 10,000 nodes. Each transaction is stored with 10X redundancy instead of 10,000X redundancy. (the 10X was an arbitrary choice, the redundancy would be based upon the DHT algorithm and characteristics of the node population.)<br/><br/>Now each of those 10 nodes holds that out-point data completely privately, unless another node can show a \"need to know\". In this case a need to know is demonstrated by submitting a signed transaction that includes a given out-point as an in-point. In this case the storage node stores the new transaction. It also returns any known transactions referencing that out-point. If there is a previous transaction in-point associated with the out-point the second transaction is a double spend.<br/><br/>So for any new transaction, to verify it, you send it to the five closest nodes to each in-point on the transaction. They record the transaction and immediately tell you if they've seen a double spend. If any have, it's a bogus transaction, which gets broadcast to the other close nodes.<br/><br/>Now the what I'm suggesting also increases anonymity because you no longer have to broadcast every transaction you make to the world. Also random individuals can't go poking around in your business.<br/><br/>There are many ways to map bitcoin transactions to DHTs. I just chose an example that would be easy to explain. There may be other possibilities offer improvement. But this one is sufficient to get the point across.<br/><br/>There is also a fun technology called a \"dining cryptographers network\" that could further improve some of the anonymity aspects of bitcoin.<br/><br/><br/></div>",
        "post_num": 21,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8013#msg8013",
        "date": "August 06, 2010, 11:32:05 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8007#msg8007\">Quote from: Red on August 06, 2010, 11:08:28 PM</a></div><div class=\"quote\">So for any new transaction, to verify it, you send it to the five closest nodes to each in-point on the transaction. They record the transaction and immediately tell you if they've seen a double spend. If any have, it's a bogus transaction, which gets broadcast to the other close nodes.<br/></div><br/>What happens when they disagree about which transaction happened first?  Majority rule?  Who decides what the majority is, and can it change if 4 of the five nodes leave the network and are replaced by another 5 nodes?<br/><br/>And if I know that I'm going to create a large transaction, can I do some work precomputing node IDs such that the transaction (which I haven't yet sent out) will hash to nodes that I control?   If I control all the nodes storing the transaction, then I can just answer \"yes, absolutely, that transaction is valid and hasn't been double-spent...\"<br/><br/>The brilliant insight behind bitcoin is the distributed timestamping mechanism; everybody agrees on an order of transactions.  I don't see how your scheme solves that problem.<br/></div>",
        "post_num": 22,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8019#msg8019",
        "date": "August 06, 2010, 11:42:31 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg7995#msg7995\">Quote from: creighto on August 06, 2010, 10:27:03 PM</a></div><div class=\"quote\">Imagine this picture...<br/><br/>You have a full client on your Iphone running in the background, and then there is a power failure.  You head down to the corner store, and find that the shopkeeper has put everything in the cooler on sale half price, cash or bitcoins only.  Your cellphone client connects with the shopkeeper's cell phone client over ad-hoc bluetooth.  Signs the transfer accouncement (there are no actual cryptocoins in your wallet, they exist only as a series of entries into an encrypted ledger we call the blockchain, more like writing a check than actual coins) over to the shopkeeper's address.  Shopkeeper's client can then (but does not have to) check his copy of the blockchain to verify that you actually owned said bitcoins at the time of his last blockchain update.  If it's good locally, he can assume that you are not trying to cheat him and accept the trade and you leave with your half priced milk.  This does not protect the shopkeeper from an intentional double spend, but you still had to have honestly owned the coins at one time in order to do this.  If you did not own the coins at the time the power went out, his client would have rejected the transfer.<br/><br/><br/></div><br/>There was another point here that I intended to make.<br/><br/>As with the example above, most cash transactions are not actually anonymous, but psuedo-anonymous.  For example, one party can be well established (the shopkeeper) while the other is mostly anonymous, (the bargain hunter in the above example) but even the buyer is not truely anonymous.  He has been in the shop many times before, and even if the shopkeeper doesn't know his name, he has seen his face enough times to recognize it.  So there is some trust that, since he is a local or regular customer, that he is not some pro trying to sting him with an opprotunistic scam.<br/><br/>Another example of a psuedo-anonymous transaction is the kind that both parties are anonymous to the world, but not to each other.  This is actually how *most* cash transactions work in the real world; but online it could go like this...<br/><br/>You want to get something, let's say, unusual.  You find this guy on, say, Tor with a hidden website selling your wanted commodity.  He is known to you only as, \"pothead420\" on the website.  You have no other way to contact him, and no means of finding out who is actually is.  You don't trust this guy, but someone is going to have to take a leap of faith, and that someone is likely going to be you.  So at first, you order small.  After a few succesful trades, your trust grows that \"pothead420\" is an honest dealer; so your orders grow larger.  He could screw you over at any time without recourse, but then he would be cutting off a regular customer, so he has an incentive to continue to treat you properly.<br/><br/><br/>A third kind of pseudo-anonymous trust relationship could be found on this very forum that depends on reputation.  Most of us do not use our real names, but some of us do.  We assume that the member who uses the name of the bitcoin programmer is the actual programmer, and have some evidence to support this, but we cannot know for sure.  But, as far as this forum is concerned, he has a reputation.  So if you were to do direct business with him, and screw him, his word that you are not trustworthly would harm any business that you desired to conduct in the future, solely because he has a longer reputation than any newcomer.<br/><br/><br/>All of these examples involve some kind of two party trust, but not one requires both parties trust a third.  Not even the verification of the blockchain.</div>",
        "post_num": 23,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "NewLibertyStandard",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=26",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8021#msg8021",
        "date": "August 06, 2010, 11:55:47 PM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8019#msg8019\">Quote from: creighto on August 06, 2010, 11:42:31 PM</a></div><div class=\"quote\">All of these examples involve some kind of two party trust, but not one requires both parties trust a third.  Not even the verification of the blockchain.<br/></div>Trusted third parties are very useful when trading with someone you don't trust. One person trusts the trading administrator enough to deposit bitcoins and the other person trusts a payment processor such as Liberty Reserve or Pecunix to provide proof to the trading administrator that the payment occurred and he trust the trading site administrator that he'll accept proof of payment. Both traders have to trust the trading site and the payment processor, both third parties, but they don't need to trust each other.</div>",
        "post_num": 24,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8023#msg8023",
        "date": "August 07, 2010, 12:19:16 AM",
        "content": "<div class=\"post\">If you look for reasons to dismiss the idea out of hand, you will find them. However if you use the example to increase your understanding of why some P2P systems succeed yet many more fail, it will give you some insight.<br/><br/>In that spirit, let me answer your questions directly.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8013#msg8013\">Quote from: gavinandresen on August 06, 2010, 11:32:05 PM</a></div><div class=\"quote\">What happens when they disagree about which transaction happened first?  Majority rule?  Who decides what the majority is, and can it change if 4 of the five nodes leave the network and are replaced by another 5 nodes?<br/></div><br/>If ANY other transaction using that out-point is found there is a double spend, same rules as the current bitcoin system. The only way there can be disagreement is conflicting transactions got broadcast simultaneously but one arrived a close node A first and the conflicting one arrived at close node E first. By the end of the two 5 node broadcasts, both parties would discover the double spend.<br/><br/>So which one is valid? Who cares. Flip a coin. That is exactly what bitcoin does in this situation. If my node is working on a block with on transaction, and your node is working on a block with a conflicting transaction, whoever solves the block first wins. Distributed coin flipping algorithms are trivial. All of this can be done almost immediately. Much faster than in 10 minute windows. So no, the majority doesn't change if 4 nodes leave, because consensus was reached and the nodes were made consistent.<br/><br/>By the way, standard DHTs already address preserving data when nodes leave, and spreading the data when nodes join.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8013#msg8013\">Quote from: gavinandresen on August 06, 2010, 11:32:05 PM</a></div><div class=\"quote\">And if I know that I'm going to create a large transaction, can I do some work precomputing node IDs such that the transaction (which I haven't yet sent out) will hash to nodes that I control?   If I control all the nodes storing the transaction, then I can just answer \"yes, absolutely, that transaction is valid and hasn't been double-spent...\"<br/></div><br/>No, this would be a requirement constraint. It is possible for the same reason that it is impossible to generate two public keys that match to the same bitcoin address. See my previous faux pas.<br/><br/>Nodes would generate node addresses based upon private keys, exactly as is being done for bitcoin addresses. This makes node spoofing implausible. All of the inputs to the out-point hash are fixed except the payee, which is pre-specified. The only flexibility I can think of would be in the payment amount. If you want to iterate through all possible amounts and try to create a simultaneous 5 way hash collision, knock yourself out.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8013#msg8013\">Quote from: gavinandresen on August 06, 2010, 11:32:05 PM</a></div><div class=\"quote\">The brilliant insight behind bitcoin is the distributed timestamping mechanism; everybody agrees on an order of transactions.  I don't see how your scheme solves that problem.<br/></div><br/>It actually solves the problem in exactly the same way, just with much less CPU power.<br/><br/>The brilliant insight behind bitcoin's distributed time stamping mechanism is you don't need absolute timestamps at all! You only need relative order. And for conflicts in a short window, you don't have to care at all. You can simply arbitrarily choose one.<br/><br/>My solution does exactly the same thing. It maintains relative order among transactions. It arbitrarily reaches consensus on conflicts. Neither method has a requirement to accurately order unrelated transactions by time. Again, that was a brilliant insight.<br/><br/><br/></div>",
        "post_num": 25,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8035#msg8035",
        "date": "August 07, 2010, 01:20:01 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8023#msg8023\">Quote from: Red on August 07, 2010, 12:19:16 AM</a></div><div class=\"quote\">So which one is valid? Who cares. Flip a coin. That is exactly what bitcoin does in this situation. If my node is working on a block with on transaction, and your node is working on a block with a conflicting transaction, whoever solves the block first wins.<br/></div>Now I'm confused again.  I thought your scheme didn't have blocks, just transactions.  What do you mean, whoever solves \"the block\" first?<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">By the way, standard DHTs already address preserving data when nodes leave, and spreading the data when nodes join.</div>But standard DHTs are typically used to store chunks of MP3s or movies, indexed by a torrent file that has the hash for every piece.  So it is easy for me to tell whether or not I'm getting bad data from any particular DHT node.  I don't have to trust them.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">Nodes would generate node addresses based upon private keys, exactly as is being done for bitcoin addresses. This makes node spoofing implausible.<br/></div>Huh?  Lets say the network has 10,000 nodes in it.  I query the network to find the network node closest to a transaction that I want to double-spend.<br/><br/>So I generate a private key.  It has about a 1 in 10,000 chance of being closer than the current closest node.  So I keep generating private keys until I have 5 that are closer.  It's too late for me to figure out the odds, but lets say I generate 100,000 private keys, I'm pretty darn likely to find 5.  My wimpy laptop can generate at LEAST 100 ECC keys/second, so in under 20 minutes it could generate 100,000.<br/><br/>I create 5 nodes with those keys (telling the rest of the network \"honest, folks, I chose those keys RANDOMLY...\") and I've won.<br/><br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">All of the inputs to the out-point hash are fixed except the payee, which is pre-specified. The only flexibility I can think of would be in the payment amount. If you want to iterate through all possible amounts and try to create a simultaneous 5 way hash collision, knock yourself out.</div>I'm not trying to generate a transaction with a particular hash, I'm trying to generate node ids that are \"closer\" to that transaction's hash than any other node currently on the network.  That's much easier.<br/></div>",
        "post_num": 26,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "MoonShadow",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=643",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8038#msg8038",
        "date": "August 07, 2010, 02:09:03 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8021#msg8021\">Quote from: NewLibertyStandard on August 06, 2010, 11:55:47 PM</a></div><div class=\"quote\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8019#msg8019\">Quote from: creighto on August 06, 2010, 11:42:31 PM</a></div><div class=\"quote\">All of these examples involve some kind of two party trust, but not one requires both parties trust a third.  Not even the verification of the blockchain.<br/></div>Trusted third parties are very useful when trading with someone you don't trust. <br/><br/></div><br/>Yes, but I was pointing out that waiting for verification is not usually neccessary in common usage of the currency.  It's the unknowns that call for waiting for verification or the use of a trusted third party.<br/>So most everyday transactions, either online or IRL, can be performed with faith instantly, or with the additional confidence of the local client verification almost instantly.  The 10 minute lag isn't really a detriment.<br/></div>",
        "post_num": 27,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Red",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=525",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8039#msg8039",
        "date": "August 07, 2010, 02:39:04 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8035#msg8035\">Quote from: gavinandresen on August 07, 2010, 01:20:01 AM</a></div><div class=\"quote\">Now I'm confused again.  I thought your scheme didn't have blocks, just transactions.  What do you mean, whoever solves \"the block\" first?<br/></div><br/>My scheme doesn't have blocks. I was referring here to how the existing system operates.<br/><br/><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8035#msg8035\">Quote from: gavinandresen on August 07, 2010, 01:20:01 AM</a></div><div class=\"quote\">Huh?  Lets say the network has 10,000 nodes in it.  I query the network to find the network node closest to a transaction that I want to double-spend.<br/><br/>So I generate a private key.  It has about a 1 in 10,000 chance of being closer than the current closest node.  So I keep generating private keys until I have 5 that are closer.  It's too late for me to figure out the odds, but lets say I generate 100,000 private keys, I'm pretty darn likely to find 5.  My wimpy laptop can generate at LEAST 100 ECC keys/second, so in under 20 minutes it could generate 100,000.<br/><br/>I create 5 nodes with those keys (telling the rest of the network \"honest, folks, I chose those keys RANDOMLY...\") and I've won.<br/><br/>I'm trying to generate node ids that are \"closer\" to that transaction's hash than any other node currently on the network.  That's much easier.<br/></div>Yes, It's much easier!<br/><br/>You've made a quite plausible argument for this particular case. Kudos! <br/><br/>I'm not going to do the math either because that is really not the point. I'm not proposing \"The solution\". I'm suggesting that the amount of compute resources doesn't need to scale so badly to satisfy bitcoin's requirements. I'm only trying to show that there are other reasonable designs that can meet bitcoin's requirements with significantly lower CPU usage, and in the case of this thread less latency.<br/><br/>I think with the brain-trust that is this forum, any limitations in a distributed solution are easily discovered and rectified. Just as is being done with the current implementation. Perhaps I chose a poor way to create a node ID. Freenet proposes an entirely different way of shared generation of node IDs. It doesn't suffer from the issues you point out. Perhaps it has other issues in this situation. But I'm confident there exist a distributed implementation that would work.<br/><br/>Is the main thrust and incredulity in your argument because you think there CANNOT be a better solution than burning 100,000 CPU at 100% 24/7 and sending 100,000+ redundant messages per transaction? <br/><br/>(100,000 was Satoshi's number of expected core nodes for a system that supported millions of users)<br/><br/> </div>",
        "post_num": 28,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "Gavin Andresen",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=224",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8078#msg8078",
        "date": "August 07, 2010, 11:52:14 AM",
        "content": "<div class=\"post\"><div class=\"quoteheader\"><a href=\"https://bitcointalk.org/index.php?topic=723.msg8039#msg8039\">Quote from: Red on August 07, 2010, 02:39:04 AM</a></div><div class=\"quote\">Is the main thrust and incredulity in your argument because you think there CANNOT be a better solution than burning 100,000 CPU at 100% 24/7 and sending 100,000+ redundant messages per transaction? <br/></div>No, not at all.  Like I said when I jumped into this thread, I think using a DHT network to somehow distribute the work is a very interesting idea, it just seems to me any solution that partitions the network will be more vulnerable to attacks that insert malicious nodes.  I think it would be fantastic to come up with less resource-intensive solution that actually works.<br/><br/>How does Freenet generate node IDs?  The only info I see in the latest Freenet paper is:<br/><div class=\"quoteheader\">Quote</div><div class=\"quote\">When joining, nodes choose an identity at random, and then connect to those peers with whom they have a pre-established trusted relationship.</div>.... and:<div class=\"quoteheader\">Quote</div><div class=\"quote\">The perhaps largest advantage that the trusted-connection model offers over traditional anonymity networks is protection against the Sybil attack [13], where a single attacker infiltrates the network by pretending to have many identities. Since the network depends on out of band trust relationships, an attacker gains strength only through the number of people he can fool into trusting him, and gains nothing by presenting multiple identities online.</div>...which doesn't sound like it would work very well for Bitcoin.</div>",
        "post_num": 29,
        "is_displayed": true,
        "nested_level": 0
    },
    {
        "thread_id": 168,
        "name": "satoshi",
        "poster_url": "https://bitcointalk.org/index.php?action=profile;u=3",
        "subject": "Re: latency and locality",
        "url": "https://bitcointalk.org/index.php?topic=723.msg8103#msg8103",
        "date": "August 07, 2010, 04:28:17 PM",
        "content": "<div class=\"post\">Once you get away from a system where each node's influence is proportional to their CPU power, then what else do you use to determine who is (approximately) one person?<br/></div>",
        "post_num": 30,
        "is_displayed": true,
        "nested_level": 0
    }
]